{
  "metadata": {
    "timestamp": "20251116_071219",
    "input_file": "data/deduplicated/20251116_071219.json",
    "stage": "keyword_filter",
    "stats": {
      "input_count": 111,
      "filtered_count": 102,
      "blacklisted_count": 9,
      "reduction_rate": "8.1%",
      "top_blacklist_reasons": {
        "stau": 2,
        "regen": 2,
        "temperatur": 2,
        "fußball": 1,
        "überfall": 1,
        "baustelle": 1
      }
    }
  },
  "articles": [
    {
      "title": "China sends coast guard to Senkaku islands amid row with Japan",
      "link": "https://www.theguardian.com/world/2025/nov/16/china-sends-coast-guard-to-senkaku-islands-amid-row-with-japan",
      "published": "2025-11-16T07:02:46",
      "content": "Activity around Japanese-held islands, also claimed by China, comes after PM Sanae Takaichi said Japan might respond militarily to an invasion of TaiwanChina has sent its coast guard through the waters of the Senkaku islands and military drones past outlying Japanese territory as Beijing ramps up tensions over the Japanese prime minister’s remarks on Taiwan.On Sunday the Chinese coast guard said its ships made a “rights enforcement patrol” through the waters of the Senkaku, which are administered by Japan but also claimed by China as the Diaoyu islands. Continue reading...",
      "content_length": 579,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Britain’s biggest housebuilder urges government to support first-time buyers",
      "link": "https://www.theguardian.com/business/2025/nov/16/britains-biggest-housebuilder-urges-government-to-support-first-time-buyers",
      "published": "2025-11-16T07:00:27",
      "content": "Taylor Wimpey chief Jennie Daly calls for revival of help-to-buy equity loan scheme to revive property marketThe boss of one of Britain’s biggest housebuilders has urged the government to announce more support for first-time buyers to revive a property market that has cooled in the “very long shadow” of the looming budget.Jennie Daly, the chief executive of Taylor Wimpey, also warned against an “accumulation of regulation”, arguing that a “perverse outcome” of green measures could be that it becomes unviable to build new homes in poorer areas of the country. Continue reading...",
      "content_length": 584,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Domestic abuse victims who flee with children overseas to be criminalised under new law",
      "link": "https://www.theguardian.com/uk-news/2025/nov/16/domestic-abuse-victims-children-overseas-crime-police-bill-law",
      "published": "2025-11-16T07:00:26",
      "content": "Change to crime and policing bill backed by fathers’ rights groups seeking support in cross-border abduction casesMothers fleeing domestic violence who keep their children overseas without permission would be criminalised for the first time under a new law.The change is introduced in a proposed amendment to the crime and policing bill, backed by fathers’ rights groups and the Reunite International charity. The amendment has not been debated in parliament, and is now before the House of Lords. Continue reading...",
      "content_length": 517,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Migrations-Politik - Großbritannien plant deutliche Asylrechts-Verschärfung nach dänischem Vorbild",
      "link": "https://www.deutschlandfunk.de/grossbritannien-plant-deutliche-asylrechts-verschaerfung-nach-daenischem-vorbild-106.html",
      "published": "2025-11-16T06:59:20",
      "content": "Die britische Labour-Regierung will ihre Asylpolitik deutlich verschärfen.",
      "content_length": 74,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Mexiko - 120 Verletzte bei Protesten gegen Gewaltkriminalität",
      "link": "https://www.deutschlandfunk.de/120-verletzte-bei-protesten-gegen-gewaltkriminalitaet-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "In Mexiko ist es bei Protesten gegen Gewaltkriminalität zu schweren Ausschreitungen gekommen.",
      "content_length": 93,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Pressebericht - Behörden fahnden nach 535 Rechtsextremisten mit offenen Haftbefehlen",
      "link": "https://www.deutschlandfunk.de/behoerden-fahnden-nach-535-rechtsextremisten-mit-offenen-haftbefehlen-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "Die deutsche Polizei fahndet derzeit nach 535 Rechtsextremisten mit offenen Haftbefehlen.",
      "content_length": 89,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "JU-Deutschlandtag - Auch Fraktionschef Spahn erwartet keine Änderungen beim Rentenkompromiss",
      "link": "https://www.deutschlandfunk.de/auch-fraktionschef-spahn-erwartet-keine-aenderungen-beim-rentenkompromiss-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "Nach Bundeskanzler Merz hat auch Unionsfraktionschef Spahn Hoffnungen des Parteinachwuchses auf Änderungen am Rentenpaket gedämpft. Die in der Koalition getroffene Vereinbarung sei ein Kompromiss, sagte der CDU-Politiker beim Deutschlandtag der Jungen Union im südbadischen Rust.",
      "content_length": 279,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Volkstrauertag - Präsident des Volksbundes warnt vor einem Verfall der Kriegsgräber",
      "link": "https://www.deutschlandfunk.de/praesident-des-volksbundes-warnt-vor-einem-verfall-der-kriegsgraeber-102.html",
      "published": "2025-11-16T06:59:20",
      "content": "Deutschland gedenkt am heutigen Volkstrauertag der Toten von Krieg und Gewaltherrschaft.",
      "content_length": 88,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Volkstrauertag - Gedenken an die Kriegstoten seit 1922",
      "link": "https://www.deutschlandfunk.de/gedenken-an-die-kriegstoten-seit-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "Der vom Volksbund Deutsche Kriegsgräberfürsorge jährlich organisierte Volkstrauertag erinnert an die Opfer von Kriegen und Gewalt weltweit. Auf Friedhöfen und an Kriegsgräberstätten gibt es Gedenkveranstaltungen, Gottesdienste und Kranzniederlegungen. Hier ein paar Fakten zur Geschichte des Trauertags:",
      "content_length": 303,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Dominikanische Republik - Boot von Drogenschmugglern mit US-Hilfe gestoppt",
      "link": "https://www.deutschlandfunk.de/boot-von-drogenschmugglern-mit-us-hilfe-gestoppt-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "Vor der Küste der Dominikanischen Republik haben Einsatzkräfte des Landes in Zusammenarbeit mit den USA ein Boot von Drogenschmugglern abgefangen.",
      "content_length": 146,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Sinkende Luftverkehrsteuer - Unions-Verkehrspolitiker: \"Flug-Ticketpreise müssen runter\"",
      "link": "https://www.deutschlandfunk.de/unions-verkehrspolitiker-flug-ticketpreise-muessen-runter-102.html",
      "published": "2025-11-16T06:59:20",
      "content": "Der Unions-Verkehrspolitiker Stracke dringt nach der beschlossenen Steuersenkung für die Luftverkehrsbranche auf günstigere Ticketpreise.",
      "content_length": 137,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Weltklimakonferenz - Bundesumweltminister Schneider in Belém eingetroffen",
      "link": "https://www.deutschlandfunk.de/bundesumweltminister-schneider-in-bel-m-eingetroffen-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "Bundesumweltminister Schneider ist am Ort der Weltklimakonferenz im brasilianischen Belém eingetroffen.",
      "content_length": 103,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Zeremonie in Doha - Kongo und M23-Miliz vereinbaren Umsetzung von Waffenruhe",
      "link": "https://www.deutschlandfunk.de/kongo-und-m23-miliz-vereinbaren-umsetzung-von-waffenruhe-108.html",
      "published": "2025-11-16T06:59:20",
      "content": "Die Regierung der Demokratischen Republik Kongo und die M23-Miliz haben sich auf die Umsetzung ihrer Waffenruhe verständigt.",
      "content_length": 124,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Wirtschaftliche Zusammenarbeit - Reiche reist in die Golfregion",
      "link": "https://www.deutschlandfunk.de/reiche-reist-in-die-golfregion-102.html",
      "published": "2025-11-16T06:59:20",
      "content": "Bundeswirtschaftsministerin Reiche bricht heute zu einer Reise in die Vereinigten Arabischen Emirate und nach Katar auf.",
      "content_length": 120,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Rechts gegen Links - Chilenen wählen neuen Staatschef",
      "link": "https://www.deutschlandfunk.de/chilenen-waehlen-neuen-staatschef-106.html",
      "published": "2025-11-16T06:59:20",
      "content": "In Chile wird ab heute ein neues Staatsoberhaupt bestimmt.",
      "content_length": 58,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Deutsch-Chinesischer Finanzdialog - Finanzminister Klingbeil zu Besuch in Peking",
      "link": "https://www.deutschlandfunk.de/finanzminister-klingbeil-zu-besuch-in-peking-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "Bundesfinanzminister Klingbeil reist heute zum deutsch-chinesischen Finanzdialog nach Peking.",
      "content_length": 93,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Jüdisches Museum Berlin - Frühere US-Botschafterin Gutmann und Physiker Zajfman geehrt",
      "link": "https://www.deutschlandfunk.de/fruehere-us-botschafterin-gutmann-und-physiker-zajfman-geehrt-116.html",
      "published": "2025-11-16T06:59:20",
      "content": "Das Jüdische Museum Berlin hat die ehemalige Botschafterin der Vereinigten Staaten in Deutschland, Amy Gutmann, und den israelischen Physiker Daniel Zajfman mit dem diesjährigen \"Preis für Verständigung und Toleranz\" geehrt. Museumsdirektorin Hetty Berg sagte, so bedrückend die Gegenwart sei, man dürfe sich davon nicht die Fähigkeit nehmen lassen, sich ein besseres Morgen vorzustellen.",
      "content_length": 388,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "EU-Erweiterungsprozess - Außenminister Wadephul reist in alle Westbalkan-Staaten",
      "link": "https://www.deutschlandfunk.de/aussenminister-wadephul-reist-in-alle-westbalkan-staaten-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "Bundesaußenminister Wadephul beginnt heute eine Reise in alle sechs Staaten des westlichen Balkans auf.",
      "content_length": 103,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Dlf-\"Interview der Woche\" - Wehrbeauftragter Otte begrüßt Wehrdienst-Kompromiss",
      "link": "https://www.deutschlandfunk.de/wehrbeauftragter-otte-begruesst-wehrdienst-kompromiss-122.html",
      "published": "2025-11-16T06:59:20",
      "content": "Der Wehrbeauftragte des Bundestags, Otte, begrüßt die Einigung der Regierungskoalition auf ein neues Wehrdienst-Gesetz.",
      "content_length": 119,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Ukraine - Mindestens ein Toter bei Luftangriffen auf Dnipro",
      "link": "https://www.deutschlandfunk.de/mindestens-ein-toter-bei-luftangriffen-auf-dnipro-112.html",
      "published": "2025-11-16T06:59:20",
      "content": "Bei erneuten russischen Drohnenangriffen auf das ostukrainische Gebiet Dnipro ist mindestens ein Mensch getötet worden.",
      "content_length": 119,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Sachsen - Ministerpräsident Kretschmer will Rückkehr zu Energie aus Russland",
      "link": "https://www.deutschlandfunk.de/ministerpraesident-kretschmer-will-rueckkehr-zu-energie-aus-russland-106.html",
      "published": "2025-11-16T06:59:20",
      "content": "Sachsens Ministerpräsident Kretschmer hat sich für eine perspektivische Rückkehr zu Energielieferungen aus Russland ausgesprochen.",
      "content_length": 130,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Dokumente von NS-Opfern - Auschwitz-Komitee kritisiert geplante Auktion in Neuss",
      "link": "https://www.deutschlandfunk.de/auschwitz-komitee-kritisiert-geplante-auktion-in-neuss-112.html",
      "published": "2025-11-16T06:59:20",
      "content": "Das Internationale Auschwitz Komitee kritisiert eine geplante Versteigerung von Dokumenten aus der NS-Zeit.",
      "content_length": 107,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Sturmtief über Westeuropa - Ein Toter in Portugal, Überschwemmungen in Wales",
      "link": "https://www.deutschlandfunk.de/ein-toter-in-portugal-ueberschwemmungen-in-wales-104.html",
      "published": "2025-11-16T06:59:20",
      "content": "Beim Sturmtief \"Claudia\" ist an der portugiesischen Algarve-Küste mindestens ein Mensch ums Leben gekommen.",
      "content_length": 107,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Wahl zum Abgeordnetenhaus - SPD wählt Steffen Krach zum Spitzenkandidaten",
      "link": "https://www.deutschlandfunk.de/spd-waehlt-steffen-krach-zum-spitzenkandidaten-104.html",
      "published": "2025-11-16T06:59:20",
      "content": "Die Berliner SPD hat den früheren Staatssekretär Krach zum Spitzenkandidaten für die Wahl zum Abgeordnetenhaus bestimmt.",
      "content_length": 120,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Mitgliederversammlung - Ulla Schmidt als Bundesvorsitzende der Lebenshilfe bestätigt",
      "link": "https://www.deutschlandfunk.de/ulla-schmidt-als-bundesvorsitzende-der-lebenshilfe-bestaetigt-108.html",
      "published": "2025-11-16T06:59:20",
      "content": "Die frühere Bundesgesundheitsministerin Schmidt ist für weitere vier Jahre im Amt der Vorsitzenden der Lebenshilfe bestätigt worden.",
      "content_length": 132,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Vatikan - Papst Leo empfängt Filmschaffende",
      "link": "https://www.deutschlandfunk.de/papst-leo-empfaengt-filmschaffende-110.html",
      "published": "2025-11-16T06:59:20",
      "content": "Papst Leo XIV. hat zahlreiche internationale Schauspieler, Regisseure, Produzenten und Kameraleute im Vatikan empfangen. In seiner Ansprache würdigte der Papst die Filmkultur und rief dazu auf, das Kino zu schützen.",
      "content_length": 215,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Ski-Weltcup in Finnland - Emma Aicher fährt im Slalom als Dritte aufs Podest",
      "link": "https://www.deutschlandfunk.de/emma-aicher-faehrt-im-slalom-als-dritte-aufs-podest-106.html",
      "published": "2025-11-16T06:59:20",
      "content": "Beim ersten Ski-Weltcup der Saison im finnischen Levi hat die deutsche Skirennfahrerin Emma Aicher den dritten Platz belegt. Die US-Amerikanerin Mikaela Shiffrin sicherte sich Platz eins vor Lara Colturi aus Albanien.",
      "content_length": 217,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Coalition announce emissions policy after joint party room; more magic sand products recalled over asbestos contamination – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/nov/16/australia-news-live-liberal-coalition-net-zero-sussan-ley-penny-wong-labor-cop30-chris-bowen-albanese-storms-queensland-nsw-ntwnfb",
      "published": "2025-11-16T06:20:57",
      "content": "This blog is now closedGet our breaking news email, free app or daily news podcastTotal fire ban in parts of New South WalesWhile a storm system continues to affect parts of New South Wales’ east, the state’s west faces extreme fire danger.I expect it will be pretty much what the Nationals have wanted all along because it’s been really clear that they have set the agenda in terms of the energy and climate policy of the Liberal Party.I’m genuinely concerned and genuinely disappointed that this has happened because we do need to take action on climate change.I think my a lot of my community will be going ‘Why on earth has the Coalition done this if they are seeking to ever take back seats’ like mine? Continue reading...",
      "content_length": 727,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Senioren-Union zum Rentenstreit: \"Sorgen der jungen Generation sind berechtigt\"",
      "link": "https://www.tagesschau.de/inland/innenpolitik/rentenstreit-102.html",
      "published": "2025-11-16T06:18:33",
      "content": "   Die Junge Union bekommt Unterstützung für ihre Kritik am Rentenkurs der Regierung. Der Vorsitzende der Senioren-Union, Hüppe, sagte dem RND, die Sorgen der jungen Generation seien mit Blick auf die Finanzierung der Rente berechtigt.[mehr]",
      "content_length": 241,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Thirteen people injured after demolition derby car ploughs into grandstand during NSW event",
      "link": "https://www.theguardian.com/australia-news/2025/nov/16/thirteen-people-injured-after-speedway-car-ploughs-into-grandstand-during-nsw-demolition-derby",
      "published": "2025-11-16T06:16:25",
      "content": "Two in critical condition after driver crashes into crowd at Walcha Motorcycle Rally about 90km from TamworthFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastA demolition derby car lost control and ploughed into a grandstand, injuring 13 rural motoring enthusiasts on Saturday night.Emergency services rushed to Walcha’s showgrounds, which 90km from Tamworth in New South Wales, early in the evening after a crash at the Walcha Motorcycle Rally. Continue reading...",
      "content_length": 529,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Depoortère double helps France survive scare from spirited Fiji",
      "link": "https://www.france24.com/en/sport/20251116-depoort%C3%A8re-double-helps-france-survive-scare-from-spirited-fiji",
      "published": "2025-11-16T06:04:26",
      "content": "Les Bleus fended off a major scare from Fiji Saturday after the game drew equal following France's early 21-point lead. A pair of crucial tries from centre Nicolas Depoortère secured France's victory and brought the team's four-game losing streak to an end.",
      "content_length": 257,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "‘There is a gap where Alex should be’: the young woman who lost her life in a neglectful prison system",
      "link": "https://www.theguardian.com/society/2025/nov/16/there-is-a-gap-where-alex-should-be-the-young-woman-who-lost-her-life-in-a-neglectful-prison-system",
      "published": "2025-11-16T06:00:25",
      "content": "An inquest has found a Cheshire prison guilty of neglect after Alex Davies, 25, was found dead inside a segregation cell after a lifetime of mental health struggles“There is a gap or a space where Alex should be,” Stacie Davies said. “Wherever I am, she’s not there.”At just 25 years old, her daughter, Alex Davies, was found dead in her segregation cell at Styal prison in Cheshire on Christmas Eve last year. Continue reading...",
      "content_length": 430,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Michael Jackson is moonwalking back, but after the Springsteen flop is the pop biopic still relevant?",
      "link": "https://www.theguardian.com/music/2025/nov/16/michael-jackson-comeback-legacy-abuse-allegations",
      "published": "2025-11-16T06:00:25",
      "content": "Jackson’s songs are back on charts and biopic trailer racked up 116m views in 24 hours, yet there is a certain hesitation Michael Jackson’s voodoo classic Thriller was high on Billboard’s Hot 100 in the week of 15 November, handing the 16-years-gone King of Pop a record for having a Top 10 hit across six different decades. Simultaneously, Jackson also broke records for receiving 116m views in 24 hours for the trailer of a new biopic, Michael, set for release in April.Millions of fans may be excited and primed for a Jackson biopic. For comparison, the trailer beat out Taylor Swift’s Eras tour preview and it will join a procession of recent music biopics about Bruce Springsteen, Amy Winehouse, Bob Dylan, Elvis Presley and Elton John. The most successful of all – the Freddie Mercury and Queen biopic Bohemian Rhapsody – took in nearly a billion dollars at the box office. Continue reading...",
      "content_length": 899,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "French ‘counter-monument’ holds up a mirror to ghosts of colonial Algeria",
      "link": "https://www.france24.com/en/france/20251116-french-counter-monument-holds-up-mirror-ghosts-colonialism-algeria-nancy",
      "published": "2025-11-16T05:48:28",
      "content": "A “counter-monument” unveiled last week in the city of Nancy invites viewers to reflect on a dark chapter in French history and acknowledge traumas that have long been silenced. Bringing a fresh perspective to the debate on colonial monuments in public spaces, the initiative addresses a generational thirst for knowledge about a troubled past that continues to cast a long and divisive shadow.",
      "content_length": 394,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Gen Z protests against Mexico president turn violent amid anger over mayor’s death",
      "link": "https://www.theguardian.com/world/2025/nov/16/gen-z-protests-against-mexico-president-turn-violent-amid-anger-over-mayors-death",
      "published": "2025-11-16T05:17:26",
      "content": "100 police officers injured in Mexico City as demonstrators attack National Palace following death of Michoacan mayor who fought drug traffickingAt least 120 people, mostly police officers, were injured as thousands marched through Mexico City to protest against the government of Mexico’s president, Claudia Sheinbaum.The demonstration on Saturday was organised by members of generation Z, but ended with strong backing from older supporters of opposition parties. Continue reading...",
      "content_length": 485,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Freier bestrafen, Prostituierte schützen - funktioniert das?",
      "link": "https://www.tagesschau.de/inland/gesellschaft/sexkaufverbot-prostitution-nordisches-modell-100.html",
      "published": "2025-11-16T04:00:08",
      "content": "   Gesundheitsministerin Warken hat sich für ein Sexkaufverbot ausgesprochen, Aktivistinnen kämpfen schon lange für das sogenannte Nordische Modell. Können Prostituierte dadurch geschützt werden, dass man ihre Freier bestraft? Von Tim Kukral.[mehr]",
      "content_length": 248,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "We have lift-off! Melbourne’s skyscraper peregrine chicks take to the sky",
      "link": "https://www.theguardian.com/australia-news/2025/nov/16/we-have-lift-off-melbournes-skyscraper-peregrine-chicks-take-to-the-sky",
      "published": "2025-11-16T03:35:04",
      "content": "Falcon fledglings’ inaugural flight watched by dedicated fans includes dramatic crash-landingFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastA trio of young falcons born atop a 35-storey building in Melbourne’s CBD have taken flight for the first time, with the take-off captured on a livestream for the world to see.The three peregrine falcons – two females and one male – fledged late last week, with the footage of their first flight posted on Instagram by non-profit organisation Bird Life Australia. The last falcon took flight shortly after 9am on Saturday for the second time – after returning to the ledge in a crash landing the day before. Continue reading...",
      "content_length": 733,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Ausschreitungen bei Gen-Z-Protest in Mexiko",
      "link": "https://www.tagesschau.de/ausland/amerika/mexiko-protest-104.html",
      "published": "2025-11-16T03:09:31",
      "content": "   Gewalt gegen Politiker ist ein großes Problem in Mexiko. Dagegen sind Tausende junge Menschen auf die Straße gegangen. Am Rande des Protests der Generation Z kam es zu Ausschreitungen, zahlreiche Polizisten wurden verletzt.[mehr]",
      "content_length": 232,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Belém: Chaotisch, sympathisch - und voller Widersprüche",
      "link": "https://www.tagesschau.de/ausland/amerika/belem-cop-100.html",
      "published": "2025-11-16T01:48:17",
      "content": "   Die Stadt Belém hat vor der Klimakonferenz viel Geld ausgegeben und unter anderem Hafen und Markt renoviert. Wie erleben die Menschen die COP30? Anne Herrberg hat mit ihnen gesprochen und Superfood, Musik und Elixire kennengelernt.[mehr]",
      "content_length": 240,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "CDU diskutiert über Energieimporte aus Russland",
      "link": "https://www.tagesschau.de/inland/innenpolitik/russland-diskussion-kretschmer-100.html",
      "published": "2025-11-16T01:41:18",
      "content": "   Nicht nur in der AfD gibt es eine Diskussion über den Umgang mit Russland. Auch die CDU ringt um ihren Kurs: Sachsens Ministerpräsident Kretschmer denkt über neue Handelsbeziehungen zu Moskau nach, anderen gefällt das nicht.[mehr]",
      "content_length": 233,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Britische Regierung verschärft Asylpolitik",
      "link": "https://www.tagesschau.de/ausland/europa/grossbritannien-migration-verschaerfung-102.html",
      "published": "2025-11-16T01:39:20",
      "content": "   Die britische Regierung hat eine Reform der Asylpolitik nach dem Vorbild Dänemarks angekündigt. Hilfen werden gestrichen, Rückführungen erleichtert. So will die Regierung die Zahl der Flüchtlinge verringern. [mehr]",
      "content_length": 217,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Alice Wong, ‘luminary’ writer and disability rights activist, dies aged 51",
      "link": "https://www.theguardian.com/us-news/2025/nov/15/alice-wong-disability-rights-activist-dies-aged-51",
      "published": "2025-11-16T00:35:05",
      "content": "Daughter of immigrants advocated for people with disabilities to have full autonomy over their livesAlice Wong, a writer and disability rights activist who was born with muscular dystrophy and whose independence and writing inspired others, has died. She was 51.Wong died Friday at a hospital in San Francisco due to an infection, said Sandy Ho, a close friend who has been in touch with Wong’s family. Continue reading...",
      "content_length": 422,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Federal immigration officers begin sweep in Charlotte, North Carolina",
      "link": "https://www.theguardian.com/us-news/2025/nov/15/charlotte-north-carolina-federal-immigration-sweep",
      "published": "2025-11-16T00:02:24",
      "content": "Local reports say targets include church parishioners doing yard work and workers hanging Christmas lightsFederal immigration officers on Saturday began a sweep through Charlotte, the largest city in North Carolina, federal officials confirmed.Local media reports said that among the locations targeted by masked federal agents was a church in east Charlotte, where an arrest was made while about 15 to 20 church members were doing yard work on the property. Continue reading...",
      "content_length": 478,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Nature not a blocker to housing growth, inquiry finds",
      "link": "https://www.theguardian.com/uk-news/2025/nov/16/nature-not-blocker-housing-growth-inquiry",
      "published": "2025-11-16T00:01:16",
      "content": "Commons committee report challenges ‘lazy narrative’ used by ministers that scapegoats wildlife and the environmentNature is not a blocker to housing growth, an inquiry by MPs has found, in direct conflict with claims made by ministers.Toby Perkins, the Labour chair of the environmental audit committee, said nature was being scapegoated, and that rather than being a block to growth, it was necessary for building resilient towns and neighbourhoods. Continue reading...",
      "content_length": 471,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Teenager charged with murder after death of girl, 17, in South Wales",
      "link": "https://www.theguardian.com/uk-news/2025/nov/15/teenager-charged-with-after-death-of-girl-17-in-south-wales",
      "published": "2025-11-15T23:09:28",
      "content": "Gwent police name victim as Lainie Williams and have charged Cameron Cheng, 18, a British nationalA teenager has been charged with murder after a 17-year-old girl was killed in South Wales.The girl, named as Lainie Williams, was pronounced dead at the scene, Gwent police said. Continue reading...",
      "content_length": 297,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Israeli army claims Gazans who arrived in S. Africa on mystery plane had been granted entry",
      "link": "https://www.france24.com/en/middle-east/20251115-israel-army-gazans-palestinian-refugees-south-africa-mystery-plane-granted-entry-ramaphosa",
      "published": "2025-11-15T22:03:21",
      "content": "Israeli authorities said on Saturday that the 153 Gazans flown to South Africa earlier this week had received entry clearance from a third state before take-off. A spokesperson for the Israeli military branch overseeing the operation told FRANCE 24 that the “third country” was in fact South Africa.",
      "content_length": 299,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Suspect arrested in shooting death of beloved Oakland football coach",
      "link": "https://www.theguardian.com/us-news/2025/nov/15/suspect-arrested-oakland-football-coach",
      "published": "2025-11-15T21:31:01",
      "content": "Cedric Irving Jr, 27, is alumnus of high school where John Beam taught before gaining fame on Netflix’s Last Change UA 27-year-old Skyline high school alumnus, frequently seen lingering near Laney College, has been taken into custody in connection with the fatal shooting of Oakland football coach John Beam.Police identified the suspect as Cedric Irving Jr, who was apprehended before dawn at the San Leandro, California, Bart station, ending an urgent search for the individual believed responsible. Continue reading...",
      "content_length": 521,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Marjorie Taylor Greene says she’s had ‘warnings for my safety’ after posts by Trump",
      "link": "https://www.theguardian.com/us-news/2025/nov/15/marjorie-taylor-greene-safety-trump",
      "published": "2025-11-15T20:07:08",
      "content": "One-time Maga loyalist diverges with Trump on issues including Epstein, so US president has withdrawn supportMarjorie Taylor Greene, a longtime Republican ally who previously fiercely defended Donald Trump and his Maga movement, said on Saturday she had been contacted by private security firms “with warnings for my safety” after Trump announced on Friday he was withdrawing his support for and endorsement of the Georgia representative.In a post on X, Greene said that “a hot bed of threats against me are being fueled and egged on by the most powerful man in the world”, without referring to Trump by name, adding it was “the man I supported and helped get elected”. Continue reading...",
      "content_length": 689,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "French official to sue over ‘revisionist’ remarks hailing Nazi collaborator Pétain",
      "link": "https://www.france24.com/en/france/20251115-french-official-to-sue-over-revisionist-remarks-hailing-nazi-collaborator-p%C3%A9tain",
      "published": "2025-11-15T19:57:44",
      "content": "A senior French official on Saturday said he planned to take legal action over remarks hailing Vichy leader and Nazi collaborator Philippe Pétain as “France’s first resistant fighter”. The comments, which the official described as “clearly revisionist’ were made following a mass in Pétain’s honour.",
      "content_length": 299,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Tim Cook could step down as Apple CEO next year",
      "link": "https://www.theverge.com/news/821691/tim-cook-step-down-apple-ceo-next-year",
      "published": "2025-11-15T19:31:45",
      "content": "\n\n\n\t\n\tWave goodbye.\t\n\nAccording to the Financial Times, Tim Cook could step down as Apple CEO as early as next year. And the board has started to seriously work out a succession plan. FT says that John Ternus, Apple’s senior vice-president of hardware engineering, is considered the frontrunner for the position.\n\nCook, who turned 65 recently, has been CEO for 14 years and overseen both incredible growth and his fair share of controversies. He’s also largely seen as responsible for Apple’s shift to outsourcing manufacturing, which has enabled it to operate at much larger scales than it did traditionally. \n\nRumors of Cook’s stepping down follow the retirement of Apple COO Jeff Williams, whose last day at the company was Friday. As part of that departure, there has been some shuffling of responsibilities at the executive level, including expanded roles for Services chief Eddy Cue, head of software engineering Craig Federighi, and Ternus. \n\nRegardless of who winds up taking over as CEO, it’s unlikely to be someone from outside Apple. Tim Cook has previously said there is a strong preference for an internal candidate and that the company has “very detailed succession plans.”\n\n",
      "content_length": 1189,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Ethiopia confirms outbreak of deadly Marburg virus",
      "link": "https://www.theguardian.com/world/2025/nov/15/ethiopia-confirms-outbreak-of-deadly-marburg-virus",
      "published": "2025-11-15T19:23:26",
      "content": "Africa CDC says at least nine cases have been detected of Ebola-like illness,  which kills up to 80% of those infectedEthiopia has confirmed an outbreak of the deadly Marburg virus in the south of the country, the Africa Centres for Disease Control and Prevention (Africa CDC) has said.The Marburg virus is one of the deadliest known pathogens. Like Ebola, it causes severe bleeding, fever, vomiting and diarrhoea and has a 21-day incubation period. Continue reading...",
      "content_length": 469,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Factchecking five Coalition claims about net zero, from power prices to the $9tn cost",
      "link": "https://www.theguardian.com/australia-news/2025/nov/16/coalition-net-zero-emissions-claims-factcheck-electricity-price-power-bill-cost",
      "published": "2025-11-15T19:00:14",
      "content": "As Liberals join Nationals in abandoning a 2050 emissions target, we unpick some of the opposition’s talking pointsFollow our Australia news live blog for latest updatesSign up for climate and environment editor Adam Morton’s free Clear Air newsletter hereAre you trying to make sense of some of the big claims made by Liberal and National party MPs for abandoning their support for Australia reaching net zero emissions by 2050?We’re here to help. Continue reading...",
      "content_length": 468,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Police detonated a ‘stinger’ grenade at a Melbourne protest. Now two activists may sue over their injuries",
      "link": "https://www.theguardian.com/australia-news/2025/nov/16/police-detonated-a-stinger-grenade-at-a-melbourne-protest-now-two-activists-may-sue-over-their-injuries",
      "published": "2025-11-15T19:00:13",
      "content": "Grenades filled with rubber pellets and other so-called ‘less lethal’ munitions have been increasingly deployed, despite being linked to serious injuries and even deathsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastScout* barely realised that something round and hard, with smoke coming from it, had landed in front of them before it exploded.Pain suddenly shot through their leg and arm. Scout fell to their knees before someone nearby helped them rush out of the area. Continue reading...",
      "content_length": 557,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Australia is selling arms at a weapons fair in Dubai. Are they destined to be used in Sudan atrocities?",
      "link": "https://www.theguardian.com/australia-news/2025/nov/16/australia-dubai-international-airshow-defence-weapons-arms-fair-sudan-uae",
      "published": "2025-11-15T19:00:11",
      "content": "Australian companies have exported nearly $300m weapons over five years to the UAE, which has denied shipping weapons to a paramilitary group in SudanFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastIn a cavernous conference hall at the edge of the Dubai desert, a retired military officer fronting the Australia pavilion will offer “the key credibility of being in uniform” for defence companies spruiking their wares.“A unique advantage in attracting and engaging with visiting military delegations,” is how briefing notes, shared by the head of Team Defence Australia, describes it. Continue reading...",
      "content_length": 669,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Ex-CIA chief Petraeus: ‘Real opportunity to help Ukraine and crush Russia’s war economy’",
      "link": "https://www.france24.com/en/video/20251115-ex-cia-chief-petraeus-real-opportunity-to-help-ukraine-and-crush-russia-s-war-economy",
      "published": "2025-11-15T18:08:32",
      "content": "In an exclusive interview with FRANCE 24, former CIA director David Petraeus said Russia’s finances are in a far more dire state than many realise, arguing that there is now “a real opportunity” for the United States and other NATO countries to strengthen Ukraine’s defences and “crush the Russian war economy”. He also shared his views on Syria’s new leadership and the situation in Iraq.",
      "content_length": 389,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Wo die Deutschen vor Weihnachten sparen - und wo nicht",
      "link": "https://www.tagesschau.de/wirtschaft/verbraucher/weihnachtsgeschenke-budget-konsum-inflation-100.html",
      "published": "2025-11-15T18:03:41",
      "content": "   Umfragen zufolge wollen die Deutschen zum Jahresende im Schnitt weniger Geld für Geschenke ausgeben. Ängste der Menschen drücken auf den Konsum. An anderer Stelle wird jedoch nicht gespart. Von Ingo Nathusius.[mehr]",
      "content_length": 218,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "USA und Venezuela: Machtkampf in der Karibik",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-venezuela-106.html",
      "published": "2025-11-15T17:03:15",
      "content": "   Erwägen die USA einen Militäreinsatz in Venezuela? Medienberichten zufolge sollen hochrangige Militärs mit Trump entsprechende Pläne diskutiert haben. Venezuela bereitet offenbar eine \"guerillamäßige Reaktion\" vor. Von Anne Demmer.[mehr]",
      "content_length": 240,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "UK's PM Keir Starmer under pressure after budget rewrite",
      "link": "https://www.france24.com/en/video/20251115-uk-s-pm-keir-starmer-under-pressure-after-budget-rewrite",
      "published": "2025-11-15T16:55:13",
      "content": "On the eve of a visit to London by U.S. President Donald Trump, British Prime Minister Keir Starmer abruptly summoned Labour lawmakers to a meeting to try to reassert his authority over his increasingly fractious party. It was a rare acknowledgement that decisions taken by his Downing Street office had widened a rift with Labour members of parliament. Eight weeks later, those rifts have burst into the open after a briefing to selected media outlets by unnamed allies of Starmer who said the prime minister would fight any leadership challenge - although none had yet materialised. Analysis by FRANCE 24 international affairs editor Rochelle Ferguson Bouyahi.",
      "content_length": 662,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Nach Korruptionsaffäre: Selenskyj lässt Energiesektor umbauen",
      "link": "https://www.tagesschau.de/ausland/europa/selenskyj-umbau-energiesektor-100.html",
      "published": "2025-11-15T16:53:45",
      "content": "   Der ukrainische Präsident Selenskyj zieht Konsequenzen aus dem Korruptionsskandal im Energiesektor: Er hat einen massiven Umbau der Branche angekündigt. Für ihn steht dabei vieles auf dem Spiel. [mehr]",
      "content_length": 204,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Trump to seek up to $5 billion from the BBC over edited video",
      "link": "https://www.france24.com/en/video/20251115-trump-to-seek-up-to-5-billion-from-the-bbc-over-edited-video",
      "published": "2025-11-15T16:45:28",
      "content": "U.S. President Donald Trump said on Friday he would likely sue the BBC next week for as much as $5 billion after the British broadcaster admitted it wrongly edited a video of a speech he gave but insisted there was no legal basis for his claim. Details by FRANCE 24 correspondent in London, Bénédicte Paviot.",
      "content_length": 308,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "The French city of Marseille struggles to battle drug crime",
      "link": "https://www.france24.com/en/video/20251115-the-french-city-of-marseille-struggles-to-battle-drug-crime",
      "published": "2025-11-15T16:43:30",
      "content": "A gunman on a motorbike has shot dead the 20-year-old youngest brother of a prominent anti-drug activist in the southern French city of Marseille in a possible warning over his campaigning, a prosecutor said on Friday. France's second largest city is struggling to battle drug crime, with more than a dozen people killed since the start of the year in turf wars and other disputes linked to cocaine and cannabis dealing. Analysis by Joseph Downing, senior lecturer in politics and international relations at Aston University in Marseille.",
      "content_length": 538,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Franco-Algerian writer Boualem Sansal pardoned by Algeria on humanitarian grounds",
      "link": "https://www.france24.com/en/tv-shows/a-week-in-france/20251115-franco-algerian-writer-boualem-sansal-pardoned-by-algeria-on-humanitarian-grounds",
      "published": "2025-11-15T16:13:30",
      "content": "The Franco-Algerian writer Boualem Sansal is recovering in Berlin. The 81-year-old arrived in Germany for medical treatment on Wednesday, after Algeria agreed to a German request for his pardon and release on humanitarian grounds. My guest Adlene Mohammedi, a senior researcher in geopolitics at the Sciences Po Center for International Studies, discusses the state of Franco-Algerian relations moving forward.",
      "content_length": 410,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Todesopfer und Verletzte nach heftigem Sturm in Portugal",
      "link": "https://www.tagesschau.de/ausland/europa/portugal-sturm-100.html",
      "published": "2025-11-15T16:07:42",
      "content": "   Beschädigte Gebäude, umgeknickte Bäume, Autos mit zertrümmerten Scheiben: Ein Sturm hat Portugals Südküste schwer getroffen. Auf einem Campingplatz starb ein Mensch, zudem wurden zahlreiche Verletzte registriert.  [mehr]",
      "content_length": 223,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Trump pressures Thailand to recommit to Cambodia ceasefire with ‘threat of tariffs’",
      "link": "https://www.theguardian.com/world/2025/nov/15/us-pressures-thailand-to-recommit-to-cambodia-ceasefire-with-threat-of-tariffs",
      "published": "2025-11-15T16:03:23",
      "content": "Bangkok had earlier said it was suspending ceasefire, accusing Cambodia of laying landmines along the borderThe US has put pressure on Thailand to recommit to a ceasefire with Cambodia, warning trade talks could be halted as Washington seeks to keep a Donald Trump-brokered truce agreement from falling apart.Earlier this week, Thailand said that it was suspending the ceasefire deal, accusing Cambodia of laying fresh landmines along the border, including one it said wounded a Thai soldier on patrol, who lost a foot in the explosion. Continue reading...",
      "content_length": 556,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Possessor(s) is a fast-paced action game that gets off to a slow start",
      "link": "https://www.theverge.com/games/821117/possessors-review-pc-ps5",
      "published": "2025-11-15T16:00:00",
      "content": "\n\n\n\t\n\t\t\n\nI remember being blown away by the 2024 reveal trailer for Possessor(s), the new game from Hyper Light Drifter developer Heart Machine. The trailer features a striking art design, where an animated 2D character explores and fights in side-scrolling environments with gorgeous 3D backgrounds, and it's all set to moody, powerful music. The final game, which came out this month, wasn't quite as awe-inspiring as that initial trailer made it seem, and I almost quit it - but I'm really glad I saw it to the end.\nIn Possessor(s), you play as Luca, a girl who is possessed by Rehm, a demon from another realm. After a catastrophe strikes, Rehm saves Lu …\nRead the full story at The Verge.",
      "content_length": 693,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Braucht es eine Reform Finanzen von Bund, Ländern und Kommunen?",
      "link": "https://www.tagesschau.de/inland/innenpolitik/kommunen-finanzierung-haushalt-100.html",
      "published": "2025-11-15T15:37:56",
      "content": "   Der Bundeshaushalt steht. Die Kommunen würden von dem Geld gerne mehr abbekommen - für zusätzliche Aufgaben, die ihnen der Bund auferlegt. Der Bund sagt: Wir zahlen schon mehr, als wir müssten. Wer hat Recht? Von Lissy Kaufmann.[mehr]",
      "content_length": 237,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Guinea launches Simandou mine, hoping to extract 120M tons of iron ore per year",
      "link": "https://www.france24.com/en/video/20251115-guinea-launches-simandou-mine-hoping-to-extract-120m-tons-of-iron-ore-per-year",
      "published": "2025-11-15T15:33:12",
      "content": "On Tuesday, Guinea officially began production at the Simandou mining project — home to the largest known iron ore reserves in the world. Guinean authorities hope the project will generate vital revenue for the country. But China is also heavily invested, as Beijing aims to strengthen its influence over the global market for one of the world's most essential raw materials. Story by Bryan Quinn.",
      "content_length": 397,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "How to find music you will love without the algorithm",
      "link": "https://www.theverge.com/report/821614/discover-music-without-algorithms",
      "published": "2025-11-15T15:00:00",
      "content": "\n\n\n\t\n\tOh, how I want to break free.\t\n\nWhile there is plenty of criticism to be hurled at what music the algorithm serves to us, and how, the real problem with music discovery in the age of algorithmic recommendations is that listening has become a passive activity. It's too easy to press play and let a pile of code take the wheel. Whether that's creating a \"station\" based on a particular song or artist, firing up Discover Weekly, or just letting Apple Music autoplay into infinity after a particular album or song ends. \nWith less involvement from the listener, less intentionality, it's easy for music to simply become background noise. Research suggests that younger generations a …\nRead the full story at The Verge.",
      "content_length": 722,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Viktor Orbán begins ‘anti-war roadshow’ as Hungary gears up for 2026 elections",
      "link": "https://www.theguardian.com/world/2025/nov/15/viktor-orban-hungary-2026-election-campaign-fidesz",
      "published": "2025-11-15T14:31:35",
      "content": "PM makes opposition to support for Ukraine central to Fidesz campaign as it loses ground over cost of living crisisHungary’s prime minister has kicked off a weeks-long “anti-war roadshow”, turning criticism of European support for Ukraine into an early campaign message before next year’s elections.Viktor Orbán’ is scheduled to stage an event in five cities before the end of the year, and started with an assembly on Saturday in the north-western city of Győr. Continue reading...",
      "content_length": 482,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Mysterious plane carrying Gaza refugees lands in South Africa",
      "link": "https://www.france24.com/en/video/20251115-mysterious-plane-carrying-gaza-refugees-lands-in-south-africa",
      "published": "2025-11-15T14:03:04",
      "content": "South Africa's intelligence services are investigating who was behind a chartered plane that landed in Johannesburg with more than 150 Palestinians from war-ravaged Gaza who did not have proper travel documents and were held onboard on the tarmac for around 12 hours as a result, the country's president said Friday. Details by FRANCE 24 correspondent in Cape Town, Eunice Masson.",
      "content_length": 380,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Framework’s franken-laptop is back with big chip upgrades and familiar frustrations",
      "link": "https://www.theverge.com/tech/821420/framework-laptop-16-2025-nvidia-rtx5070-review",
      "published": "2025-11-15T14:00:00",
      "content": "\n\n\n\t\n\tThe new Laptop 16 is a lot like the original on the outside, though here it’s shown with a prototype 3D-printed trackpad surround that’s a single piece.\t\n\nFramework did it again. It promised modular, upgradeable, and user-repairable laptops where other manufacturers dare not venture or have outright failed. And it's delivered. \nThe 2025 version of the Framework Laptop 16 comes with not only new AMD Ryzen AI CPU options, but also Wi-Fi 7, a more powerful USB-C charger, redesigned cooling, and a new webcam - all of which are also sold separately, so existing owners can upgrade. But the biggest bump by far is a more powerful user-replaceable graphics card. The modular, removable GPU is what separates the Laptop 16 from any other laptop on the market. When it announced the Laptop 16, Framework ca …\nRead the full story at The Verge.",
      "content_length": 845,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Nach Trumps Klage-Ankündigung: \"Die Jagdsaison auf die BBC ist eröffnet\"",
      "link": "https://www.tagesschau.de/ausland/europa/trump-bbc-100.html",
      "published": "2025-11-15T13:34:11",
      "content": "   US-Präsident Trump will die BBC wegen einer umstrittenen Doku auf eine Milliardensumme verklagen. In Großbritannien wird diskutiert, wie der Sender damit umgehen soll - möglicherweise kommt es auch auf Premier Starmer an. Von Gabi Biesinger.[mehr]",
      "content_length": 250,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "\"Deutschlandtag\": Merz wirbt für Rentenpaket - Junge Union bleibt bei Nein",
      "link": "https://www.tagesschau.de/inland/innenpolitik/merz-junge-union-deutschlandtag-100.html",
      "published": "2025-11-15T13:31:31",
      "content": "   Kaum Applaus für den Parteichef, viel für Kritiker: Kanzler Merz hat auf dem \"Deutschlandtag\" für das Rentenpaket der Regierung geworben - aber die Junge Union bleibt beim Nein. Ist die Mehrheit im Bundestag in Gefahr?[mehr]",
      "content_length": 227,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Indigenous lands must be recognised as part of climate policy, says Brazilian minister",
      "link": "https://www.theguardian.com/environment/2025/nov/15/indigenous-lands-must-be-recognised-as-part-of-climate-policy-says-brazilian-minister",
      "published": "2025-11-15T13:00:10",
      "content": "Sonia Guajajara tells Cop30 the rights of traditional communities must be maintained in the face of exploitation by the mining industryCountries must recognise the demarcation of Indigenous lands as a key component of tackling the climate crisis, and civil society must help in the defence of such lands against mining interests, Brazil’s minister for Indigenous peoples has said.Sonia Guajajara, a longtime Indigenous activist before being appointed a minister by President Lula da Silva, said: “[Among the goals of the Cop30 summit is] a request that countries recognise the demarcation of Indigenous lands as climate policy.” Continue reading...",
      "content_length": 648,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "The Steam Machine feels like the TV gaming PC I’ve always wanted",
      "link": "https://www.theverge.com/games/818606/valve-steam-machine-tv-gaming-pc-wanted",
      "published": "2025-11-15T13:00:00",
      "content": "\n\n\n\t\n\t\t\n\nThe morning of Monday, October 27th, I started my workweek by asking my colleagues at The Verge for advice on buying a gaming PC. I wanted a small, portable, and semi-powerful machine that could easily sit beneath my living room TV and occasionally move over to my desk to play games or even use for work. My dream was to find something as easy to use as the Steam Deck, which has become my primary gaming device due to its simplicity and massive catalog of PC games.\nJust two days later, I walked into Valve's headquarters and was introduced to the new Steam Machine, a gaming PC and console hybrid. It checked basically every box I was looking fo …\nRead the full story at The Verge.",
      "content_length": 693,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Pluribus’ third episode throws a bomb into things",
      "link": "https://www.theverge.com/entertainment/820523/pluribus-episode-3-discussion",
      "published": "2025-11-15T13:00:00",
      "content": "\n\n\n\t\n\t\t\n\nIf you weren't clear on just what a miserable person Carol (Rhea Seehorn) is, episode 3 of Pluribus sure makes it obvious. It opens with a flashback, as Carol and her partner Helen (Miriam Shor) are on a dream vacation at an ice hotel in Norway, and all she can do is complain about how cold it is. When Carol sees a stunning aurora borealis, her only thought is \"it looks like a screensaver.\" But that cynicism might also be her superpower as she prepares to solve the hive-mind apocalypse that has descended on Earth.\nWelcome! The two-episode premiere of Pluribus, the new Apple TV show from Breaking Bad creator Vince Gilligan, introduced a stra …\nRead the full story at The Verge.",
      "content_length": 693,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Brother of French anti-drugs activist murdered",
      "link": "https://www.france24.com/en/video/20251115-brother-of-french-anti-drugs-activist-murdered",
      "published": "2025-11-15T12:49:18",
      "content": "A gunman on a motorbike has shot dead the 20-year-old brother of a prominent anti-drug activist in Marseille in a possible warning over his campaigning, a French prosecutor said Friday. Story by Charlotte Hughes, Eliza Herbert, and France 2.",
      "content_length": 241,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Trump scraps tariffs on beef, coffee and tropical fruit in a push to lower grocery store prices",
      "link": "https://www.france24.com/en/video/20251115-trump-scraps-tariffs-on-beef-coffee-and-tropical-fruit-in-a-push-to-lower-grocery-store-prices",
      "published": "2025-11-15T12:48:14",
      "content": "President Donald Trump announced Friday that he was scrapping U.S. tariffs on beef, coffee, tropical fruits and a broad swath of other commodities — a dramatic move that comes amid mounting pressure on his administration to better combat high consumer prices. Story by Eliza Herbert.",
      "content_length": 283,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "China tells citizens not to visit Japan as Taiwan row grows",
      "link": "https://www.france24.com/en/video/20251115-china-tells-citizens-not-to-visit-japan-as-taiwan-row-grows",
      "published": "2025-11-15T12:47:08",
      "content": "China has advised its citizens to avoid travelling to Japan, following a diplomatic feud sparked by remarks from Tokyo's new premier about a hypothetical attack on Taiwan. Details and analysis with James Simms, FRANCE 24 correspondent in Tokyo.",
      "content_length": 244,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "DR Congo and M23 sign framework agreement for peace deal in Qatar",
      "link": "https://www.france24.com/en/video/20251115-dr-congo-and-m23-sign-framework-agreement-for-peace-deal-in-qatar",
      "published": "2025-11-15T12:46:11",
      "content": "The Democratic Republic of Congo and the M23 rebel group signed on Saturday in Qatar a framework agreement for a peace deal aimed at ending fighting in eastern Congo. Details by FRANCE 24 correspondent in Kinshasa, Emmet Linvingstone.",
      "content_length": 234,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Wyoming dinosaur mummies give us a new view of duck-billed species",
      "link": "https://arstechnica.com/science/2025/11/wyoming-dinosaur-mummies-give-us-a-new-view-of-duck-billed-species/",
      "published": "2025-11-15T12:00:59",
      "content": "Edmontosaurus annectens, a large herbivore duck-billed dinosaur that lived toward the end of the Cretaceous period, was discovered back in 1908 in east-central Wyoming by C.H. Sternberg, a fossil collector. The skeleton, later housed at the American Museum of Natural History in New York and nicknamed the “AMNH mummy,” was covered by scaly skin imprinted in the surrounding sediment that gave us the first approximate idea of what the animal looked like.\nMore than a century later, a team of paleontologists led by Paul C. Sereno, a professor of organismal biology at the University of Chicago, got back to the same exact place where Sternberg dug up the first Edmontosaurus specimen. The researchers found two more Edmontosaurus mummies with all fleshy external anatomy imprinted in a sub-millimeter layer of clay. For the first time, we uncovered an accurate image of what Edmontosaurus really looked like, down to the tiniest details, like the size of its scales and the arrangement of spikes on its tail. And we were in for at least a few surprises.\nEvolving images\nOur view of Edmontosaurus changed over time, even before Sereno’s study. The initial drawing of Edmontosaurus was made in 1909 by Charles R. Knight, a famous paleoartist, who based his visualization on the first specimen found by Sternberg. “He was accurate in some ways, but he made a mistake in that he drew the crest extending throughout the entire length of the body,” Sereno says. The mummy Knight based his drawing on had no tail, so understandably, the artist used his imagination to fill in the gaps and made the Edmontosaurus look a little bit like a dragon.Read full article\nComments",
      "content_length": 1664,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Palästinenserpräsident Abbas: Wie ein König ohne Land",
      "link": "https://www.tagesschau.de/ausland/asien/palaestinenser-abbas-102.html",
      "published": "2025-11-15T12:00:26",
      "content": "   Am 90. Geburtstag von Palästinenserpräsident Abbas richtet sich der Blick mehr denn je auf die Zukunft des Westjordanlandes. Ist der betagte und unbeliebte Präsident bereit, die Macht abzugeben? Von J.-C. Kitzler.[mehr]",
      "content_length": 222,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Israel breaching international law by limiting Gaza aid, says Unrwa official",
      "link": "https://www.theguardian.com/world/2025/nov/15/israel-breaching-international-law-by-limiting-gaza-aid-says-unrwa-official",
      "published": "2025-11-15T12:00:09",
      "content": "Natalie Boucly says supplies are ready but only about half of what is needed is getting into territoryIsrael is breaching international law by continuing to impose restrictions on aid flows into Gaza, where the population remains critically short of food and life-saving goods as winter sets in, a senior official at the UN agency for Palestinian refugees has said.In an interview during a recent visit to Brussels, Natalie Boucly, an Unrwa deputy commissioner general, said the whole world – including the EU and US – needed to increase the pressure on Israel’s government to ensure the unrestricted flow of aid into Gaza. Continue reading...",
      "content_length": 643,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "DR Congo and M23 rebel group sign a framework agreement for a peace deal in Qatar",
      "link": "https://www.france24.com/en/live-news/20251115-dr-congo-and-m23-rebel-group-sign-a-framework-agreement-for-a-peace-deal-in-qatar",
      "published": "2025-11-15T11:53:37",
      "content": "The Democratic Republic of Congo and the M23 rebel group signed a fresh framework for peace in Qatar Saturday after multiple rounds of direct talks between the warring sides. The Rwanda-backed paramilitary group seized two major cities in DR Congo's east earlier this year.",
      "content_length": 273,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Flatrate bei Abundo: All inclusive für die Kultur",
      "link": "https://www.tagesschau.de/kultur/abundo-flatrate-kulturerlebnisse-100.html",
      "published": "2025-11-15T11:43:33",
      "content": "   Für 29 Euro im Monat kann man bei der Plattform Abundo unbegrenzt Kulturerlebnisse buchen. Doch wie ist ein Angebot zu diesem Preis möglich - und was haben das Publikum und die Kulturorte davon? Von A. Herr, M. Kaiser und F. Walser.[mehr]",
      "content_length": 241,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Keine teuren Medikamente für Hochbetagte: Streeck verteidigt Vorstoß",
      "link": "https://www.tagesschau.de/inland/innenpolitik/streeck-medikamente-hochbetagte-102.html",
      "published": "2025-11-15T11:31:37",
      "content": "   Der CDU-Gesundheitspolitiker Streeck hat eine Debatte über die Vergabe teurer Arzneien an Hochbetagte angestoßen - und ist dafür kritisiert worden. Nun äußerte er sich erneut: Lebensverlängerung sei nicht immer das höchste Ziel. [mehr]",
      "content_length": 238,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Emily Thornberry: In a world of disinformation, the BBC remains a 'source of truth and reliability'",
      "link": "https://www.france24.com/en/video/20251115-emily-thornberry-in-a-world-of-disinformation-the-bbc-remains-a-source-of-truth-and-reliability",
      "published": "2025-11-15T11:07:19",
      "content": "In a wide-ranging interview with Gavin Lee, British MP and Foreign Affairs Committee Chair Emily Thornberry offers a candid and reflective discussion that spans the complexities of global diplomacy, foreign policy, and the stark challenges of real governance. We explore raging conflicts in Gaza, Ukraine, and Sudan, alongside political turbulence at home within the frat boy culture of British politics. The conversation includes in-depth analysis of the BBC as a century-old institution: its crucial role in the digital age of disinformation, the integrity of its journalism, and the political pressures it faces, both at home and abroad, as a publicly funded broadcaster striving to maintain trust in a deeply divided media and political landscape, amid a fractured world. We are reminded that If you tread the middle path well, “both sides are likely attack you,” explains Ms. Thornberry. “This is life.” The British MP is heartened by a new noticeable trend \"whereby people want to have explainers, they want to understand': the full story with historical context to better understand our world.",
      "content_length": 1100,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "France arrests longtime Arizona fugitive convicted in US sex crimes case",
      "link": "https://www.france24.com/en/france/20251115-france-arrests-longtime-arizona-fugitive-convicted-us-sex-crimes-case",
      "published": "2025-11-15T10:55:45",
      "content": "An American sex offender living in northeastern France was arrested earlier this month and charged with sexually abusing his 10-year-old adopted child, authorities said. Michael Robert Wiseman had fled the US on two separate occasions over the past 14 years to escape prosecution.",
      "content_length": 280,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "MSF revives rescue mission in Mediterranean after new disaster kills 42",
      "link": "https://www.france24.com/en/video/20251115-msf-revives-rescue-mission-in-mediterranean-after-new-disaster-kills-42",
      "published": "2025-11-15T10:39:33",
      "content": "Last week, a boat carrying migrants capsized off the coast of Libya, killing at least 42 people. The incident was the latest in a series of disasters that have killed more than a thousand people in the Mediterranean this year. Humanitarian group MSF - or Doctors Without Borders - announced this week it is restarting its search and rescue activities in the Mediterranean. Details with Rositsa Atana-Sova, the humanitarian affairs coordinator for MSF's search and rescue operations.",
      "content_length": 482,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "US military kills four people in boat attack in the Caribbean",
      "link": "https://www.france24.com/en/video/20251115-us-military-kills-four-people-in-boat-attack-in-the-caribbean",
      "published": "2025-11-15T10:35:44",
      "content": "The United States on Monday conducted its 20th strike on an alleged drug trafficking boat, a Pentagon official said on Thursday. \"The strike occurred in the Caribbean and four narco-terrorists were killed, no survivors,\" the official said. Details by FRANCE 24 correspondent in Washington, Fraser Jackson.",
      "content_length": 305,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Bus crash in Stockholm kills three, shocking Sweden",
      "link": "https://www.france24.com/en/video/20251115-bus-crash-in-stockholm-kills-three-shocking-sweden",
      "published": "2025-11-15T10:29:43",
      "content": "A double-decker bus crashed into a bus stop in Stockholm on Friday, killing three people and injuring three others, police said. Swedish police said on Saturday they believed the incident was an accident. Story by Nicholas Rushworth.",
      "content_length": 233,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Japan PM’s sleep schedule prompts concern",
      "link": "https://www.france24.com/en/video/20251115-japan-pm-s-sleep-schedule-prompts-concern",
      "published": "2025-11-15T10:28:05",
      "content": "Japan's new prime minister says she only gets two to four hours of sleep every night. Sanae Takaichi faces criticism for setting a bad example, as her government also mulls raising the upper limit on overtime work. Report by Mélodie Sforza, Himari Semans and Laurent Berstecher.",
      "content_length": 278,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Rassismus in der Pflege: \"Es ist unser Alltag\"",
      "link": "https://www.tagesschau.de/inland/gesellschaft/rassismus-pflegekraefte-100.html",
      "published": "2025-11-15T10:03:57",
      "content": "   Das deutsche Gesundheitssystem wäre ohne internationale Pflegekräfte aufgeschmissen. Schon jetzt kommt jede fünfte Pflegekraft aus dem Ausland. Laut einer neuen Studie werden viele jedoch immer wieder diskriminiert. Von Oliver Bemelmann.[mehr]",
      "content_length": 246,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Fighting climate change with imaginative methods in East-Timor",
      "link": "https://www.france24.com/en/video/20251115-fighting-climate-change-with-imaginative-methods-in-east-timor",
      "published": "2025-11-15T10:02:37",
      "content": "As countries gather in Brazil for the COP 30 climate change conference, FRANCE 24 travels to East Timor, where global warming is wreaking havoc on the fishing industry. The isolated island nation and its 1.4 million people face coastal erosion, rising sea levels and dwindling marine resources. In response, local people are using imaginative methods to tackle overfishing. Report by Juliette Chaignon, Guillaume Gosalbes and Justin McCurry.",
      "content_length": 441,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "UN rights council orders probe of atrocities in Sudan's Al-Fasher",
      "link": "https://www.france24.com/en/video/20251115-un-rights-council-orders-probe-of-atrocities-in-sudan-s-al-fasher",
      "published": "2025-11-15T10:00:08",
      "content": "The UN Human Rights Council on Friday ordered investigators to probe alleged atrocities in Sudan's Al-Fasher and to seek to identify perpetrators so they can be brought to justice. The decision came at the end of a special session called to address the situation in Al-Fasher, amid mounting warnings of crimes against humanity and the risk of genocide. Story by Jennie Shin.",
      "content_length": 374,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Icelandic is in danger of dying out because of AI and English-language media, says former PM",
      "link": "https://www.theguardian.com/world/2025/nov/15/icelandic-is-in-danger-of-dying-out-because-of-ai-and-english-language-media-says-former-pm",
      "published": "2025-11-15T10:00:06",
      "content": "Katrín Jakobsdóttir and her co-author want the 350,000 people who speak the language to fight for its futureIceland’s former prime minister, Katrín Jakobsdóttir, has said that the Icelandic language could be wiped out in as little as a generation due to the sweeping rise of AI and encroaching English language dominance.Katrín, who stood down as prime minister last year to run for president after seven years in office, said Iceland was undergoing “radical” change when it came to language use. More people are reading and speaking English, and fewer are reading in Icelandic, a trend she says is being exacerbated by the way language models are trained. Continue reading...",
      "content_length": 676,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Söder fordert Bau von Mini-Atomkraftwerken",
      "link": "https://www.tagesschau.de/inland/soeder-forderung-mini-akw-100.html",
      "published": "2025-11-15T09:12:30",
      "content": "   CSU-Chef Söder will auch nach dem Atomausstieg in Deutschland nicht ganz mit dieser Art der Energiegewinnung brechen. Er fordert den Bau von \"kleineren, smarten Reaktoren\" zur Förderung der wirtschaftlichen Erholung.[mehr]",
      "content_length": 225,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Epstein-Akten: Trump entzieht Abgeordneter Greene Unterstützung",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-taylor-greene-100.html",
      "published": "2025-11-15T08:25:18",
      "content": "   Viele Jahre war die Abgeordnete Greene eine der lautesten Trump-Unterstützerinnen. Ihre Verschwörungserzählungen waren für ihn kein Problem. Aber jetzt haben beide miteinander gebrochen - wegen der Epstein-Akten.[mehr]",
      "content_length": 221,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Developer Snapshots: Kleinere News der Woche",
      "link": "https://www.heise.de/news/Developer-Snapshots-Kleinere-News-der-Woche-11078459.html",
      "published": "2025-11-15T08:11:00",
      "content": "Die Übersicht enthält kleine, aber interessante Meldungen zu Google, Unreal, Rust, Databricks, Docker, BoxLang, Keycloak und W3C.",
      "content_length": 129,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "So entstehen tropische Wirbelstürme",
      "link": "https://www.tagesschau.de/wissen/klima/entstehung-wirbelstuerme-100.html",
      "published": "2025-11-15T07:57:54",
      "content": "   Mehrere Wirbelstürme sind zuletzt vor allem über asiatische Staaten hinweggezogen, neue Studien bestätigen: Das hängt auch mit dem Klimawandel zusammen. Sollte es eine zusätzliche Stufe auf der Wirbelsturm-Skala geben? Von Y. Appelhans.[mehr]",
      "content_length": 245,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Epstein-Affäre: Justizministerium lässt gegen Clinton ermitteln",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-clinton-epstein-100.html",
      "published": "2025-11-15T07:47:42",
      "content": "   US-Präsident Trump steht in der Epstein-Affäre unter Druck. Jetzt ermittelt das Justizministerium auf seinen Wunsch gegen seinen Amtsvorgänger Clinton. Dabei hatte das Ministerium vor Kurzem noch eine ganz andere Position.[mehr]",
      "content_length": 231,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Blast from confiscated explosives at police station in Indian-controlled Kashmir kills nine",
      "link": "https://www.theguardian.com/world/2025/nov/15/blast-from-confiscated-explosives-at-police-station-in-indian-controlled-kashmir-kills-nine",
      "published": "2025-11-15T07:18:57",
      "content": "The accidental explosion comes days after a deadly car blast in New Delhi which killed at least eight people near the city’s historic Red FortAt least nine people were killed and 32 injured after a cache of confiscated explosives detonated inside a police station in Indian-controlled Kashmir, police have announced.The blast occurred in the Nowgam area of Srinagar, the region’s main city, late on Friday while a team of forensic experts and police were examining the explosive material, said Nalin Prabhat, the region’s police director general. He ruled out any foul play, saying it was an accident. Continue reading...",
      "content_length": 621,
      "source": "The Guardian World",
      "category": "International News"
    }
  ]
}