{
  "date": "2025-11-16",
  "timestamp": "2025-11-16T07:12:19.038439",
  "total_articles": 311,
  "articles": [
    {
      "title": "Senioren-Union zum Rentenstreit: \"Sorgen der jungen Generation sind berechtigt\"",
      "link": "https://www.tagesschau.de/inland/innenpolitik/rentenstreit-102.html",
      "published": "2025-11-16T06:18:33",
      "content": "   Die Junge Union bekommt Unterstützung für ihre Kritik am Rentenkurs der Regierung. Der Vorsitzende der Senioren-Union, Hüppe, sagte dem RND, die Sorgen der jungen Generation seien mit Blick auf die Finanzierung der Rente berechtigt.[mehr]",
      "content_length": 241,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Freier bestrafen, Prostituierte schützen - funktioniert das?",
      "link": "https://www.tagesschau.de/inland/gesellschaft/sexkaufverbot-prostitution-nordisches-modell-100.html",
      "published": "2025-11-16T04:00:08",
      "content": "   Gesundheitsministerin Warken hat sich für ein Sexkaufverbot ausgesprochen, Aktivistinnen kämpfen schon lange für das sogenannte Nordische Modell. Können Prostituierte dadurch geschützt werden, dass man ihre Freier bestraft? Von Tim Kukral.[mehr]",
      "content_length": 248,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Ausschreitungen bei Gen-Z-Protest in Mexiko",
      "link": "https://www.tagesschau.de/ausland/amerika/mexiko-protest-104.html",
      "published": "2025-11-16T03:09:31",
      "content": "   Gewalt gegen Politiker ist ein großes Problem in Mexiko. Dagegen sind Tausende junge Menschen auf die Straße gegangen. Am Rande des Protests der Generation Z kam es zu Ausschreitungen, zahlreiche Polizisten wurden verletzt.[mehr]",
      "content_length": 232,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Belém: Chaotisch, sympathisch - und voller Widersprüche",
      "link": "https://www.tagesschau.de/ausland/amerika/belem-cop-100.html",
      "published": "2025-11-16T01:48:17",
      "content": "   Die Stadt Belém hat vor der Klimakonferenz viel Geld ausgegeben und unter anderem Hafen und Markt renoviert. Wie erleben die Menschen die COP30? Anne Herrberg hat mit ihnen gesprochen und Superfood, Musik und Elixire kennengelernt.[mehr]",
      "content_length": 240,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "CDU diskutiert über Energieimporte aus Russland",
      "link": "https://www.tagesschau.de/inland/innenpolitik/russland-diskussion-kretschmer-100.html",
      "published": "2025-11-16T01:41:18",
      "content": "   Nicht nur in der AfD gibt es eine Diskussion über den Umgang mit Russland. Auch die CDU ringt um ihren Kurs: Sachsens Ministerpräsident Kretschmer denkt über neue Handelsbeziehungen zu Moskau nach, anderen gefällt das nicht.[mehr]",
      "content_length": 233,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Britische Regierung verschärft Asylpolitik",
      "link": "https://www.tagesschau.de/ausland/europa/grossbritannien-migration-verschaerfung-102.html",
      "published": "2025-11-16T01:39:20",
      "content": "   Die britische Regierung hat eine Reform der Asylpolitik nach dem Vorbild Dänemarks angekündigt. Hilfen werden gestrichen, Rückführungen erleichtert. So will die Regierung die Zahl der Flüchtlinge verringern. [mehr]",
      "content_length": 217,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Viele Tote bei Angriff auf Krankenhaus in Demokratischer Republik Kongo",
      "link": "https://www.tagesschau.de/ausland/afrika/kongo-ueberfall-krankenhaus-100.html",
      "published": "2025-11-15T18:37:49",
      "content": "   Bei einem Überfall der IS-nahen Miliz ADF auf ein Krankenhaus im Osten der Demokratischen Republik Kongo sind mindestens 20 Menschen getötet worden. Die Rebellen plünderten Medikamente und brannten Häuser nieder.[mehr]",
      "content_length": 221,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Wo die Deutschen vor Weihnachten sparen - und wo nicht",
      "link": "https://www.tagesschau.de/wirtschaft/verbraucher/weihnachtsgeschenke-budget-konsum-inflation-100.html",
      "published": "2025-11-15T18:03:41",
      "content": "   Umfragen zufolge wollen die Deutschen zum Jahresende im Schnitt weniger Geld für Geschenke ausgeben. Ängste der Menschen drücken auf den Konsum. An anderer Stelle wird jedoch nicht gespart. Von Ingo Nathusius.[mehr]",
      "content_length": 218,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Nach Korruptionsaffäre: Selenskyj lässt Energiesektor umbauen",
      "link": "https://www.tagesschau.de/ausland/europa/selenskyj-umbau-energiesektor-100.html",
      "published": "2025-11-15T16:53:45",
      "content": "   Der ukrainische Präsident Selenskyj zieht Konsequenzen aus dem Korruptionsskandal im Energiesektor: Er hat einen massiven Umbau der Branche angekündigt. Für ihn steht dabei vieles auf dem Spiel. [mehr]",
      "content_length": 204,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Todesopfer und Verletzte nach heftigem Sturm in Portugal",
      "link": "https://www.tagesschau.de/ausland/europa/portugal-sturm-100.html",
      "published": "2025-11-15T16:07:42",
      "content": "   Beschädigte Gebäude, umgeknickte Bäume, Autos mit zertrümmerten Scheiben: Ein Sturm hat Portugals Südküste schwer getroffen. Auf einem Campingplatz starb ein Mensch, zudem wurden zahlreiche Verletzte registriert.  [mehr]",
      "content_length": 223,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Braucht es eine Reform Finanzen von Bund, Ländern und Kommunen?",
      "link": "https://www.tagesschau.de/inland/innenpolitik/kommunen-finanzierung-haushalt-100.html",
      "published": "2025-11-15T15:37:56",
      "content": "   Der Bundeshaushalt steht. Die Kommunen würden von dem Geld gerne mehr abbekommen - für zusätzliche Aufgaben, die ihnen der Bund auferlegt. Der Bund sagt: Wir zahlen schon mehr, als wir müssten. Wer hat Recht? Von Lissy Kaufmann.[mehr]",
      "content_length": 237,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Klimakonferenz in Brasilien: Zehntausende protestieren für Klimagerechtigkeit",
      "link": "https://www.tagesschau.de/ausland/amerika/brasilien-demo-klimakonferenz-100.html",
      "published": "2025-11-15T17:18:40",
      "content": "   Zur Halbzeit der UN-Klimakonferenz in Brasilien machen Aktivisten Druck auf die Teilnehmer. Zehntausende Menschen gingen auf die Straße. Sie fordern den Schutz der Indigenen, des Regenwaldes sowie eine Abkehr von Öl, Gas und Kohle.[mehr]",
      "content_length": 240,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Nach Trumps Klage-Ankündigung: \"Die Jagdsaison auf die BBC ist eröffnet\"",
      "link": "https://www.tagesschau.de/ausland/europa/trump-bbc-100.html",
      "published": "2025-11-15T13:34:11",
      "content": "   US-Präsident Trump will die BBC wegen einer umstrittenen Doku auf eine Milliardensumme verklagen. In Großbritannien wird diskutiert, wie der Sender damit umgehen soll - möglicherweise kommt es auch auf Premier Starmer an. Von Gabi Biesinger.[mehr]",
      "content_length": 250,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "USA und Venezuela: Machtkampf in der Karibik",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-venezuela-106.html",
      "published": "2025-11-15T17:03:15",
      "content": "   Erwägen die USA einen Militäreinsatz in Venezuela? Medienberichten zufolge sollen hochrangige Militärs mit Trump entsprechende Pläne diskutiert haben. Venezuela bereitet offenbar eine \"guerillamäßige Reaktion\" vor. Von Anne Demmer.[mehr]",
      "content_length": 240,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "\"Deutschlandtag\": Merz wirbt für Rentenpaket - Junge Union bleibt bei Nein",
      "link": "https://www.tagesschau.de/inland/innenpolitik/merz-junge-union-deutschlandtag-100.html",
      "published": "2025-11-15T13:31:31",
      "content": "   Kaum Applaus für den Parteichef, viel für Kritiker: Kanzler Merz hat auf dem \"Deutschlandtag\" für das Rentenpaket der Regierung geworben - aber die Junge Union bleibt beim Nein. Ist die Mehrheit im Bundestag in Gefahr?[mehr]",
      "content_length": 227,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Palästinenserpräsident Abbas: Wie ein König ohne Land",
      "link": "https://www.tagesschau.de/ausland/asien/palaestinenser-abbas-102.html",
      "published": "2025-11-15T12:00:26",
      "content": "   Am 90. Geburtstag von Palästinenserpräsident Abbas richtet sich der Blick mehr denn je auf die Zukunft des Westjordanlandes. Ist der betagte und unbeliebte Präsident bereit, die Macht abzugeben? Von J.-C. Kitzler.[mehr]",
      "content_length": 222,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Flatrate bei Abundo: All inclusive für die Kultur",
      "link": "https://www.tagesschau.de/kultur/abundo-flatrate-kulturerlebnisse-100.html",
      "published": "2025-11-15T11:43:33",
      "content": "   Für 29 Euro im Monat kann man bei der Plattform Abundo unbegrenzt Kulturerlebnisse buchen. Doch wie ist ein Angebot zu diesem Preis möglich - und was haben das Publikum und die Kulturorte davon? Von A. Herr, M. Kaiser und F. Walser.[mehr]",
      "content_length": 241,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Keine teuren Medikamente für Hochbetagte: Streeck verteidigt Vorstoß",
      "link": "https://www.tagesschau.de/inland/innenpolitik/streeck-medikamente-hochbetagte-102.html",
      "published": "2025-11-15T11:31:37",
      "content": "   Der CDU-Gesundheitspolitiker Streeck hat eine Debatte über die Vergabe teurer Arzneien an Hochbetagte angestoßen - und ist dafür kritisiert worden. Nun äußerte er sich erneut: Lebensverlängerung sei nicht immer das höchste Ziel. [mehr]",
      "content_length": 238,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Bahn-Chefin Palla erwartet keine Verbesserung der Pünktlichkeit im Fernverkehr",
      "link": "https://www.tagesschau.de/wirtschaft/unternehmen/bahn-palla-100.html",
      "published": "2025-11-15T10:21:48",
      "content": "   Nur jeder zweite Zug der Deutschen Bahn kam im Fernverkehr im Oktober pünktlich - ein neuer Tiefstand. Und die neue Bahn-Chefin Palla erwartet in naher Zukunft keine Verbesserung. Grund seien vor allem die vielen Baustellen.[mehr]",
      "content_length": 233,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Rassismus in der Pflege: \"Es ist unser Alltag\"",
      "link": "https://www.tagesschau.de/inland/gesellschaft/rassismus-pflegekraefte-100.html",
      "published": "2025-11-15T10:03:57",
      "content": "   Das deutsche Gesundheitssystem wäre ohne internationale Pflegekräfte aufgeschmissen. Schon jetzt kommt jede fünfte Pflegekraft aus dem Ausland. Laut einer neuen Studie werden viele jedoch immer wieder diskriminiert. Von Oliver Bemelmann.[mehr]",
      "content_length": 246,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Söder fordert Bau von Mini-Atomkraftwerken",
      "link": "https://www.tagesschau.de/inland/soeder-forderung-mini-akw-100.html",
      "published": "2025-11-15T09:12:30",
      "content": "   CSU-Chef Söder will auch nach dem Atomausstieg in Deutschland nicht ganz mit dieser Art der Energiegewinnung brechen. Er fordert den Bau von \"kleineren, smarten Reaktoren\" zur Förderung der wirtschaftlichen Erholung.[mehr]",
      "content_length": 225,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Epstein-Akten: Trump entzieht Abgeordneter Greene Unterstützung",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-taylor-greene-100.html",
      "published": "2025-11-15T08:25:18",
      "content": "   Viele Jahre war die Abgeordnete Greene eine der lautesten Trump-Unterstützerinnen. Ihre Verschwörungserzählungen waren für ihn kein Problem. Aber jetzt haben beide miteinander gebrochen - wegen der Epstein-Akten.[mehr]",
      "content_length": 221,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "So entstehen tropische Wirbelstürme",
      "link": "https://www.tagesschau.de/wissen/klima/entstehung-wirbelstuerme-100.html",
      "published": "2025-11-15T07:57:54",
      "content": "   Mehrere Wirbelstürme sind zuletzt vor allem über asiatische Staaten hinweggezogen, neue Studien bestätigen: Das hängt auch mit dem Klimawandel zusammen. Sollte es eine zusätzliche Stufe auf der Wirbelsturm-Skala geben? Von Y. Appelhans.[mehr]",
      "content_length": 245,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Epstein-Affäre: Justizministerium lässt gegen Clinton ermitteln",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-clinton-epstein-100.html",
      "published": "2025-11-15T07:47:42",
      "content": "   US-Präsident Trump steht in der Epstein-Affäre unter Druck. Jetzt ermittelt das Justizministerium auf seinen Wunsch gegen seinen Amtsvorgänger Clinton. Dabei hatte das Ministerium vor Kurzem noch eine ganz andere Position.[mehr]",
      "content_length": 231,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Diskussion über Rentenpaket: Junge Union erhöht Druck auf Merz",
      "link": "https://www.tagesschau.de/inland/innenpolitik/junge-union-deutschlandtag-108.html",
      "published": "2025-11-15T07:01:58",
      "content": "   Jahrelang saßen in der Jungen Union mit die größten Merz-Fans. Aber vor der heutigen Rede des Kanzlers beim \"Deutschlandtag\" des Parteinachwuchses kommen von diesem wegen des geplanten Rentenpakets ungewohnt harte Töne. [mehr]",
      "content_length": 229,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Tausende Läden schließen dieses Jahr - das Beispiel Mainz",
      "link": "https://www.tagesschau.de/wirtschaft/verbraucher/traditionsgeschaefte-schliessung-einzelhandel-100.html",
      "published": "2025-11-15T04:11:36",
      "content": "   Nach mehr als 100 Jahren schließen zwei Traditionsläden in der Mainzer Innenstadt zum Jahresende. Die Gründe sind symptomatisch für die Branche: keine Nachfolger, fehlendes Geld für Investitionen und der Onlinehandel. Von Michael Eiden.[mehr]",
      "content_length": 245,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Zwischenbilanz der COP30: Team Erdöl oder Team Klima?",
      "link": "https://www.tagesschau.de/ausland/amerika/brasilien-belem-klimagipfel-100.html",
      "published": "2025-11-15T04:11:00",
      "content": "   Bald ist Halbzeit auf der Weltklimakonferenz in Belém und noch gibt es keinen Durchbruch am Amazonas. Neben dem Ausstieg aus fossilen Brennstoffen ist der Schutz des Regenwaldes Thema - und natürlich das Geld. Von Jakob Mayr.[mehr]",
      "content_length": 234,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Sudan: RSF-Miliz zieht in die Nachbarprovinz weiter",
      "link": "https://www.tagesschau.de/ausland/afrika/sudan-al-faschir-nord-kordofan-100.html",
      "published": "2025-11-15T04:10:39",
      "content": "   Nach den Berichten von massenhaften Gräueltaten in der sudanesischen Stadt Al-Faschir im Darfur zieht die RSF-Miliz weiter Richtung Nord-Kordofan. Die UN warnen bereits vor einem Sturm der Nachbarprovinz. Von Anna Osius.[mehr]",
      "content_length": 229,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Trump kündigt zeitnahe Milliardenklage gegen BBC an",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-bbc-klage-100.html",
      "published": "2025-11-15T02:53:43",
      "content": "   Der US-Präsident hat angekündigt, die BBC auf bis zu fünf Milliarden Dollar zu verklagen. Grund ist eine Dokumentation, in der Trumps Aussagen irreführend zusammengeschnitten wurden. Zuvor war eine von Trumps Anwälten gesetzte Frist abgelaufen.[mehr]",
      "content_length": 253,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "US-Präsident Trump nimmt Zölle auf bestimmte Lebensmittel zurück",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-zoelle-lebensmittel-100.html",
      "published": "2025-11-15T01:14:56",
      "content": "   Die anhaltende Inflation und Siege der Demokraten bei mehreren Wahlen zeigen offenbar Wirkung: US-Präsident Trump hat Zölle auf mehrere Lebensmittel wie Rindfleisch, Bananen und Kaffee gestrichen.[mehr]",
      "content_length": 205,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Marktbericht: Wall Street zwischen Hoffen und Bangen",
      "link": "https://www.tagesschau.de/wirtschaft/finanzen/marktberichte/marktbericht-boerse-dax-nach-kursrutsch-aktien-oel-100.html",
      "published": "2025-11-14T21:22:27",
      "content": "   Anhaltende Zinssorgen oder doch weiter KI-Hoffnungen? Die Wall Street ist derzeit zerrissen und nichts für schwache Nerven. Auch der DAX geriet heute in den Strudel der volatilen US-Märkte. [mehr]",
      "content_length": 199,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Kritik an Streecks Äußerungen zu teuren Medikamenten für Hochbetagte",
      "link": "https://www.tagesschau.de/inland/streeck-medikamente-hochbetagte-100.html",
      "published": "2025-11-14T20:58:03",
      "content": "   Der CDU-Gesundheitspolitiker Streeck hat eine Debatte über die Vergabe sehr teurer Arzneien für Hochbetagte angestoßen. Von vielen Seiten gibt es dafür Kritik. Die Bundesregierung distanziert sich vom Drogenbeauftragten.[mehr]",
      "content_length": 229,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Zoll-Deal zwischen Schweiz und USA: \"Fleiß, Fleiß, Fleiß\" - und ein paar Geschenke?",
      "link": "https://www.tagesschau.de/ausland/amerika/usa-schweiz-zoelle-100.html",
      "published": "2025-11-14T20:34:24",
      "content": "   Die USA und die Schweiz haben sich im Zollstreit geeinigt. Haben teure Geschenke das Einlenken begünstigt? Der Schweizer Regierung kann es egal sein: Sie feiert sich für den Erfolg. Von Kathrin Hondl.[mehr]",
      "content_length": 209,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Merz fordert von Selenskyj weniger Ausreisen junger Ukrainer",
      "link": "https://www.tagesschau.de/inland/innenpolitik/merz-ukrainer-ausreiseregeln-100.html",
      "published": "2025-11-14T18:08:07",
      "content": "   Für Kanzler Merz kommen derzeit zu viele Männer aus der Ukraine nach Deutschland, die eigentlich ihren Wehrdienst noch vor sich haben. In einem Telefonat bat er den ukrainischen Präsidenten Selenskyj um Abhilfe.[mehr]",
      "content_length": 220,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Kraftwerksstrategie der Regierung: Einigung mit Leerstellen",
      "link": "https://www.tagesschau.de/inland/innenpolitik/kraftwerksstrategie-bundesregierung-102.html",
      "published": "2025-11-14T18:07:18",
      "content": "   Wie kann die deutsche Stromversorgung zukünftig auch bei sogenannten Dunkelflauten gesichert werden? Die Koalition hat sich auf eine Kraftwerksstrategie verständigt. Aber die Einigung lässt viele Fragen offen. Von Martin Polansky.[mehr]",
      "content_length": 239,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Deutsche Behörden offenbar überrascht von US-Einstufung der \"Antifa Ost\"",
      "link": "https://www.tagesschau.de/antifa-ost-100.html",
      "published": "2025-11-14T18:00:26",
      "content": "   Die US-Regierung hat die deutsche \"Antifa Ost\" als Terrorgruppe eingestuft - für die deutschen Behörden kam das offenbar unerwartet. Worum handelt es sich? Und wie hoch wird die Gefahr eingeschätzt, die von dem Netzwerk ausgeht?[mehr]",
      "content_length": 237,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "UN-Menschenrechtsrat verurteilt Gewalt im Sudan",
      "link": "https://www.tagesschau.de/ausland/afrika/sudan-menschenrechtsrat-faq-100.html",
      "published": "2025-11-14T16:45:13",
      "content": "   Mord, Folter, Vergewaltigungen. Im Sudan werden schwerste Verbrechen gegen die Zivilbevölkerung verübt. Nun hat sich der UN-Menschenrechtsrat mit der Situation beschäftigt.[mehr]",
      "content_length": 181,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Schwarz-roter Koalitionsausschuss: Luft nach oben",
      "link": "https://www.tagesschau.de/inland/innenpolitik/schwarz-rot-koalitionsausschuss-100.html",
      "published": "2025-11-14T16:41:05",
      "content": "   Schwarz-Rot bemüht sich beim Koalitionausschuss erkennbar, sich als arbeits- und einigungsfähig zu zeigen. Die wilden Debatten der vergangenen Wochen zeichneten aber ein anderes Bild. Von Corinna Emundts.[mehr]",
      "content_length": 213,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Merz und die Junge Union: Der Beginn einer Entfremdung?",
      "link": "https://www.tagesschau.de/inland/innenpolitik/junge-union-rente-merz-deutschlandtag-100.html",
      "published": "2025-11-14T15:45:40",
      "content": "   Die Junge Union war lange eine Machtbasis von Friedrich Merz. Im Konflikt um das Rentenpaket deutet sich aber eine zunehmende Distanz an. Was steckt dahinter? Von Tina Handel. [mehr]",
      "content_length": 185,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Filmemacher Hark Bohm im Alter von 86 Jahren gestorben",
      "link": "https://www.tagesschau.de/kultur/hark-bohm-gestorben-100.html",
      "published": "2025-11-14T16:34:14",
      "content": "   Der Hamburger Regisseur, Schauspieler und Autor Hark Bohm ist im Alter von 86 Jahren gestorben. Er wurde Mitte der 1970er-Jahre mit Filmen wie \"Nordsee ist Mordsee\" bekannt. Sein Roman \"Amrum\" wurde jüngst verfilmt.[mehr]",
      "content_length": 224,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Britische Regierung verschärft Asylpolitik",
      "link": "https://www.tagesschau.de/ausland/europa/grossbritannien-migration-verschaerfung-102.html",
      "published": "2025-11-16T01:39:20",
      "content": "   Die britische Regierung hat eine Reform der Asylpolitik nach dem Vorbild Dänemarks angekündigt. Hilfen werden gestrichen, Rückführungen erleichtert. So will die Regierung die Zahl der Flüchtlinge verringern. [mehr]",
      "content_length": 217,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Todesopfer und Verletzte nach heftigem Sturm in Portugal",
      "link": "https://www.tagesschau.de/ausland/europa/portugal-sturm-100.html",
      "published": "2025-11-15T16:07:42",
      "content": "   Beschädigte Gebäude, umgeknickte Bäume, Autos mit zertrümmerten Scheiben: Ein Sturm hat Portugals Südküste schwer getroffen. Auf einem Campingplatz starb ein Mensch, zudem wurden zahlreiche Verletzte registriert.  [mehr]",
      "content_length": 223,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Paris gedenkt der Opfer der Terroranschläge vom 13. November 2015",
      "link": "https://www.tagesschau.de/ausland/europa/frankreich-paris-gedenken-opfer-terroranschlaege-2015-100.html",
      "published": "2025-11-13T20:28:14",
      "content": "   Vor zehn Jahren hatten islamistische Terroristen in Paris 130 Menschen ermordet, Hunderte wurden verletzt. Zum Jahrestag der Anschläge mahnte Präsident Macron zur Wachsamkeit und warnte vor einem Erstarken des Dschihadismus.[mehr]",
      "content_length": 233,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Kritik an \"kalten Überstellungen\" der Polizei in die Niederlande",
      "link": "https://www.tagesschau.de/ausland/europa/niederlande-deutschland-migranten-bundespolizei-100.html",
      "published": "2025-11-13T17:51:41",
      "content": "   Immer wieder hat die Bundespolizei zuletzt Migranten in den Niederlanden abgesetzt: an Plätzen oder Tankstellen nahe der deutschen Grenze. Diese Praxis der \"kalten Überstellungen\" wirft Fragen auf. Von Ludger Kazmierczak.[mehr]",
      "content_length": 230,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Warum Polens Präsident die Beförderung junger Richter blockiert",
      "link": "https://www.tagesschau.de/ausland/richter-polen-justizwesen-100.html",
      "published": "2025-11-13T15:42:26",
      "content": "   Polen soll wieder ein unabhängiges Justizwesen bekommen - das möchte Ministerpräsident Tusk. Doch mit Nawrocki als Präsidenten hat er einen mächtigen Widersacher. Das PiS-Lager blockiert - und spekuliert auf Neuwahlen. Von L. Tomaszewski. [mehr]",
      "content_length": 248,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Ist Frankreich so frei und brüderlich wie vor dem Terror?",
      "link": "https://www.tagesschau.de/ausland/europa/frankreich-terror-2015-jahrestag-100.html",
      "published": "2025-11-13T05:36:22",
      "content": "   Vor zehn Jahren erschütterten islamistische Anschläge in Paris die Welt. Die Bluttaten galten einer offenen Gesellschaft - und Frankreich versprach sich daraufhin, genau für diese Werte einzustehen. Ist das gelungen? Von J. Borutta.[mehr]",
      "content_length": 241,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Frankreichs Parlament beschließt Aussetzen der Rentenreform",
      "link": "https://www.tagesschau.de/ausland/europa/frankreich-rentenreform-nationalversammlung-100.html",
      "published": "2025-11-12T20:48:42",
      "content": "   Präsident Macron ließ das Rentenalter auf 64 anheben - das galt als sein wichtigstes Reformprojekt. Nun setzt Frankreichs Nationalversammlung diese Rentenreform bis 2028 aus - ein Zugeständnis der Regierung an die Sozialisten.[mehr]",
      "content_length": 235,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Polens Präsident verweigert Ernennung von 46 Richtern",
      "link": "https://www.tagesschau.de/ausland/europa/polen-richter-112.html",
      "published": "2025-11-12T17:33:27",
      "content": "   In Polen muss das Rechtssystem wieder unabhängig werden, um EU-Maßgaben zu erfüllen. Entsprechenden Bestrebungen der Regierung stellt sich aber der rechtsnationale Präsident Nawrocki entgegen. Er verweigerte die Ernennung von 46 Richtern.[mehr]",
      "content_length": 247,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Wie von der Leyen versucht, ihren Zwei-Billionen-Haushalt zu retten",
      "link": "https://www.tagesschau.de/ausland/europa/eu-haushalt-178.html",
      "published": "2025-11-12T11:49:40",
      "content": "   Rund zwei Billionen Euro soll der nächste EU-Haushalt umfassen. Doch es gibt Streit wegen Reformen der Budget-Struktur. Regionale Behörden befürchten abgehängt zu werden. Nun lenkt von der Leyen ein - denn die Zeit drängt. Von T. Spickhofen.[mehr]",
      "content_length": 250,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Verteilung von Flüchtlingen: EU stellt Deutschland Entlastung in Aussicht",
      "link": "https://www.tagesschau.de/ausland/europa/eu-migrationsanalyse-deutschland-100.html",
      "published": "2025-11-11T19:20:04",
      "content": "   Deutschland kann laut EU-Kommission beantragen, im kommenden Jahr keine zusätzlichen Flüchtlinge aus EU-Ländern aufzunehmen. Voraussetzung ist, dass die Mitgliedstaaten dem neuen Solidaritätsmechanismus zustimmen.[mehr]",
      "content_length": 222,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "EU-Richtlinie für Mindestlohn muss geändert werden",
      "link": "https://www.tagesschau.de/ausland/europa/mindestlohn-eu-eugh-100.html",
      "published": "2025-11-11T10:51:16",
      "content": "   Mit ihren Regeln für den Mindestlohn ist die EU zu weit gegangen, urteilt der Europäische Gerichtshof. Die Höhe der Löhne sei Sache der Mitgliedsstaaten. Für Deutschland hat das vorerst keine Folgen. [mehr]",
      "content_length": 209,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Ausschreitungen bei Gen-Z-Protest in Mexiko",
      "link": "https://www.tagesschau.de/ausland/amerika/mexiko-protest-104.html",
      "published": "2025-11-16T03:09:31",
      "content": "   Gewalt gegen Politiker ist ein großes Problem in Mexiko. Dagegen sind Tausende junge Menschen auf die Straße gegangen. Am Rande des Protests der Generation Z kam es zu Ausschreitungen, zahlreiche Polizisten wurden verletzt.[mehr]",
      "content_length": 232,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Belém: Chaotisch, sympathisch - und voller Widersprüche",
      "link": "https://www.tagesschau.de/ausland/amerika/belem-cop-100.html",
      "published": "2025-11-16T01:48:17",
      "content": "   Die Stadt Belém hat vor der Klimakonferenz viel Geld ausgegeben und unter anderem Hafen und Markt renoviert. Wie erleben die Menschen die COP30? Anne Herrberg hat mit ihnen gesprochen und Superfood, Musik und Elixire kennengelernt.[mehr]",
      "content_length": 240,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Klimakonferenz in Brasilien: Zehntausende protestieren für Klimagerechtigkeit",
      "link": "https://www.tagesschau.de/ausland/amerika/brasilien-demo-klimakonferenz-100.html",
      "published": "2025-11-15T17:18:40",
      "content": "   Zur Halbzeit der UN-Klimakonferenz in Brasilien machen Aktivisten Druck auf die Teilnehmer. Zehntausende Menschen gingen auf die Straße. Sie fordern den Schutz der Indigenen, des Regenwaldes sowie eine Abkehr von Öl, Gas und Kohle.[mehr]",
      "content_length": 240,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "USA und Venezuela: Machtkampf in der Karibik",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-venezuela-106.html",
      "published": "2025-11-15T17:03:15",
      "content": "   Erwägen die USA einen Militäreinsatz in Venezuela? Medienberichten zufolge sollen hochrangige Militärs mit Trump entsprechende Pläne diskutiert haben. Venezuela bereitet offenbar eine \"guerillamäßige Reaktion\" vor. Von Anne Demmer.[mehr]",
      "content_length": 240,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Epstein-Akten: Trump entzieht Abgeordneter Greene Unterstützung",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-taylor-greene-100.html",
      "published": "2025-11-15T08:25:18",
      "content": "   Viele Jahre war die Abgeordnete Greene eine der lautesten Trump-Unterstützerinnen. Ihre Verschwörungserzählungen waren für ihn kein Problem. Aber jetzt haben beide miteinander gebrochen - wegen der Epstein-Akten.[mehr]",
      "content_length": 221,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Epstein-Affäre: Justizministerium lässt gegen Clinton ermitteln",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-clinton-epstein-100.html",
      "published": "2025-11-15T07:47:42",
      "content": "   US-Präsident Trump steht in der Epstein-Affäre unter Druck. Jetzt ermittelt das Justizministerium auf seinen Wunsch gegen seinen Amtsvorgänger Clinton. Dabei hatte das Ministerium vor Kurzem noch eine ganz andere Position.[mehr]",
      "content_length": 231,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Zwischenbilanz der COP30: Team Erdöl oder Team Klima?",
      "link": "https://www.tagesschau.de/ausland/amerika/brasilien-belem-klimagipfel-100.html",
      "published": "2025-11-15T04:11:00",
      "content": "   Bald ist Halbzeit auf der Weltklimakonferenz in Belém und noch gibt es keinen Durchbruch am Amazonas. Neben dem Ausstieg aus fossilen Brennstoffen ist der Schutz des Regenwaldes Thema - und natürlich das Geld. Von Jakob Mayr.[mehr]",
      "content_length": 234,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Trump kündigt zeitnahe Milliardenklage gegen BBC an",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-bbc-klage-100.html",
      "published": "2025-11-15T02:53:43",
      "content": "   Der US-Präsident hat angekündigt, die BBC auf bis zu fünf Milliarden Dollar zu verklagen. Grund ist eine Dokumentation, in der Trumps Aussagen irreführend zusammengeschnitten wurden. Zuvor war eine von Trumps Anwälten gesetzte Frist abgelaufen.[mehr]",
      "content_length": 253,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "US-Präsident Trump nimmt Zölle auf bestimmte Lebensmittel zurück",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-zoelle-lebensmittel-100.html",
      "published": "2025-11-15T01:14:56",
      "content": "   Die anhaltende Inflation und Siege der Demokraten bei mehreren Wahlen zeigen offenbar Wirkung: US-Präsident Trump hat Zölle auf mehrere Lebensmittel wie Rindfleisch, Bananen und Kaffee gestrichen.[mehr]",
      "content_length": 205,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Nach Korruptionsaffäre: Selenskyj lässt Energiesektor umbauen",
      "link": "https://www.tagesschau.de/ausland/europa/selenskyj-umbau-energiesektor-100.html",
      "published": "2025-11-15T16:53:45",
      "content": "   Der ukrainische Präsident Selenskyj zieht Konsequenzen aus dem Korruptionsskandal im Energiesektor: Er hat einen massiven Umbau der Branche angekündigt. Für ihn steht dabei vieles auf dem Spiel. [mehr]",
      "content_length": 204,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Die verlassenen Wissenschaftler von Tschernobyl",
      "link": "https://www.tagesschau.de/ausland/europa/wissenschaftler-tschernobyl-ukraine-100.html",
      "published": "2025-11-14T12:07:48",
      "content": "   Das Sperrgebiet um das ehemalige AKW Tschernobyl wird regelmäßig bei russischen Angriffen getroffen. Die nukleare Gefahr ist groß. Die verbliebenen ukrainischen Wissenschaftler sind auf sich allein gestellt. Von Susanne Petersohn.[mehr]",
      "content_length": 239,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Krieg gegen die Ukraine: Mehrere Tote bei Angriffen auf Kiew",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-angriffe-russland-120.html",
      "published": "2025-11-14T14:35:26",
      "content": "   Mit dem jüngsten russischen Angriff auf Kiew sollte laut Präsident Selenskyj \"maximaler Schaden für Menschen und die zivile Infrastruktur\" angerichtet werden. Mehrere Menschen wurden getötet. Auch in Russland gab es neue Schäden.[mehr]",
      "content_length": 238,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Was wusste Selenskyj über die Schmiergeldzahlungen?",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-korruption-selenskyj-100.html",
      "published": "2025-11-13T19:24:32",
      "content": "   Ein Korruptionsskandal erschüttert die Ukraine. Der Hauptverdächtige ist ein enger Vertrauter des ukrainischen Präsidenten. Was heißt das nun für Selenskyj? Von Rebecca Barth.[mehr]",
      "content_length": 184,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Korruption: Selenskyj belegt zwei Hauptverdächtige mit Sanktionen",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-korruption-sanktionen-selenskyj-100.html",
      "published": "2025-11-13T11:49:42",
      "content": "   Im Korruptionsskandal im ukrainischen Energiesektor hat Präsident Selenskyj Sanktionen gegen zwei Verdächtige erlassen - darunter sein ehemaliger Geschäftspartner. Bundeskanzler Merz fordert rasche Aufklärung.[mehr]",
      "content_length": 218,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Korruptionsvorwürfe: Zwei ukrainische Minister zurückgetreten",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-korruptionsvorwuerfe-ruecktritt-100.html",
      "published": "2025-11-12T17:24:25",
      "content": "   Die Schmiergeldaffäre in der Ukraine hat Konsequenzen: Sowohl Justizminister Haluschtschenko als auch Energieministerin Hryntschuk sind der Rücktrittsaufforderung von Präsident Selenskyj gefolgt. Doch es gibt noch weitere Verdächtige. [mehr]",
      "content_length": 244,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Korruptionsvorwürfe: Skandal im Selenskyj-Umfeld erschüttert Ukraine",
      "link": "https://www.tagesschau.de/ausland/europa/korruptionsskandal-ukraine-selenskyj-100.html",
      "published": "2025-11-12T14:56:02",
      "content": "   Im Zentrum eines neuen Korruptionsskandals in der Ukraine steht ein Wegbegleiter von Präsident Selenskyj. Auch Regierungsbeamte geraten in Bedrängnis. Kritiker vermuten weitere Verstrickungen. Von Rebecca Barth.[mehr]",
      "content_length": 220,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Ukrainischer Justizminister wegen Korruptionsverdachts suspendiert",
      "link": "https://www.tagesschau.de/ausland/europa/justizminister-korruptionsverdacht-ukraine-100.html",
      "published": "2025-11-12T09:36:09",
      "content": "   Ein 100-Millionen-Dollar-Korruptionsskandal erschüttert die Ukraine. Mehrere ehemalige Politiker sollen verwickelt sein. Im Fokus der Ermittlungen steht ein langjähriger Wegbegleiter von Präsident Selenskyj.[mehr]",
      "content_length": 216,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Wadephul kündigt weitere 40 Millionen Euro Winterhilfe für Ukraine an",
      "link": "https://www.tagesschau.de/ausland/europa/wadephul-ukraine-winterhilfe-100.html",
      "published": "2025-11-11T19:25:07",
      "content": "   Der Ukraine droht ein weiterer Kriegswinter. Außenminister Wadephul stellt nun zusätzlich 40 Millionen Euro Winterhilfe zur Verfügung - für humanitäre Maßnahmen.[mehr]",
      "content_length": 170,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "USA werfen dem Iran die \"Entführung\" eines Öltankers vor",
      "link": "https://www.tagesschau.de/ausland/asien/tanker-iran-102.html",
      "published": "2025-11-14T12:48:52",
      "content": "   In der Straße von Hormus ist offenbar ein Öltanker vom Iran beschlagnahmt worden. Der Kontakt zur Besatzung ging verloren, das Schiff änderte unvermittelt seinen Kurs. Britische Behörden sprechen von \"staatlicher Aktivität\".[mehr]",
      "content_length": 233,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Hamas übergibt weitere Leiche - Identität laut Israel bestätigt",
      "link": "https://www.tagesschau.de/ausland/asien/hamas-uebergabe-leiche-identitaet-100.html",
      "published": "2025-11-14T13:09:29",
      "content": "   Das Internationale Komitee vom Roten Kreuz hat erneut eine Leiche entgegengenommen, die in der Gewalt der Terrororganisation Hamas war. Laut israelischer Regierung ist sie identifiziert. Drei tote Geiseln bleiben vermisst.[mehr]",
      "content_length": 231,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Einen Monat Waffenruhe in Gaza - Alles bleibt unsicher",
      "link": "https://www.tagesschau.de/ausland/asien/israel-gazastreifen-waffenruhe-108.html",
      "published": "2025-11-13T09:12:27",
      "content": "   Seit einem Monat gilt eine Waffenruhe zwischen Israel und der Hamas. Doch hält sie? Die Umsetzung des Abkommens stockt - und vor allem die Entwaffnung der Hamas könnte zur entscheidenden Hürde werden. Von Julio Segador. [mehr]",
      "content_length": 229,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Von Hamas übergebene Leiche ist verschleppter Soldat",
      "link": "https://www.tagesschau.de/ausland/asien/israel-hamas-leiche-102.html",
      "published": "2025-11-09T18:22:03",
      "content": "   Israel hat nach forensischen Untersuchungen die Identität einer von der militant-islamistischen Hamas ausgehändigten Leiche bestätigt. Es handele es sich um einen Soldaten, der bereits 2014 im Gazastreifen getötet wurde. [mehr]",
      "content_length": 230,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Ehemalige Geiseln der Hamas fordern Rückgabe aller Leichname",
      "link": "https://www.tagesschau.de/ausland/asien/israel-geiseln-rueckgabe-leichen-100.html",
      "published": "2025-11-09T00:23:22",
      "content": "   In Israel haben Tausende Menschen für die Rückgabe der sterblichen Überreste der letzten fünf Geiseln der Hamas demonstriert. Unter ihnen waren auch Personen, die bis vor kurzem selbst noch in der Gewalt der Terroristen waren.[mehr]",
      "content_length": 235,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Lange Trockenperiode: Trinkwasser in Teheran wird rationiert",
      "link": "https://www.tagesschau.de/ausland/asien/iran-wasserrationierung-100.html",
      "published": "2025-11-08T16:37:48",
      "content": "   Im Iran ist vielerorts seit Wochen kein Regen mehr gefallen, Stauseen haben zu wenig Wasser. 15 Millionen Menschen in der Hauptstadt Teheran wird deshalb nachts das Wasser abgedreht. Könnte das neue Proteste auslösen?[mehr]",
      "content_length": 226,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Israelisch-libanesische Grenze: Wiederaufbau mit Ungewissheit",
      "link": "https://www.tagesschau.de/ausland/asien/israel-libanon-wiederaufbau-100.html",
      "published": "2025-11-08T03:37:27",
      "content": "   Metulla im Norden Israels ist umgeben von libanesischen Dörfern. Viele Häuser wurden im Krieg mit der Hisbollah beschädigt oder zerstört. Nun kehren Anwohner zurück und bauen den Ort wieder auf. Doch die Waffenruhe ist zerbrechlich. Von Bettina Meier.[mehr]",
      "content_length": 260,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Von Hamas übergebene Leiche war letzte deutsche Geisel",
      "link": "https://www.tagesschau.de/ausland/asien/israel-hamas-148.html",
      "published": "2025-11-05T19:54:30",
      "content": "   Eine am Dienstag von der Hamas an Israel übergebene Leiche ist identifiziert worden: Es handelt sich um die sterblichen Überreste der letzten Geisel mit deutscher Staatsbürgerschaft. Die Familie des Toten hatte Kanzler Merz getroffen.[mehr]",
      "content_length": 243,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Deutschland entschärft Reisehinweise für Israel",
      "link": "https://www.tagesschau.de/ausland/deutschland-israel-reisewarnung-100.html",
      "published": "2025-11-04T14:44:24",
      "content": "   Deutschland hat eine Reisewarnung für Israel aufgehoben. Außenminister Wadephul begründete den Schritt mit gewachsenem Vertrauen in den Friedensprozess. Die Waffenruhe im Gazastreifen bleibt aber brüchig.[mehr]",
      "content_length": 213,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Gestrandete chinesische Raumfahrer zurück auf der Erde",
      "link": "https://www.tagesschau.de/ausland/asien/china-raumfahrer-rueckkehr-100.html",
      "published": "2025-11-14T15:05:36",
      "content": "   Tagelang mussten sie im All ausharren: Eine beschädigte Kapsel brachte die Pläne chinesischer Raumfahrer durcheinander, die erst mit Verspätung auf die Erde zurückkehren konnten. Jetzt sitzen ihre Nachfolger fest.[mehr]",
      "content_length": 222,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Künstler Gao Zhen - Inhaftiert für längst bekannte Kunstwerke",
      "link": "https://www.tagesschau.de/ausland/asien/china-kunst-repressionen-100.html",
      "published": "2025-11-13T08:53:58",
      "content": "   Der Künstler Gao Zhen wird wegen Werken, die mehr als ein Jahrzehnt alt sind, in China vor Gericht gestellt. Unter Staatschef Xi ist kritische Kunst kaum noch möglich. Und auch im Exil werden Künstler eingeschüchtert. Von J. Endriss.[mehr]",
      "content_length": 242,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Bündnis von Regierungschef Sudani gewinnt Wahl im Irak",
      "link": "https://www.tagesschau.de/ausland/asien/irak-parlamentswahl-100.html",
      "published": "2025-11-12T23:59:38",
      "content": "   Bei der Parlamentswahl im Irak hat das Bündnis von Ministerpräsident al-Sudani einen Sieg errungen. Ob er Regierungschef bleiben kann, wird sich aber wohl erst in den kommenden Wochen und Monaten zeigen.[mehr]",
      "content_length": 212,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Zehn Monate alte Autobahnbrücke in China nach Erdrutsch eingestürzt",
      "link": "https://www.tagesschau.de/ausland/asien/china-autobahnbruecke-einsturz-102.html",
      "published": "2025-11-12T10:41:04",
      "content": "   Vor zehn Monaten fertiggestellt, jetzt in Trümmern: Teile einer über 170 Meter hohen Brücke in China sind innerhalb von Augenblicken eingestürzt. Schon vorher wurden Risse entdeckt - und dadurch Opfer verhindert.[mehr]",
      "content_length": 221,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Pakistan: Mehrere Tote bei Explosion in Islamabad",
      "link": "https://www.tagesschau.de/ausland/pakistan-explosion-islamabad-100.html",
      "published": "2025-11-11T11:35:53",
      "content": "   In der pakistanischen Hauptstadt Islamabad hat es eine Explosion gegeben. Mindestens zwölf Menschen wurden dabei getötet, 27 wurden verletzt. Pakistans Innenminister spricht von einem Selbstmordanschlag.[mehr]",
      "content_length": 212,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Explosion in Delhi: Behörden ermitteln in Richtung Terroranschlag",
      "link": "https://www.tagesschau.de/ausland/asien/explosion-delhi-terrorverdacht-100.html",
      "published": "2025-11-11T07:22:00",
      "content": "   Nach der schweren Explosion mit acht Toten in Delhi ermitteln die Behörden inzwischen in Richtung eines Terroranschlags. Indische Medien berichten über einen möglichen islamistischen Hintergrund. Von P. Hornung.[mehr]",
      "content_length": 220,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Parlamentswahl: Iraks fragile Machtverteilung auf dem Prüfstand",
      "link": "https://www.tagesschau.de/ausland/asien/parlamentswahl-irak-104.html",
      "published": "2025-11-11T05:21:56",
      "content": "   Zur heutigen Parlamentswahl im Irak zeichnet Ministerpräsident al-Sudani das Bild von einem Land im Aufbruch. Die Opposition erkennt dagegen vor allem Stillstand. Und ein mächtiger Prediger ruft zum Wahlboykott auf. Von Moritz Behrendt.[mehr]",
      "content_length": 245,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Tote bei Explosion in Delhi",
      "link": "https://www.tagesschau.de/ausland/asien/explosion-indien-100.html",
      "published": "2025-11-10T20:53:53",
      "content": "   Nahe einer bei Touristen beliebten Festungsanlage mitten im indischen Delhi ist ein Auto explodiert. Mindestens acht Menschen wurden getötet. Nun sucht die Polizei nach der Ursache der Explosion.[mehr]",
      "content_length": 204,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Taifun legt jahrhundertealtes Schiffswrack in Vietnam frei",
      "link": "https://www.tagesschau.de/ausland/asien/vietnam-taifun-schiffswrack-100.html",
      "published": "2025-11-10T14:58:30",
      "content": "   An einem Strand in Vietnam hat der Taifun \"Kalmaegi\" ein altes Schiffswrack freigelegt. Es soll zwischen dem 14. und 16. Jahrhundert erbaut worden sein. Archäologen wollen die gut erhaltenen Überreste nun bergen.[mehr]",
      "content_length": 221,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Sudan: RSF-Miliz zieht in die Nachbarprovinz weiter",
      "link": "https://www.tagesschau.de/ausland/afrika/sudan-al-faschir-nord-kordofan-100.html",
      "published": "2025-11-15T04:10:39",
      "content": "   Nach den Berichten von massenhaften Gräueltaten in der sudanesischen Stadt Al-Faschir im Darfur zieht die RSF-Miliz weiter Richtung Nord-Kordofan. Die UN warnen bereits vor einem Sturm der Nachbarprovinz. Von Anna Osius.[mehr]",
      "content_length": 229,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "UN-Menschenrechtsrat verurteilt Gewalt im Sudan",
      "link": "https://www.tagesschau.de/ausland/afrika/sudan-menschenrechtsrat-faq-100.html",
      "published": "2025-11-14T16:45:13",
      "content": "   Mord, Folter, Vergewaltigungen. Im Sudan werden schwerste Verbrechen gegen die Zivilbevölkerung verübt. Nun hat sich der UN-Menschenrechtsrat mit der Situation beschäftigt.[mehr]",
      "content_length": 181,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Algerien begnadigt Schrifsteller Sansal - nach Gesuch Steinmeiers",
      "link": "https://www.tagesschau.de/ausland/afrika/algerien-begnadigung-schriftsteller-100.html",
      "published": "2025-11-12T21:28:25",
      "content": "   Ein Jahr lang war der französisch-algerische Schriftsteller Sansal in algerischer Haft - trotz Appellen und Widerspruch aus Frankreich. Nun kommt die Regierung in Algier einem offiziellen Gnadengesuch aus Deutschland nach.[mehr]",
      "content_length": 231,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "42 Menschen bei Bootsunglück vor Libyens Küste vermutlich ertrunken",
      "link": "https://www.tagesschau.de/ausland/afrika/bootsunglueck-tote-kueste-libyen-100.html",
      "published": "2025-11-12T12:51:33",
      "content": "   Erneut ist ein Boot im Mittelmeer gekentert: Nach UN-Angaben werden 42 Menschen vermisst. Sie sind nach dem Unglück vor Libyen vermutlich tot. Nun hat die NGO Ärzte ohne Grenzen angekündigt, ihre Rettungseinsätze wieder aufzunehmen.[mehr]",
      "content_length": 241,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Südafrika: Bürgerwehr \"Operation Dudula\" drangsaliert Migranten",
      "link": "https://www.tagesschau.de/ausland/afrika/suedafrika-operation-dudula-gericht-100.html",
      "published": "2025-11-11T19:25:34",
      "content": "   Sie marschieren durch Townships, bedrohen ausländische Ladenbetreiber, blockieren Kliniken. Seit Jahren inszeniert sich die \"Operation Dudula\" in Südafrika als Bürgerwehr. Jetzt hat ein Gericht ihr Grenzen gesetzt. Von S. Ueberbach.[mehr]",
      "content_length": 241,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Ägyptens Präsident lässt ein neues Parlament von seinen Gnaden wählen",
      "link": "https://www.tagesschau.de/ausland/afrika/aegypten-parlament-wahl-100.html",
      "published": "2025-11-10T11:57:55",
      "content": "   Millionen Ägypter wählen heute ein neues Parlament. Am Ausgang gibt es wenig Zweifel: Denn das Regime von Präsident al-Sisi hat unliebsame Kandidaten aussieben lassen, um seine Macht auch in Zukunft abzusichern. Von Jürgen Stryjak.[mehr]",
      "content_length": 240,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Blockade von Treibstoff-Einfuhr: Islamisten legen Mali lahm",
      "link": "https://www.tagesschau.de/ausland/afrika/mali-islamisten-treibstoff-100.html",
      "published": "2025-11-09T11:25:53",
      "content": "   Mali steht nahezu still. Islamisten haben das westafrikanische Land weitgehend von Benzin- und Diesellieferungen abgeschnitten. Eine Zermürbungstaktik, die die Wut auf Malis Militärregierung schüren soll. Von Karin Bensch.[mehr]",
      "content_length": 231,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Miliz im Sudan stimmt Waffenruhe zu - Reaktion der Regierung steht aus",
      "link": "https://www.tagesschau.de/ausland/afrika/sudan-waffenruhe-106.html",
      "published": "2025-11-06T19:21:39",
      "content": "   Massenmorde, Vergewaltigungen und Hungernde - der Bürgerkrieg im Sudan gilt als einer der schlimmsten Konflikte weltweit. Nun hat die RSF-Miliz einer Feuerpause zugestimmt. Die Reaktion der Militärregierung steht noch aus.[mehr]",
      "content_length": 231,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Immer mehr Hinweise auf Gräueltaten im sudanesischen Al-Faschir",
      "link": "https://www.tagesschau.de/ausland/afrika/sudan-darfur-gewalt-102.html",
      "published": "2025-11-06T03:00:46",
      "content": "   Massenhinrichtungen, Vergewaltigungen, äußerste Brutalität - Berichte über die Situation im sudanesischen Al-Faschir bestätigen die Hinweise auf Gräueltaten an Zivilisten. In der Stadt sitzen wohl noch 150.000 Menschen fest. Von Heiko Wirtz.[mehr]",
      "content_length": 250,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Neuer Nationalpark in Australien soll Koalas schützen",
      "link": "https://www.tagesschau.de/ausland/ozeanien/koala-nationalpark-australien-100.html",
      "published": "2025-09-08T13:31:56",
      "content": "   Koalas sind vom Aussterben bedroht. Ein riesiger neuer Nationalpark in ihrer Heimat Australien soll nun Tausenden der Tiere Lebensraum und Schutz bieten. Der WWF spricht von einer echten Chance.[mehr]",
      "content_length": 203,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Australien macht den Iran für antisemitische Anschläge verantwortlich",
      "link": "https://www.tagesschau.de/ausland/ozeanien/australien-iran-ausweisung-botschafter-100.html",
      "published": "2025-08-26T06:07:33",
      "content": "   Australien weist den Botschafter des Iran aus - ein lange nicht da gewesener diplomatischer Schritt. Hintergrund sind antisemitische Anschläge in Australien. Laut Regierung ist erwiesen, dass Irans Führung den Auftrag dazu gegeben hat.[mehr]",
      "content_length": 244,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Korallenbleiche im Great Barrier Reef erreicht Rekordausmaß",
      "link": "https://www.tagesschau.de/ausland/ozeanien/australien-great-barrier-reef-korallenbleiche-100.html",
      "published": "2025-08-07T12:43:32",
      "content": "   Das 2.300 Kilometer lange Great Barrier Reef vor der Küste Australiens gehört zum UNESCO-Weltnaturerbe. Doch der Klimawandel setzt ihm immer mehr zu. Wissenschaftler blicken mit Sorge in die Zukunft. Von Udo Schmidt. [mehr]",
      "content_length": 226,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Australien will auch YouTube für Kinder unter 16 Jahren beschränken",
      "link": "https://www.tagesschau.de/ausland/ozeanien/australien-youtube-verbot-100.html",
      "published": "2025-07-30T11:17:25",
      "content": "   Erst Insta, TikTok &amp; Co - und jetzt auch YouTube. Australien will die Nutzung der Videoplattform für Minderjährige einschränken. Wer unter 16 Jahren ist, soll sich kein Konto mehr anlegen dürfen.[mehr]",
      "content_length": 208,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Giftige Algenblüte tötet massenhaft Meerestiere vor Südaustralien",
      "link": "https://www.tagesschau.de/ausland/ozeanien/algenbluete-suedaustralien-naturkatastrophe-100.html",
      "published": "2025-07-23T11:11:17",
      "content": "   An der Südküste Australiens kommt es derzeit zu einem massenhaften Sterben von Meerestieren. Grund ist eine Alge, die sich dort stark ausbreitet. Es herrscht Verzweiflung und Fassungslosigkeit. Von Udo Schmidt.[mehr]",
      "content_length": 219,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Anträge auf Klima-Asyl in Australien: Tausende wollen weg aus Tuvalu",
      "link": "https://www.tagesschau.de/ausland/ozeanien/tuvalu-australien-klimawandel-100.html",
      "published": "2025-07-21T12:28:47",
      "content": "   Malerisch liegt Tuvalu im Pazifik, doch der Inselstaat droht unterzugehen. Australien hat angeboten, die Bevölkerung aufzunehmen - Tausende haben sich beworben. Thorsten Iffland und Anna-Lou Beckmann über die Sorge der Inselbewohner.[mehr]",
      "content_length": 242,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Klimawandel: Warum Bewohner von Tuvalu nach Australien ziehen",
      "link": "https://www.tagesschau.de/ausland/ozeanien/tuvalu-bewohner-klimawandel-100.html",
      "published": "2025-07-21T09:42:52",
      "content": "   Etwa 10.000 Menschen leben in Tuvalu. Doch der Inselstaat im Südpazifik droht wegen des steigenden Meeresspiegels unterzugehen. Die Hälfte der Bevölkerung hat bereits ein Klimavisum beantragt - in Australien. [mehr]",
      "content_length": 218,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Berichterstattung weltweit: Die Korrespondentinnen und Korrespondenten der ARD",
      "link": "https://www.tagesschau.de/korrespondenten",
      "published": "2024-09-09T11:44:16",
      "content": "   Die rund 100 Auslands-Korrespondentinnen und Korrespondenten sind das Rückgrat der ARD-Nachrichtensendungen. Sie berichten aus 28 Studios weltweit - im Fernsehen, im Hörfunk und Online.[mehr]",
      "content_length": 194,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Migrations-Politik - Großbritannien plant deutliche Asylrechts-Verschärfung nach dänischem Vorbild",
      "link": "https://www.deutschlandfunk.de/grossbritannien-plant-deutliche-asylrechts-verschaerfung-nach-daenischem-vorbild-106.html",
      "published": "2025-11-16T06:59:20",
      "content": "Die britische Labour-Regierung will ihre Asylpolitik deutlich verschärfen.",
      "content_length": 74,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Mexiko - 120 Verletzte bei Protesten gegen Gewaltkriminalität",
      "link": "https://www.deutschlandfunk.de/120-verletzte-bei-protesten-gegen-gewaltkriminalitaet-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "In Mexiko ist es bei Protesten gegen Gewaltkriminalität zu schweren Ausschreitungen gekommen.",
      "content_length": 93,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Pressebericht - Behörden fahnden nach 535 Rechtsextremisten mit offenen Haftbefehlen",
      "link": "https://www.deutschlandfunk.de/behoerden-fahnden-nach-535-rechtsextremisten-mit-offenen-haftbefehlen-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "Die deutsche Polizei fahndet derzeit nach 535 Rechtsextremisten mit offenen Haftbefehlen.",
      "content_length": 89,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "JU-Deutschlandtag - Auch Fraktionschef Spahn erwartet keine Änderungen beim Rentenkompromiss",
      "link": "https://www.deutschlandfunk.de/auch-fraktionschef-spahn-erwartet-keine-aenderungen-beim-rentenkompromiss-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "Nach Bundeskanzler Merz hat auch Unionsfraktionschef Spahn Hoffnungen des Parteinachwuchses auf Änderungen am Rentenpaket gedämpft. Die in der Koalition getroffene Vereinbarung sei ein Kompromiss, sagte der CDU-Politiker beim Deutschlandtag der Jungen Union im südbadischen Rust.",
      "content_length": 279,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Volkstrauertag - Präsident des Volksbundes warnt vor einem Verfall der Kriegsgräber",
      "link": "https://www.deutschlandfunk.de/praesident-des-volksbundes-warnt-vor-einem-verfall-der-kriegsgraeber-102.html",
      "published": "2025-11-16T06:59:20",
      "content": "Deutschland gedenkt am heutigen Volkstrauertag der Toten von Krieg und Gewaltherrschaft.",
      "content_length": 88,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Volkstrauertag - Gedenken an die Kriegstoten seit 1922",
      "link": "https://www.deutschlandfunk.de/gedenken-an-die-kriegstoten-seit-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "Der vom Volksbund Deutsche Kriegsgräberfürsorge jährlich organisierte Volkstrauertag erinnert an die Opfer von Kriegen und Gewalt weltweit. Auf Friedhöfen und an Kriegsgräberstätten gibt es Gedenkveranstaltungen, Gottesdienste und Kranzniederlegungen. Hier ein paar Fakten zur Geschichte des Trauertags:",
      "content_length": 303,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Dominikanische Republik - Boot von Drogenschmugglern mit US-Hilfe gestoppt",
      "link": "https://www.deutschlandfunk.de/boot-von-drogenschmugglern-mit-us-hilfe-gestoppt-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "Vor der Küste der Dominikanischen Republik haben Einsatzkräfte des Landes in Zusammenarbeit mit den USA ein Boot von Drogenschmugglern abgefangen.",
      "content_length": 146,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Sinkende Luftverkehrsteuer - Unions-Verkehrspolitiker: \"Flug-Ticketpreise müssen runter\"",
      "link": "https://www.deutschlandfunk.de/unions-verkehrspolitiker-flug-ticketpreise-muessen-runter-102.html",
      "published": "2025-11-16T06:59:20",
      "content": "Der Unions-Verkehrspolitiker Stracke dringt nach der beschlossenen Steuersenkung für die Luftverkehrsbranche auf günstigere Ticketpreise.",
      "content_length": 137,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Weltklimakonferenz - Bundesumweltminister Schneider in Belém eingetroffen",
      "link": "https://www.deutschlandfunk.de/bundesumweltminister-schneider-in-bel-m-eingetroffen-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "Bundesumweltminister Schneider ist am Ort der Weltklimakonferenz im brasilianischen Belém eingetroffen.",
      "content_length": 103,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Zeremonie in Doha - Kongo und M23-Miliz vereinbaren Umsetzung von Waffenruhe",
      "link": "https://www.deutschlandfunk.de/kongo-und-m23-miliz-vereinbaren-umsetzung-von-waffenruhe-108.html",
      "published": "2025-11-16T06:59:20",
      "content": "Die Regierung der Demokratischen Republik Kongo und die M23-Miliz haben sich auf die Umsetzung ihrer Waffenruhe verständigt.",
      "content_length": 124,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Ukraine-Krieg - Kiew will Gefangenenaustausch mit Moskau wieder aufnehmen",
      "link": "https://www.deutschlandfunk.de/kiew-will-gefangenenaustausch-mit-moskau-wieder-aufnehmen-106.html",
      "published": "2025-11-16T06:59:20",
      "content": "Der Austausch von Kriegsgefangenen zwischen Kiew und Moskau soll nach ukrainischen Angaben wieder aufgenommen werden.",
      "content_length": 117,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Brasilien - Großdemonstration zur Halbzeit des Weltklimagipfels",
      "link": "https://www.deutschlandfunk.de/grossdemonstration-zur-halbzeit-des-weltklimagipfels-110.html",
      "published": "2025-11-16T06:59:20",
      "content": "Zur Halbzeit des Weltklimagipfels im brasilianischen Belém haben dort zehntausende Menschen für mehr internationale Anstrengungen gegen die Erderwärmung demonstriert. Der Protestzug wurde von Indigenen angeführt, die in Brasilien ihre angestammten Gebiete - unter anderem im Regenwald - gegen Agrarkonzerne, Holzfäller und illegale Goldschürfer verteidigen.",
      "content_length": 357,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Wirtschaftliche Zusammenarbeit - Reiche reist in die Golfregion",
      "link": "https://www.deutschlandfunk.de/reiche-reist-in-die-golfregion-102.html",
      "published": "2025-11-16T06:59:20",
      "content": "Bundeswirtschaftsministerin Reiche bricht heute zu einer Reise in die Vereinigten Arabischen Emirate und nach Katar auf.",
      "content_length": 120,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Rechts gegen Links - Chilenen wählen neuen Staatschef",
      "link": "https://www.deutschlandfunk.de/chilenen-waehlen-neuen-staatschef-106.html",
      "published": "2025-11-16T06:59:20",
      "content": "In Chile wird ab heute ein neues Staatsoberhaupt bestimmt.",
      "content_length": 58,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Deutsch-Chinesischer Finanzdialog - Finanzminister Klingbeil zu Besuch in Peking",
      "link": "https://www.deutschlandfunk.de/finanzminister-klingbeil-zu-besuch-in-peking-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "Bundesfinanzminister Klingbeil reist heute zum deutsch-chinesischen Finanzdialog nach Peking.",
      "content_length": 93,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Jüdisches Museum Berlin - Frühere US-Botschafterin Gutmann und Physiker Zajfman geehrt",
      "link": "https://www.deutschlandfunk.de/fruehere-us-botschafterin-gutmann-und-physiker-zajfman-geehrt-116.html",
      "published": "2025-11-16T06:59:20",
      "content": "Das Jüdische Museum Berlin hat die ehemalige Botschafterin der Vereinigten Staaten in Deutschland, Amy Gutmann, und den israelischen Physiker Daniel Zajfman mit dem diesjährigen \"Preis für Verständigung und Toleranz\" geehrt. Museumsdirektorin Hetty Berg sagte, so bedrückend die Gegenwart sei, man dürfe sich davon nicht die Fähigkeit nehmen lassen, sich ein besseres Morgen vorzustellen.",
      "content_length": 388,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "EU-Erweiterungsprozess - Außenminister Wadephul reist in alle Westbalkan-Staaten",
      "link": "https://www.deutschlandfunk.de/aussenminister-wadephul-reist-in-alle-westbalkan-staaten-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "Bundesaußenminister Wadephul beginnt heute eine Reise in alle sechs Staaten des westlichen Balkans auf.",
      "content_length": 103,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Dlf-\"Interview der Woche\" - Wehrbeauftragter Otte begrüßt Wehrdienst-Kompromiss",
      "link": "https://www.deutschlandfunk.de/wehrbeauftragter-otte-begruesst-wehrdienst-kompromiss-122.html",
      "published": "2025-11-16T06:59:20",
      "content": "Der Wehrbeauftragte des Bundestags, Otte, begrüßt die Einigung der Regierungskoalition auf ein neues Wehrdienst-Gesetz.",
      "content_length": 119,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Ukraine - Mindestens ein Toter bei Luftangriffen auf Dnipro",
      "link": "https://www.deutschlandfunk.de/mindestens-ein-toter-bei-luftangriffen-auf-dnipro-112.html",
      "published": "2025-11-16T06:59:20",
      "content": "Bei erneuten russischen Drohnenangriffen auf das ostukrainische Gebiet Dnipro ist mindestens ein Mensch getötet worden.",
      "content_length": 119,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Sachsen - Ministerpräsident Kretschmer will Rückkehr zu Energie aus Russland",
      "link": "https://www.deutschlandfunk.de/ministerpraesident-kretschmer-will-rueckkehr-zu-energie-aus-russland-106.html",
      "published": "2025-11-16T06:59:20",
      "content": "Sachsens Ministerpräsident Kretschmer hat sich für eine perspektivische Rückkehr zu Energielieferungen aus Russland ausgesprochen.",
      "content_length": 130,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Dokumente von NS-Opfern - Auschwitz-Komitee kritisiert geplante Auktion in Neuss",
      "link": "https://www.deutschlandfunk.de/auschwitz-komitee-kritisiert-geplante-auktion-in-neuss-112.html",
      "published": "2025-11-16T06:59:20",
      "content": "Das Internationale Auschwitz Komitee kritisiert eine geplante Versteigerung von Dokumenten aus der NS-Zeit.",
      "content_length": 107,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Sturmtief über Westeuropa - Ein Toter in Portugal, Überschwemmungen in Wales",
      "link": "https://www.deutschlandfunk.de/ein-toter-in-portugal-ueberschwemmungen-in-wales-104.html",
      "published": "2025-11-16T06:59:20",
      "content": "Beim Sturmtief \"Claudia\" ist an der portugiesischen Algarve-Küste mindestens ein Mensch ums Leben gekommen.",
      "content_length": 107,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Wahl zum Abgeordnetenhaus - SPD wählt Steffen Krach zum Spitzenkandidaten",
      "link": "https://www.deutschlandfunk.de/spd-waehlt-steffen-krach-zum-spitzenkandidaten-104.html",
      "published": "2025-11-16T06:59:20",
      "content": "Die Berliner SPD hat den früheren Staatssekretär Krach zum Spitzenkandidaten für die Wahl zum Abgeordnetenhaus bestimmt.",
      "content_length": 120,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Mitgliederversammlung - Ulla Schmidt als Bundesvorsitzende der Lebenshilfe bestätigt",
      "link": "https://www.deutschlandfunk.de/ulla-schmidt-als-bundesvorsitzende-der-lebenshilfe-bestaetigt-108.html",
      "published": "2025-11-16T06:59:20",
      "content": "Die frühere Bundesgesundheitsministerin Schmidt ist für weitere vier Jahre im Amt der Vorsitzenden der Lebenshilfe bestätigt worden.",
      "content_length": 132,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Vatikan - Papst Leo empfängt Filmschaffende",
      "link": "https://www.deutschlandfunk.de/papst-leo-empfaengt-filmschaffende-110.html",
      "published": "2025-11-16T06:59:20",
      "content": "Papst Leo XIV. hat zahlreiche internationale Schauspieler, Regisseure, Produzenten und Kameraleute im Vatikan empfangen. In seiner Ansprache würdigte der Papst die Filmkultur und rief dazu auf, das Kino zu schützen.",
      "content_length": 215,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Ski-Weltcup in Finnland - Emma Aicher fährt im Slalom als Dritte aufs Podest",
      "link": "https://www.deutschlandfunk.de/emma-aicher-faehrt-im-slalom-als-dritte-aufs-podest-106.html",
      "published": "2025-11-16T06:59:20",
      "content": "Beim ersten Ski-Weltcup der Saison im finnischen Levi hat die deutsche Skirennfahrerin Emma Aicher den dritten Platz belegt. Die US-Amerikanerin Mikaela Shiffrin sicherte sich Platz eins vor Lara Colturi aus Albanien.",
      "content_length": 217,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "DFB-Pokal der Frauen - Wolfsburgerinnen nach Sieg gegen Freiburg im Viertelfinale",
      "link": "https://www.deutschlandfunk.de/wolfsburgerinnen-nach-sieg-gegen-freiburg-im-viertelfinale-106.html",
      "published": "2025-11-16T06:59:20",
      "content": "Beim Fußball-DFB-Pokal der Frauen haben der VfL Wolfsburg und Carl Zeiss Jena als erste Teams das Viertelfinale erreicht. Die Wolfsburgerinnen gewannen gegen den SC Freiburg mit 3:1, Jena siegte bei Union Berlin mit 1:0.",
      "content_length": 220,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Wetter - Wechselhaft und vielerorts Niederschläge, 5 bis 14 Grad",
      "link": "https://www.deutschlandfunk.de/wechselhaft-und-vielerorts-niederschlaege-5-bis-14-grad-100.html",
      "published": "2025-11-16T06:59:20",
      "content": "Das Wetter: Im äußersten Norden größere Auflockerungen. Sonst bis zur Mitte stark bewölkt und zeitweilig Regen. Südlich des Mains nach Nebelauflösung zunächst heiter, später gebietsweise etwas Regen. Temperaturen von Nord nach Süd 5 bis 14 Grad. Morgen im Süden und Südosten Regen. In den übrigen Regionen wechselnd wolkig mit Schauern. Im Norden und Nordwesten später Aufheiterungen. 4 bis 9 Grad.",
      "content_length": 398,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Ethiopia confirms outbreak of deadly Marburg virus",
      "link": "https://www.theguardian.com/world/2025/nov/15/ethiopia-confirms-outbreak-of-deadly-marburg-virus",
      "published": "2025-11-15T19:23:26",
      "content": "Africa CDC says at least nine cases have been detected of Ebola-like illness,  which kills up to 80% of those infectedEthiopia has confirmed an outbreak of the deadly Marburg virus in the south of the country, the Africa Centres for Disease Control and Prevention (Africa CDC) has said.The Marburg virus is one of the deadliest known pathogens. Like Ebola, it causes severe bleeding, fever, vomiting and diarrhoea and has a 21-day incubation period. Continue reading...",
      "content_length": 469,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Australia is selling arms at a weapons fair in Dubai. Are they destined to be used in Sudan atrocities?",
      "link": "https://www.theguardian.com/australia-news/2025/nov/16/australia-dubai-international-airshow-defence-weapons-arms-fair-sudan-uae",
      "published": "2025-11-15T19:00:11",
      "content": "Australian companies have exported nearly $300m weapons over five years to the UAE, which has denied shipping weapons to a paramilitary group in SudanFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastIn a cavernous conference hall at the edge of the Dubai desert, a retired military officer fronting the Australia pavilion will offer “the key credibility of being in uniform” for defence companies spruiking their wares.“A unique advantage in attracting and engaging with visiting military delegations,” is how briefing notes, shared by the head of Team Defence Australia, describes it. Continue reading...",
      "content_length": 669,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "UK warned that 15% cut to health fund will force ‘impossible choices’ on Africa",
      "link": "https://www.theguardian.com/global-development/2025/nov/15/health-uk-cut-global-fund-aids-tuberculosis-tb-malaria-africa",
      "published": "2025-11-15T05:00:00",
      "content": "Advocates fear that other donors will follow Britain’s reduction to the Global Fund for Aids, TB and malariaThe UK is undermining its legacy in fighting infectious diseases including Aids and malaria by cutting money pledged to a leading global health fund, campaigners claim.The 15% reduction in the contribution to the Global Fund for Aids, Tuberculosis and Malaria announced this week – in a year when the UK, alongside South Africa, is co-host of the fund’s replenishment drive – risks encouraging other countries to cut back commitments as well, advocates fear.The Gates Foundation is a major private contributor to the Global Fund. The foundation also contributes to theguardian.org, which funds independent journalism at the Guardian Continue reading...",
      "content_length": 760,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "South Africa to investigate ‘mysterious’ arrival of 153 Palestinians on plane",
      "link": "https://www.theguardian.com/world/2025/nov/14/anger-south-africa-plane-palestinians-held-12-hours",
      "published": "2025-11-14T16:31:54",
      "content": "Passengers held on runway for 12 hours after landing in Johannesburg without travel documentsSouth Africa will investigate the “mysterious” arrival of scores of Palestinians who were kept on a charter plane at Johannesburg for 12 hours by border police because they did not have travel papers, the president has said.A group of 153 Palestinians arrived at OR Tambo international airport in Johannesburg on a chartered Global Airways flight from Kenya on Thursday without departure stamps, return tickets or details of accommodation, according to the border authorities. Continue reading...",
      "content_length": 589,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "British-Egyptian activist stopped from flying to UK, says family",
      "link": "https://www.theguardian.com/world/2025/nov/14/british-egyptian-activist-alaa-abd-el-fattah-stopped-from-flying-to-uk-says-family",
      "published": "2025-11-14T10:15:57",
      "content": "Egyptian authorities prevented Alaa Abd el-Fattah from attending human rights awards in LondonAlaa Abd el-Fattah, the British-Egyptian writer and human rights campaigner who was freed from jail in September, was stopped from flying to the UK by Egyptian passport control, his family has said.Abd el-Fattah was pardoned after more than 10 years in jail but his status, including his right to travel back and forth between Britain and Egypt, was left unclear and subject to discussion between the family and authorities. Continue reading...",
      "content_length": 538,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Gen Z protests against Mexico president turn violent amid anger over mayor’s death",
      "link": "https://www.theguardian.com/world/2025/nov/16/gen-z-protests-against-mexico-president-turn-violent-amid-anger-over-mayors-death",
      "published": "2025-11-16T05:17:26",
      "content": "100 police officers injured in Mexico City as demonstrators attack National Palace following death of Michoacan mayor who fought drug traffickingAt least 120 people, mostly police officers, were injured as thousands marched through Mexico City to protest against the government of Mexico’s president, Claudia Sheinbaum.The demonstration on Saturday was organised by members of generation Z, but ended with strong backing from older supporters of opposition parties. Continue reading...",
      "content_length": 485,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Indigenous lands must be recognised as part of climate policy, says Brazilian minister",
      "link": "https://www.theguardian.com/environment/2025/nov/15/indigenous-lands-must-be-recognised-as-part-of-climate-policy-says-brazilian-minister",
      "published": "2025-11-15T13:00:10",
      "content": "Sonia Guajajara tells Cop30 the rights of traditional communities must be maintained in the face of exploitation by the mining industryCountries must recognise the demarcation of Indigenous lands as a key component of tackling the climate crisis, and civil society must help in the defence of such lands against mining interests, Brazil’s minister for Indigenous peoples has said.Sonia Guajajara, a longtime Indigenous activist before being appointed a minister by President Lula da Silva, said: “[Among the goals of the Cop30 summit is] a request that countries recognise the demarcation of Indigenous lands as climate policy.” Continue reading...",
      "content_length": 648,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Protesters blockade Cop30 summit over plight of Indigenous peoples",
      "link": "https://www.theguardian.com/environment/2025/nov/14/protesters-blockade-cop30-summit-over-plight-of-indigenous-peoples",
      "published": "2025-11-14T16:23:20",
      "content": "Munduruku people demand to speak to Brazil’s president, saying they are never listened toCop30: click here for full Guardian coverage of the climate talks in BrazilProtesters blockaded the main entrance to the Cop30 climate conference for several hours early on Friday morning, demanding to speak to Brazil’s president about the plight of the country’s Indigenous peoples.About 50 people from the Munduruku people in the Amazon basin blocked the entrance with some assistance from international green groups, watched by a huge phalanx of riot police, soldiers and military vehicles. Continue reading...",
      "content_length": 602,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Carney’s ‘nation-building’ programme misses mark to be truly transformative for Canada",
      "link": "https://www.theguardian.com/world/2025/nov/14/mark-carney-nation-building-canada",
      "published": "2025-11-14T14:18:28",
      "content": "The $C56bn plan focused on investing in a resource economy falls short of changing Canadians’ day-to-day lives Canada’s prime minister, Mark Carney, likes to say that when he was young, “we used to build big things in this country, and we used to build them quickly.”That idea – of sprawling projects that transform nations, has influenced both his narrative as an economist turned politician and his government’s multibillion-dollar investment spree. “It’s time to get back at it, and get on with it,” he said in September. Continue reading...",
      "content_length": 544,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Venezuela’s Maduro urges Trump to avoid Afghanistan-style ‘forever war’",
      "link": "https://www.theguardian.com/world/2025/nov/14/venezuela-maduro-urges-trump-to-avoid-afghanistan-style-forever-war",
      "published": "2025-11-14T12:35:34",
      "content": "Authoritarian leader calls for US to make peace amid military buildup and strikes against alleged drug smugglersExplainer: is US preparing to attack Venezuela?Venezuela’s authoritarian president, Nicolás Maduro, has urged Donald Trump not to lead the US into an Afghanistan-style “forever war”, as the American military buildup in the region intensified and Trump’s defence secretary, Pete Hegseth, vowed to purge the Americas of “narco-terrorists”.Speaking to CNN outside the Miraflores presidential palace in Venezuela’s capital, Caracas, Maduro called on Trump to make peace, not war, after the world’s largest aircraft carrier, USS Gerald R Ford, arrived in the region. Continue reading...",
      "content_length": 693,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "China sends coast guard to Senkaku islands amid row with Japan",
      "link": "https://www.theguardian.com/world/2025/nov/16/china-sends-coast-guard-to-senkaku-islands-amid-row-with-japan",
      "published": "2025-11-16T07:02:46",
      "content": "Activity around Japanese-held islands, also claimed by China, comes after PM Sanae Takaichi said Japan might respond militarily to an invasion of TaiwanChina has sent its coast guard through the waters of the Senkaku islands and military drones past outlying Japanese territory as Beijing ramps up tensions over the Japanese prime minister’s remarks on Taiwan.On Sunday the Chinese coast guard said its ships made a “rights enforcement patrol” through the waters of the Senkaku, which are administered by Japan but also claimed by China as the Diaoyu islands. Continue reading...",
      "content_length": 579,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Trump pressures Thailand to recommit to Cambodia ceasefire with ‘threat of tariffs’",
      "link": "https://www.theguardian.com/world/2025/nov/15/us-pressures-thailand-to-recommit-to-cambodia-ceasefire-with-threat-of-tariffs",
      "published": "2025-11-15T16:03:23",
      "content": "Bangkok had earlier said it was suspending ceasefire, accusing Cambodia of laying landmines along the borderThe US has put pressure on Thailand to recommit to a ceasefire with Cambodia, warning trade talks could be halted as Washington seeks to keep a Donald Trump-brokered truce agreement from falling apart.Earlier this week, Thailand said that it was suspending the ceasefire deal, accusing Cambodia of laying fresh landmines along the border, including one it said wounded a Thai soldier on patrol, who lost a foot in the explosion. Continue reading...",
      "content_length": 556,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "China advises against travel to Japan amid escalating row over PM’s Taiwan comments",
      "link": "https://www.theguardian.com/world/2025/nov/15/china-advises-against-travel-to-japan-amid-escalating-row-over-pms-taiwan-comments",
      "published": "2025-11-15T03:46:38",
      "content": "Sanae Takaichi says the use of force against Taiwan could warrant a military response from TokyoChina has advised its citizens to avoid travelling to Japan, escalating a diplomatic feud sparked by comments from Tokyo’s new prime minister about a hypothetical attack on Taiwan.Sanae Takaichi told Japan’s parliament on 7 November that the use of force against the self-ruled island claimed by China could warrant a military response from Tokyo. Japan has since said its position on Taiwan – just 100km from the nearest Japanese island – is unchanged. Continue reading...",
      "content_length": 569,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Global markets struggle after tech sell-off and fears over Chinese economy",
      "link": "https://www.theguardian.com/business/2025/nov/14/global-markets-fall-after-tech-sell-off-chinese-economy-fears",
      "published": "2025-11-14T21:35:54",
      "content": "Reaction follows Wall Street’s worst day in a month and unprecedented slump in investment in ChinaBusiness live – latest updatesGlobal markets suffered another day of volatile trading after a tech sell-off that fuelled Wall Street’s worst day in a month and weak economic data from China showed an unprecedented slump in investment.The FTSE 100 fell by 1.1% in London, closing down about 100 points at 9,698, as bellwether banking stocks tumbled. Barclays, Lloyds and NatWest slumped between 2.7% and 3.6%. Continue reading...",
      "content_length": 526,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "China voices ‘extreme disappointment’ with Dutch minister at centre of car chip row",
      "link": "https://www.theguardian.com/business/2025/nov/14/china-voices-extreme-disappointment-with-dutch-minister-at-centre-of-car-chip-row",
      "published": "2025-11-14T18:32:44",
      "content": "Vincent Karremans called semiconductor supply chain crisis a ‘wake-up call for western leaders’The Chinese government has expressed “extreme disappointment” with the Dutch minister at the heart of a row over chip supply to the car industry.A spokesperson for the ministry of commerce was responding to a Guardian interview with Vincent Karremans on Thursday in which the politician described the standoff between China and the European Union as a “wake-up call” for western leaders. Continue reading...",
      "content_length": 502,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Coalition announce emissions policy after joint party room; more magic sand products recalled over asbestos contamination – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/nov/16/australia-news-live-liberal-coalition-net-zero-sussan-ley-penny-wong-labor-cop30-chris-bowen-albanese-storms-queensland-nsw-ntwnfb",
      "published": "2025-11-16T06:20:57",
      "content": "This blog is now closedGet our breaking news email, free app or daily news podcastTotal fire ban in parts of New South WalesWhile a storm system continues to affect parts of New South Wales’ east, the state’s west faces extreme fire danger.I expect it will be pretty much what the Nationals have wanted all along because it’s been really clear that they have set the agenda in terms of the energy and climate policy of the Liberal Party.I’m genuinely concerned and genuinely disappointed that this has happened because we do need to take action on climate change.I think my a lot of my community will be going ‘Why on earth has the Coalition done this if they are seeking to ever take back seats’ like mine? Continue reading...",
      "content_length": 727,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Thirteen people injured after demolition derby car ploughs into grandstand during NSW event",
      "link": "https://www.theguardian.com/australia-news/2025/nov/16/thirteen-people-injured-after-speedway-car-ploughs-into-grandstand-during-nsw-demolition-derby",
      "published": "2025-11-16T06:16:25",
      "content": "Two in critical condition after driver crashes into crowd at Walcha Motorcycle Rally about 90km from TamworthFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastA demolition derby car lost control and ploughed into a grandstand, injuring 13 rural motoring enthusiasts on Saturday night.Emergency services rushed to Walcha’s showgrounds, which 90km from Tamworth in New South Wales, early in the evening after a crash at the Walcha Motorcycle Rally. Continue reading...",
      "content_length": 529,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "We have lift-off! Melbourne’s skyscraper peregrine chicks take to the sky",
      "link": "https://www.theguardian.com/australia-news/2025/nov/16/we-have-lift-off-melbournes-skyscraper-peregrine-chicks-take-to-the-sky",
      "published": "2025-11-16T03:35:04",
      "content": "Falcon fledglings’ inaugural flight watched by dedicated fans includes dramatic crash-landingFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastA trio of young falcons born atop a 35-storey building in Melbourne’s CBD have taken flight for the first time, with the take-off captured on a livestream for the world to see.The three peregrine falcons – two females and one male – fledged late last week, with the footage of their first flight posted on Instagram by non-profit organisation Bird Life Australia. The last falcon took flight shortly after 9am on Saturday for the second time – after returning to the ledge in a crash landing the day before. Continue reading...",
      "content_length": 733,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Factchecking five Coalition claims about net zero, from power prices to the $9tn cost",
      "link": "https://www.theguardian.com/australia-news/2025/nov/16/coalition-net-zero-emissions-claims-factcheck-electricity-price-power-bill-cost",
      "published": "2025-11-15T19:00:14",
      "content": "As Liberals join Nationals in abandoning a 2050 emissions target, we unpick some of the opposition’s talking pointsFollow our Australia news live blog for latest updatesSign up for climate and environment editor Adam Morton’s free Clear Air newsletter hereAre you trying to make sense of some of the big claims made by Liberal and National party MPs for abandoning their support for Australia reaching net zero emissions by 2050?We’re here to help. Continue reading...",
      "content_length": 468,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Police detonated a ‘stinger’ grenade at a Melbourne protest. Now two activists may sue over their injuries",
      "link": "https://www.theguardian.com/australia-news/2025/nov/16/police-detonated-a-stinger-grenade-at-a-melbourne-protest-now-two-activists-may-sue-over-their-injuries",
      "published": "2025-11-15T19:00:13",
      "content": "Grenades filled with rubber pellets and other so-called ‘less lethal’ munitions have been increasingly deployed, despite being linked to serious injuries and even deathsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastScout* barely realised that something round and hard, with smoke coming from it, had landed in front of them before it exploded.Pain suddenly shot through their leg and arm. Scout fell to their knees before someone nearby helped them rush out of the area. Continue reading...",
      "content_length": 557,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Viktor Orbán begins ‘anti-war roadshow’ as Hungary gears up for 2026 elections",
      "link": "https://www.theguardian.com/world/2025/nov/15/viktor-orban-hungary-2026-election-campaign-fidesz",
      "published": "2025-11-15T14:31:35",
      "content": "PM makes opposition to support for Ukraine central to Fidesz campaign as it loses ground over cost of living crisisHungary’s prime minister has kicked off a weeks-long “anti-war roadshow”, turning criticism of European support for Ukraine into an early campaign message before next year’s elections.Viktor Orbán’ is scheduled to stage an event in five cities before the end of the year, and started with an assembly on Saturday in the north-western city of Győr. Continue reading...",
      "content_length": 482,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Icelandic is in danger of dying out because of AI and English-language media, says former PM",
      "link": "https://www.theguardian.com/world/2025/nov/15/icelandic-is-in-danger-of-dying-out-because-of-ai-and-english-language-media-says-former-pm",
      "published": "2025-11-15T10:00:06",
      "content": "Katrín Jakobsdóttir and her co-author want the 350,000 people who speak the language to fight for its futureIceland’s former prime minister, Katrín Jakobsdóttir, has said that the Icelandic language could be wiped out in as little as a generation due to the sweeping rise of AI and encroaching English language dominance.Katrín, who stood down as prime minister last year to run for president after seven years in office, said Iceland was undergoing “radical” change when it came to language use. More people are reading and speaking English, and fewer are reading in Icelandic, a trend she says is being exacerbated by the way language models are trained. Continue reading...",
      "content_length": 676,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Orbán’s claims of Trump summit triumph mask growing doubts over his grip on power",
      "link": "https://www.theguardian.com/world/2025/nov/15/orban-claims-of-trump-summit-triumph-mask-growing-doubts-over-grip-on-power-hungary",
      "published": "2025-11-15T06:00:05",
      "content": "Embattled Hungarian leader says he won an indefinite reprieve from sanctions on oil and gas from Russia, but the US has since disputed thisAs Viktor Orbán would tell it, he had the perfect meeting with Donald Trump.After visiting the White House last week, the embattled Hungarian prime minister quickly declared victory, saying he had secured an indefinite exemption from US sanctions on oil and gas imported from Russia. The deal would shield Hungarians from skyrocketing energy prices ahead of parliamentary elections next year and potentially boost Orbán’s chances of extending his 15-year rule. Continue reading...",
      "content_length": 619,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Russia increasingly targeting trains as attacks on Ukraine’s rail network intensify",
      "link": "https://www.theguardian.com/world/2025/nov/15/russia-targeting-trains-ukraine-rail-network-attacks",
      "published": "2025-11-15T05:00:01",
      "content": "Ukrainian minister says more than 800 attacks recorded since start of year as Moscow seeks to destroy country’s logistical capabilitiesUkraine has recorded a threefold increase in the number of attacks on its railway system since July, according to a senior minister, as Moscow seeks to scupper one of Kyiv’s key logistical systems.Oleksii Kuleba, a deputy prime minister with responsibility for infrastructure, said attacks on the network since the start of 2025 had caused damage totalling $1bn (£760m). Continue reading...",
      "content_length": 525,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Trump accused of caving to big business after deal to cut Swiss tariffs to 15%",
      "link": "https://www.theguardian.com/us-news/2025/nov/14/tariffs-swiss-goods-reduced",
      "published": "2025-11-14T21:24:45",
      "content": "Rolex denies ‘any negotiation’ with US although luxury watchmaker entertained Trump and gave him gold clockDonald Trump agreed to cut US tariffs on Switzerland from 39% to 15% as part of a new trade pact, lowering duties that strained economic ties and hit Swiss exporters.The two countries have signed a “non-binding memorandum of understanding”, the Swiss government announced, following bilateral talks in Washington and intense lobbying by Swiss firms. Continue reading...",
      "content_length": 476,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Israel breaching international law by limiting Gaza aid, says Unrwa official",
      "link": "https://www.theguardian.com/world/2025/nov/15/israel-breaching-international-law-by-limiting-gaza-aid-says-unrwa-official",
      "published": "2025-11-15T12:00:09",
      "content": "Natalie Boucly says supplies are ready but only about half of what is needed is getting into territoryIsrael is breaching international law by continuing to impose restrictions on aid flows into Gaza, where the population remains critically short of food and life-saving goods as winter sets in, a senior official at the UN agency for Palestinian refugees has said.In an interview during a recent visit to Brussels, Natalie Boucly, an Unrwa deputy commissioner general, said the whole world – including the EU and US – needed to increase the pressure on Israel’s government to ensure the unrestricted flow of aid into Gaza. Continue reading...",
      "content_length": 643,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "US military planning for divided Gaza with ‘green zone’ secured by international and Israeli troops",
      "link": "https://www.theguardian.com/world/2025/nov/14/us-military-plan-divided-gaza-green-zone",
      "published": "2025-11-14T18:31:07",
      "content": "Exclusive: Almost all Palestinians have been displaced to ‘red zone’ where no reconstruction is plannedThe US is planning for the long-term division of Gaza into a “green zone” under Israeli and international military control, where reconstruction would start, and a “red zone” to be left in ruins.Foreign forces will initially deploy alongside Israeli soldiers in the east of Gaza, leaving the devastated strip divided by the current Israeli-controlled “yellow line”, according to US military planning documents seen by the Guardian and sources briefed on American plans. Continue reading...",
      "content_length": 592,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Guardian’s former Gaza correspondent named young journalist of the year in UK awards",
      "link": "https://www.theguardian.com/media/2025/nov/14/gaza-correspondent-young-journalist-of-the-year-media-freedom-awards",
      "published": "2025-11-14T14:33:43",
      "content": "Malak A Tantesh, 20, ‘showed immense talent and bravery’, said judges at Media Freedom awards in LondonThe UK’s Society of Editors has named Malak A Tantesh, the Guardian’s former Gaza correspondent, as young journalist of the year in the national press category at this year’s Media Freedom awards.The judges said Tantesh “showed immense talent and bravery in some of the hardest conditions ever faced by a journalist, she continued to report while having to forage for food and facing the constant risk of bombing and the threat of targeted killing”. Continue reading...",
      "content_length": 572,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Tenured professor sues University of Kentucky for banning him from law school over comments on Israel",
      "link": "https://www.theguardian.com/us-news/2025/nov/13/kentucky-professor-israel-lawsuit",
      "published": "2025-11-13T18:55:59",
      "content": "Exclusive: Ramsi Woodcock, who calls for an ‘end’ to Israel and military intervention against it, says the university violated his first amendment rightsA tenured law professor sued the University of Kentucky on Thursday after he was banned from teaching and from the law school for comments he made about Israel, including characterizations of the state as a “colonization project” and calls for the world to wage war against it.In a lawsuit filed in federal court, Ramsi Woodcock, an antitrust law scholar, argued that the public university violated his first amendment and due process rights when it abruptly placed him under investigation in July, just days after he was promoted to full professor, over allegations that he violated university policy – including anti-discrimination rules that incorporate a widely disputed definition of antisemitism. Continue reading...",
      "content_length": 875,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Israeli president condemns ‘serious’ attack by settlers on West Bank villages",
      "link": "https://www.theguardian.com/world/2025/nov/12/israeli-settlers-new-attack-violence-west-bank-palestinians",
      "published": "2025-11-12T19:26:00",
      "content": "Isaac Herzog makes rare statement on often-ignored violence as settlers injure Palestinians and attack soldiersDozens of masked Israeli settlers attacked Palestinian villages in the occupied West Bank on Tuesday, injuring four Palestinians and attacking Israeli soldiers in the latest incident of rising settler violence.The settlers attacked the Palestinian villages of Beit Lid and Deir Sharaf, setting vehicles on fire and damaging property belonging to a Bedouin community, with charred remains of cars left behind the next day. Continue reading...",
      "content_length": 552,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Blast from confiscated explosives at police station in Indian-controlled Kashmir kills nine",
      "link": "https://www.theguardian.com/world/2025/nov/15/blast-from-confiscated-explosives-at-police-station-in-indian-controlled-kashmir-kills-nine",
      "published": "2025-11-15T07:18:57",
      "content": "The accidental explosion comes days after a deadly car blast in New Delhi which killed at least eight people near the city’s historic Red FortAt least nine people were killed and 32 injured after a cache of confiscated explosives detonated inside a police station in Indian-controlled Kashmir, police have announced.The blast occurred in the Nowgam area of Srinagar, the region’s main city, late on Friday while a team of forensic experts and police were examining the explosive material, said Nalin Prabhat, the region’s police director general. He ruled out any foul play, saying it was an accident. Continue reading...",
      "content_length": 621,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Kashmir is focus of arrests after Delhi car blast linked to ‘terror module’",
      "link": "https://www.theguardian.com/world/2025/nov/14/kashmir-is-focus-of-arrests-after-delhi-car-blast-linked-to-terror-module",
      "published": "2025-11-14T23:43:51",
      "content": "Investigators believe an explosion that killed 13 people may be linked to group operating in the disputed regionPolice have carried out raids and made several arrests across the Indian region of Kashmir in the aftermath of a car explosion in Delhi that left 13 people dead.On Wednesday, the Indian government confirmed it was treating the blast as a “terror incident” perpetrated by “anti-national forces”. The explosion took place outside one of India’s most significant monuments during rush hour on Monday evening. Continue reading...",
      "content_length": 537,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "India confirms deadly Delhi car blast being treated as terror incident",
      "link": "https://www.theguardian.com/world/2025/nov/12/india-confirms-deadly-delhi-car-blast-being-treated-as-terror-incident-red-fort",
      "published": "2025-11-12T17:46:13",
      "content": "Cabinet says explosion near Red Fort that killed 12 is suspected to have been perpetrated by ‘anti-national forces’India has confirmed it is treating the explosion that killed 12 people outside Delhi’s Red Fort on Monday as a “terror incident” perpetrated by “anti-national forces”.The statement by the cabinet, led by the prime minister, Narendra Modi, confirmed mounting speculation that a terrorist attack was behind the blast that took place during peak time in one of the capital’s busiest areas and outside one of India’s major landmarks. Continue reading...",
      "content_length": 564,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Pakistani parliament votes to give army chief new powers and legal immunity",
      "link": "https://www.theguardian.com/world/2025/nov/12/pakistan-parliament-constitutional-amendment-bill-asim-munir-supreme-court",
      "published": "2025-11-12T17:05:43",
      "content": "Critics say constitutional amendment, which will also limit supreme court’s independence, is ‘funeral for democracy’Pakistan’s parliament has passed a controversial amendment to its constitution that will expand the powers of the army chief and grant him lifelong legal immunity while limiting the independence of the supreme court, in a move critics described as a “funeral for democracy”.Field Marshal Asim Munir, Pakistan’s powerful army chief who is widely seen as a de facto ruler of the country, was the main benefactor from the 27th constitutional amendment, which was passed by the parliamentary lower house on Wednesday. Continue reading...",
      "content_length": 649,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Pakistan opens investigation into Islamabad terror attack",
      "link": "https://www.theguardian.com/world/2025/nov/12/pakistan-opens-investigation-into-islamabad-terror-attack",
      "published": "2025-11-12T14:18:32",
      "content": "Pakistani ministers attribute deadly suicide attack to Indian state terrorism but India denies claimPakistan has opened an investigation into the suicide attack that killed 12 people outside district court buildings in Islamabad, after the prime minister made unsubstantiated claims that “Indian state terrorism” was behind the blast.The attack took place in the middle of the day on Tuesday as the area was thrumming with people. The bomber made several attempts to get inside the buildings before detonating a device next to a police car, killing 12 people and injuring 27. Continue reading...",
      "content_length": 595,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Britain’s biggest housebuilder urges government to support first-time buyers",
      "link": "https://www.theguardian.com/business/2025/nov/16/britains-biggest-housebuilder-urges-government-to-support-first-time-buyers",
      "published": "2025-11-16T07:00:27",
      "content": "Taylor Wimpey chief Jennie Daly calls for revival of help-to-buy equity loan scheme to revive property marketThe boss of one of Britain’s biggest housebuilders has urged the government to announce more support for first-time buyers to revive a property market that has cooled in the “very long shadow” of the looming budget.Jennie Daly, the chief executive of Taylor Wimpey, also warned against an “accumulation of regulation”, arguing that a “perverse outcome” of green measures could be that it becomes unviable to build new homes in poorer areas of the country. Continue reading...",
      "content_length": 584,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Domestic abuse victims who flee with children overseas to be criminalised under new law",
      "link": "https://www.theguardian.com/uk-news/2025/nov/16/domestic-abuse-victims-children-overseas-crime-police-bill-law",
      "published": "2025-11-16T07:00:26",
      "content": "Change to crime and policing bill backed by fathers’ rights groups seeking support in cross-border abduction casesMothers fleeing domestic violence who keep their children overseas without permission would be criminalised for the first time under a new law.The change is introduced in a proposed amendment to the crime and policing bill, backed by fathers’ rights groups and the Reunite International charity. The amendment has not been debated in parliament, and is now before the House of Lords. Continue reading...",
      "content_length": 517,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "‘There is a gap where Alex should be’: the young woman who lost her life in a neglectful prison system",
      "link": "https://www.theguardian.com/society/2025/nov/16/there-is-a-gap-where-alex-should-be-the-young-woman-who-lost-her-life-in-a-neglectful-prison-system",
      "published": "2025-11-16T06:00:25",
      "content": "An inquest has found a Cheshire prison guilty of neglect after Alex Davies, 25, was found dead inside a segregation cell after a lifetime of mental health struggles“There is a gap or a space where Alex should be,” Stacie Davies said. “Wherever I am, she’s not there.”At just 25 years old, her daughter, Alex Davies, was found dead in her segregation cell at Styal prison in Cheshire on Christmas Eve last year. Continue reading...",
      "content_length": 430,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Nature not a blocker to housing growth, inquiry finds",
      "link": "https://www.theguardian.com/uk-news/2025/nov/16/nature-not-blocker-housing-growth-inquiry",
      "published": "2025-11-16T00:01:16",
      "content": "Commons committee report challenges ‘lazy narrative’ used by ministers that scapegoats wildlife and the environmentNature is not a blocker to housing growth, an inquiry by MPs has found, in direct conflict with claims made by ministers.Toby Perkins, the Labour chair of the environmental audit committee, said nature was being scapegoated, and that rather than being a block to growth, it was necessary for building resilient towns and neighbourhoods. Continue reading...",
      "content_length": 471,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Teenager charged with murder after death of girl, 17, in South Wales",
      "link": "https://www.theguardian.com/uk-news/2025/nov/15/teenager-charged-with-after-death-of-girl-17-in-south-wales",
      "published": "2025-11-15T23:09:28",
      "content": "Gwent police name victim as Lainie Williams and have charged Cameron Cheng, 18, a British nationalA teenager has been charged with murder after a 17-year-old girl was killed in South Wales.The girl, named as Lainie Williams, was pronounced dead at the scene, Gwent police said. Continue reading...",
      "content_length": 297,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Michael Jackson is moonwalking back, but after the Springsteen flop is the pop biopic still relevant?",
      "link": "https://www.theguardian.com/music/2025/nov/16/michael-jackson-comeback-legacy-abuse-allegations",
      "published": "2025-11-16T06:00:25",
      "content": "Jackson’s songs are back on charts and biopic trailer racked up 116m views in 24 hours, yet there is a certain hesitation Michael Jackson’s voodoo classic Thriller was high on Billboard’s Hot 100 in the week of 15 November, handing the 16-years-gone King of Pop a record for having a Top 10 hit across six different decades. Simultaneously, Jackson also broke records for receiving 116m views in 24 hours for the trailer of a new biopic, Michael, set for release in April.Millions of fans may be excited and primed for a Jackson biopic. For comparison, the trailer beat out Taylor Swift’s Eras tour preview and it will join a procession of recent music biopics about Bruce Springsteen, Amy Winehouse, Bob Dylan, Elvis Presley and Elton John. The most successful of all – the Freddie Mercury and Queen biopic Bohemian Rhapsody – took in nearly a billion dollars at the box office. Continue reading...",
      "content_length": 899,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Alice Wong, ‘luminary’ writer and disability rights activist, dies aged 51",
      "link": "https://www.theguardian.com/us-news/2025/nov/15/alice-wong-disability-rights-activist-dies-aged-51",
      "published": "2025-11-16T00:35:05",
      "content": "Daughter of immigrants advocated for people with disabilities to have full autonomy over their livesAlice Wong, a writer and disability rights activist who was born with muscular dystrophy and whose independence and writing inspired others, has died. She was 51.Wong died Friday at a hospital in San Francisco due to an infection, said Sandy Ho, a close friend who has been in touch with Wong’s family. Continue reading...",
      "content_length": 422,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Federal immigration officers begin sweep in Charlotte, North Carolina",
      "link": "https://www.theguardian.com/us-news/2025/nov/15/charlotte-north-carolina-federal-immigration-sweep",
      "published": "2025-11-16T00:02:24",
      "content": "Local reports say targets include church parishioners doing yard work and workers hanging Christmas lightsFederal immigration officers on Saturday began a sweep through Charlotte, the largest city in North Carolina, federal officials confirmed.Local media reports said that among the locations targeted by masked federal agents was a church in east Charlotte, where an arrest was made while about 15 to 20 church members were doing yard work on the property. Continue reading...",
      "content_length": 478,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Suspect arrested in shooting death of beloved Oakland football coach",
      "link": "https://www.theguardian.com/us-news/2025/nov/15/suspect-arrested-oakland-football-coach",
      "published": "2025-11-15T21:31:01",
      "content": "Cedric Irving Jr, 27, is alumnus of high school where John Beam taught before gaining fame on Netflix’s Last Change UA 27-year-old Skyline high school alumnus, frequently seen lingering near Laney College, has been taken into custody in connection with the fatal shooting of Oakland football coach John Beam.Police identified the suspect as Cedric Irving Jr, who was apprehended before dawn at the San Leandro, California, Bart station, ending an urgent search for the individual believed responsible. Continue reading...",
      "content_length": 521,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Marjorie Taylor Greene says she’s had ‘warnings for my safety’ after posts by Trump",
      "link": "https://www.theguardian.com/us-news/2025/nov/15/marjorie-taylor-greene-safety-trump",
      "published": "2025-11-15T20:07:08",
      "content": "One-time Maga loyalist diverges with Trump on issues including Epstein, so US president has withdrawn supportMarjorie Taylor Greene, a longtime Republican ally who previously fiercely defended Donald Trump and his Maga movement, said on Saturday she had been contacted by private security firms “with warnings for my safety” after Trump announced on Friday he was withdrawing his support for and endorsement of the Georgia representative.In a post on X, Greene said that “a hot bed of threats against me are being fueled and egged on by the most powerful man in the world”, without referring to Trump by name, adding it was “the man I supported and helped get elected”. Continue reading...",
      "content_length": 689,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Depoortère double helps France survive scare from spirited Fiji",
      "link": "https://www.france24.com/en/sport/20251116-depoort%C3%A8re-double-helps-france-survive-scare-from-spirited-fiji",
      "published": "2025-11-16T06:04:26",
      "content": "Les Bleus fended off a major scare from Fiji Saturday after the game drew equal following France's early 21-point lead. A pair of crucial tries from centre Nicolas Depoortère secured France's victory and brought the team's four-game losing streak to an end.",
      "content_length": 257,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "French ‘counter-monument’ holds up a mirror to ghosts of colonial Algeria",
      "link": "https://www.france24.com/en/france/20251116-french-counter-monument-holds-up-mirror-ghosts-colonialism-algeria-nancy",
      "published": "2025-11-16T05:48:28",
      "content": "A “counter-monument” unveiled last week in the city of Nancy invites viewers to reflect on a dark chapter in French history and acknowledge traumas that have long been silenced. Bringing a fresh perspective to the debate on colonial monuments in public spaces, the initiative addresses a generational thirst for knowledge about a troubled past that continues to cast a long and divisive shadow.",
      "content_length": 394,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Israeli army claims Gazans who arrived in S. Africa on mystery plane had been granted entry",
      "link": "https://www.france24.com/en/middle-east/20251115-israel-army-gazans-palestinian-refugees-south-africa-mystery-plane-granted-entry-ramaphosa",
      "published": "2025-11-15T22:03:21",
      "content": "Israeli authorities said on Saturday that the 153 Gazans flown to South Africa earlier this week had received entry clearance from a third state before take-off. A spokesperson for the Israeli military branch overseeing the operation told FRANCE 24 that the “third country” was in fact South Africa.",
      "content_length": 299,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "French official to sue over ‘revisionist’ remarks hailing Nazi collaborator Pétain",
      "link": "https://www.france24.com/en/france/20251115-french-official-to-sue-over-revisionist-remarks-hailing-nazi-collaborator-p%C3%A9tain",
      "published": "2025-11-15T19:57:44",
      "content": "A senior French official on Saturday said he planned to take legal action over remarks hailing Vichy leader and Nazi collaborator Philippe Pétain as “France’s first resistant fighter”. The comments, which the official described as “clearly revisionist’ were made following a mass in Pétain’s honour.",
      "content_length": 299,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Ex-CIA chief Petraeus: ‘Real opportunity to help Ukraine and crush Russia’s war economy’",
      "link": "https://www.france24.com/en/video/20251115-ex-cia-chief-petraeus-real-opportunity-to-help-ukraine-and-crush-russia-s-war-economy",
      "published": "2025-11-15T18:08:32",
      "content": "In an exclusive interview with FRANCE 24, former CIA director David Petraeus said Russia’s finances are in a far more dire state than many realise, arguing that there is now “a real opportunity” for the United States and other NATO countries to strengthen Ukraine’s defences and “crush the Russian war economy”. He also shared his views on Syria’s new leadership and the situation in Iraq.",
      "content_length": 389,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "UK's PM Keir Starmer under pressure after budget rewrite",
      "link": "https://www.france24.com/en/video/20251115-uk-s-pm-keir-starmer-under-pressure-after-budget-rewrite",
      "published": "2025-11-15T16:55:13",
      "content": "On the eve of a visit to London by U.S. President Donald Trump, British Prime Minister Keir Starmer abruptly summoned Labour lawmakers to a meeting to try to reassert his authority over his increasingly fractious party. It was a rare acknowledgement that decisions taken by his Downing Street office had widened a rift with Labour members of parliament. Eight weeks later, those rifts have burst into the open after a briefing to selected media outlets by unnamed allies of Starmer who said the prime minister would fight any leadership challenge - although none had yet materialised. Analysis by FRANCE 24 international affairs editor Rochelle Ferguson Bouyahi.",
      "content_length": 662,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Trump to seek up to $5 billion from the BBC over edited video",
      "link": "https://www.france24.com/en/video/20251115-trump-to-seek-up-to-5-billion-from-the-bbc-over-edited-video",
      "published": "2025-11-15T16:45:28",
      "content": "U.S. President Donald Trump said on Friday he would likely sue the BBC next week for as much as $5 billion after the British broadcaster admitted it wrongly edited a video of a speech he gave but insisted there was no legal basis for his claim. Details by FRANCE 24 correspondent in London, Bénédicte Paviot.",
      "content_length": 308,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "The French city of Marseille struggles to battle drug crime",
      "link": "https://www.france24.com/en/video/20251115-the-french-city-of-marseille-struggles-to-battle-drug-crime",
      "published": "2025-11-15T16:43:30",
      "content": "A gunman on a motorbike has shot dead the 20-year-old youngest brother of a prominent anti-drug activist in the southern French city of Marseille in a possible warning over his campaigning, a prosecutor said on Friday. France's second largest city is struggling to battle drug crime, with more than a dozen people killed since the start of the year in turf wars and other disputes linked to cocaine and cannabis dealing. Analysis by Joseph Downing, senior lecturer in politics and international relations at Aston University in Marseille.",
      "content_length": 538,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Franco-Algerian writer Boualem Sansal pardoned by Algeria on humanitarian grounds",
      "link": "https://www.france24.com/en/tv-shows/a-week-in-france/20251115-franco-algerian-writer-boualem-sansal-pardoned-by-algeria-on-humanitarian-grounds",
      "published": "2025-11-15T16:13:30",
      "content": "The Franco-Algerian writer Boualem Sansal is recovering in Berlin. The 81-year-old arrived in Germany for medical treatment on Wednesday, after Algeria agreed to a German request for his pardon and release on humanitarian grounds. My guest Adlene Mohammedi, a senior researcher in geopolitics at the Sciences Po Center for International Studies, discusses the state of Franco-Algerian relations moving forward.",
      "content_length": 410,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Guinea launches Simandou mine, hoping to extract 120M tons of iron ore per year",
      "link": "https://www.france24.com/en/video/20251115-guinea-launches-simandou-mine-hoping-to-extract-120m-tons-of-iron-ore-per-year",
      "published": "2025-11-15T15:33:12",
      "content": "On Tuesday, Guinea officially began production at the Simandou mining project — home to the largest known iron ore reserves in the world. Guinean authorities hope the project will generate vital revenue for the country. But China is also heavily invested, as Beijing aims to strengthen its influence over the global market for one of the world's most essential raw materials. Story by Bryan Quinn.",
      "content_length": 397,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Mysterious plane carrying Gaza refugees lands in South Africa",
      "link": "https://www.france24.com/en/video/20251115-mysterious-plane-carrying-gaza-refugees-lands-in-south-africa",
      "published": "2025-11-15T14:03:04",
      "content": "South Africa's intelligence services are investigating who was behind a chartered plane that landed in Johannesburg with more than 150 Palestinians from war-ravaged Gaza who did not have proper travel documents and were held onboard on the tarmac for around 12 hours as a result, the country's president said Friday. Details by FRANCE 24 correspondent in Cape Town, Eunice Masson.",
      "content_length": 380,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Brother of French anti-drugs activist murdered",
      "link": "https://www.france24.com/en/video/20251115-brother-of-french-anti-drugs-activist-murdered",
      "published": "2025-11-15T12:49:18",
      "content": "A gunman on a motorbike has shot dead the 20-year-old brother of a prominent anti-drug activist in Marseille in a possible warning over his campaigning, a French prosecutor said Friday. Story by Charlotte Hughes, Eliza Herbert, and France 2.",
      "content_length": 241,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Trump scraps tariffs on beef, coffee and tropical fruit in a push to lower grocery store prices",
      "link": "https://www.france24.com/en/video/20251115-trump-scraps-tariffs-on-beef-coffee-and-tropical-fruit-in-a-push-to-lower-grocery-store-prices",
      "published": "2025-11-15T12:48:14",
      "content": "President Donald Trump announced Friday that he was scrapping U.S. tariffs on beef, coffee, tropical fruits and a broad swath of other commodities — a dramatic move that comes amid mounting pressure on his administration to better combat high consumer prices. Story by Eliza Herbert.",
      "content_length": 283,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "China tells citizens not to visit Japan as Taiwan row grows",
      "link": "https://www.france24.com/en/video/20251115-china-tells-citizens-not-to-visit-japan-as-taiwan-row-grows",
      "published": "2025-11-15T12:47:08",
      "content": "China has advised its citizens to avoid travelling to Japan, following a diplomatic feud sparked by remarks from Tokyo's new premier about a hypothetical attack on Taiwan. Details and analysis with James Simms, FRANCE 24 correspondent in Tokyo.",
      "content_length": 244,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "DR Congo and M23 sign framework agreement for peace deal in Qatar",
      "link": "https://www.france24.com/en/video/20251115-dr-congo-and-m23-sign-framework-agreement-for-peace-deal-in-qatar",
      "published": "2025-11-15T12:46:11",
      "content": "The Democratic Republic of Congo and the M23 rebel group signed on Saturday in Qatar a framework agreement for a peace deal aimed at ending fighting in eastern Congo. Details by FRANCE 24 correspondent in Kinshasa, Emmet Linvingstone.",
      "content_length": 234,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "DR Congo and M23 rebel group sign a framework agreement for a peace deal in Qatar",
      "link": "https://www.france24.com/en/live-news/20251115-dr-congo-and-m23-rebel-group-sign-a-framework-agreement-for-a-peace-deal-in-qatar",
      "published": "2025-11-15T11:53:37",
      "content": "The Democratic Republic of Congo and the M23 rebel group signed a fresh framework for peace in Qatar Saturday after multiple rounds of direct talks between the warring sides. The Rwanda-backed paramilitary group seized two major cities in DR Congo's east earlier this year.",
      "content_length": 273,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Emily Thornberry: In a world of disinformation, the BBC remains a 'source of truth and reliability'",
      "link": "https://www.france24.com/en/video/20251115-emily-thornberry-in-a-world-of-disinformation-the-bbc-remains-a-source-of-truth-and-reliability",
      "published": "2025-11-15T11:07:19",
      "content": "In a wide-ranging interview with Gavin Lee, British MP and Foreign Affairs Committee Chair Emily Thornberry offers a candid and reflective discussion that spans the complexities of global diplomacy, foreign policy, and the stark challenges of real governance. We explore raging conflicts in Gaza, Ukraine, and Sudan, alongside political turbulence at home within the frat boy culture of British politics. The conversation includes in-depth analysis of the BBC as a century-old institution: its crucial role in the digital age of disinformation, the integrity of its journalism, and the political pressures it faces, both at home and abroad, as a publicly funded broadcaster striving to maintain trust in a deeply divided media and political landscape, amid a fractured world. We are reminded that If you tread the middle path well, “both sides are likely attack you,” explains Ms. Thornberry. “This is life.” The British MP is heartened by a new noticeable trend \"whereby people want to have explainers, they want to understand': the full story with historical context to better understand our world.",
      "content_length": 1100,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "France arrests longtime Arizona fugitive convicted in US sex crimes case",
      "link": "https://www.france24.com/en/france/20251115-france-arrests-longtime-arizona-fugitive-convicted-us-sex-crimes-case",
      "published": "2025-11-15T10:55:45",
      "content": "An American sex offender living in northeastern France was arrested earlier this month and charged with sexually abusing his 10-year-old adopted child, authorities said. Michael Robert Wiseman had fled the US on two separate occasions over the past 14 years to escape prosecution.",
      "content_length": 280,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "MSF revives rescue mission in Mediterranean after new disaster kills 42",
      "link": "https://www.france24.com/en/video/20251115-msf-revives-rescue-mission-in-mediterranean-after-new-disaster-kills-42",
      "published": "2025-11-15T10:39:33",
      "content": "Last week, a boat carrying migrants capsized off the coast of Libya, killing at least 42 people. The incident was the latest in a series of disasters that have killed more than a thousand people in the Mediterranean this year. Humanitarian group MSF - or Doctors Without Borders - announced this week it is restarting its search and rescue activities in the Mediterranean. Details with Rositsa Atana-Sova, the humanitarian affairs coordinator for MSF's search and rescue operations.",
      "content_length": 482,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "US military kills four people in boat attack in the Caribbean",
      "link": "https://www.france24.com/en/video/20251115-us-military-kills-four-people-in-boat-attack-in-the-caribbean",
      "published": "2025-11-15T10:35:44",
      "content": "The United States on Monday conducted its 20th strike on an alleged drug trafficking boat, a Pentagon official said on Thursday. \"The strike occurred in the Caribbean and four narco-terrorists were killed, no survivors,\" the official said. Details by FRANCE 24 correspondent in Washington, Fraser Jackson.",
      "content_length": 305,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Bus crash in Stockholm kills three, shocking Sweden",
      "link": "https://www.france24.com/en/video/20251115-bus-crash-in-stockholm-kills-three-shocking-sweden",
      "published": "2025-11-15T10:29:43",
      "content": "A double-decker bus crashed into a bus stop in Stockholm on Friday, killing three people and injuring three others, police said. Swedish police said on Saturday they believed the incident was an accident. Story by Nicholas Rushworth.",
      "content_length": 233,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Japan PM’s sleep schedule prompts concern",
      "link": "https://www.france24.com/en/video/20251115-japan-pm-s-sleep-schedule-prompts-concern",
      "published": "2025-11-15T10:28:05",
      "content": "Japan's new prime minister says she only gets two to four hours of sleep every night. Sanae Takaichi faces criticism for setting a bad example, as her government also mulls raising the upper limit on overtime work. Report by Mélodie Sforza, Himari Semans and Laurent Berstecher.",
      "content_length": 278,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Fighting climate change with imaginative methods in East-Timor",
      "link": "https://www.france24.com/en/video/20251115-fighting-climate-change-with-imaginative-methods-in-east-timor",
      "published": "2025-11-15T10:02:37",
      "content": "As countries gather in Brazil for the COP 30 climate change conference, FRANCE 24 travels to East Timor, where global warming is wreaking havoc on the fishing industry. The isolated island nation and its 1.4 million people face coastal erosion, rising sea levels and dwindling marine resources. In response, local people are using imaginative methods to tackle overfishing. Report by Juliette Chaignon, Guillaume Gosalbes and Justin McCurry.",
      "content_length": 441,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "UN rights council orders probe of atrocities in Sudan's Al-Fasher",
      "link": "https://www.france24.com/en/video/20251115-un-rights-council-orders-probe-of-atrocities-in-sudan-s-al-fasher",
      "published": "2025-11-15T10:00:08",
      "content": "The UN Human Rights Council on Friday ordered investigators to probe alleged atrocities in Sudan's Al-Fasher and to seek to identify perpetrators so they can be brought to justice. The decision came at the end of a special session called to address the situation in Al-Fasher, amid mounting warnings of crimes against humanity and the risk of genocide. Story by Jennie Shin.",
      "content_length": 374,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Wyoming dinosaur mummies give us a new view of duck-billed species",
      "link": "https://arstechnica.com/science/2025/11/wyoming-dinosaur-mummies-give-us-a-new-view-of-duck-billed-species/",
      "published": "2025-11-15T12:00:59",
      "content": "Edmontosaurus annectens, a large herbivore duck-billed dinosaur that lived toward the end of the Cretaceous period, was discovered back in 1908 in east-central Wyoming by C.H. Sternberg, a fossil collector. The skeleton, later housed at the American Museum of Natural History in New York and nicknamed the “AMNH mummy,” was covered by scaly skin imprinted in the surrounding sediment that gave us the first approximate idea of what the animal looked like.\nMore than a century later, a team of paleontologists led by Paul C. Sereno, a professor of organismal biology at the University of Chicago, got back to the same exact place where Sternberg dug up the first Edmontosaurus specimen. The researchers found two more Edmontosaurus mummies with all fleshy external anatomy imprinted in a sub-millimeter layer of clay. For the first time, we uncovered an accurate image of what Edmontosaurus really looked like, down to the tiniest details, like the size of its scales and the arrangement of spikes on its tail. And we were in for at least a few surprises.\nEvolving images\nOur view of Edmontosaurus changed over time, even before Sereno’s study. The initial drawing of Edmontosaurus was made in 1909 by Charles R. Knight, a famous paleoartist, who based his visualization on the first specimen found by Sternberg. “He was accurate in some ways, but he made a mistake in that he drew the crest extending throughout the entire length of the body,” Sereno says. The mummy Knight based his drawing on had no tail, so understandably, the artist used his imagination to fill in the gaps and made the Edmontosaurus look a little bit like a dragon.Read full article\nComments",
      "content_length": 1664,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "US may owe $1 trillion in refunds if SCOTUS cancels Trump tariffs",
      "link": "https://arstechnica.com/tech-policy/2025/11/tariff-refunds-may-get-messy-if-trump-loses-supreme-court-fight/",
      "published": "2025-11-14T21:49:01",
      "content": "If Donald Trump loses his Supreme Court fight over tariffs, the US may be forced to return “tens of billions of dollars to companies that have paid import fees this year, plus interest,” The Atlantic reported. And the longer the verdict is delayed, the higher the refunds could go, possibly even hitting $1 trillion.\nFor tech companies both large and small, the stakes are particularly high. A Trump defeat would not just mean clawing back any duties paid on imports to the US that companies otherwise can use to invest in their competitiveness. But, more critically in the long term, it would also end tariff shocks that, as economics lecturer Matthew Allen emphasized in a report for The Conversation, risked harming “innovation itself” by destabilizing global partnerships and diverse supply chains in “tech-intensive, IP-led sectors like semiconductors and software.”\nCurrently, the Supreme Court is weighing two cases that argue that the US president does not have unilateral authority to impose tariffs under the International Emergency Economic Powers Act (IEEPA). Defending his regime of so-called “reciprocal tariffs,” Trump argued these taxes were necessary to correct the “emergency” of enduring trade imbalances that he alleged have unfairly enriched other countries while bringing the US “to the brink of catastrophic decline.”Read full article\nComments",
      "content_length": 1366,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "The twin probes just launched toward Mars have an Easter egg on board",
      "link": "https://arstechnica.com/space/2025/11/the-twin-probes-just-launched-toward-mars-have-an-easter-egg-on-board/",
      "published": "2025-11-14T21:30:07",
      "content": "The first multi-spacecraft science mission to launch to Mars is now on its way, and catching a ride on the twin probes are the first kiwis to fly to the red planet.\nNASA’s ESCAPADE (Escape and Plasma Acceleration and Dynamics Explorers) mission lifted off on a 22-month trip to Mars on Thursday aboard a New Glenn rocket. Once there, the identical satellites will enter Martian orbit to study in real time how space weather affects the planet’s hybrid magnetosphere and how the interaction drove Mars to lose its once-dense atmosphere.\nLed by the Space Sciences Laboratory at the University of California, Berkeley—the two spacecraft are named “Blue” and “Gold” after the school’s colors—the ESCAPADE probes are the first Mars-bound vehicles to be designed, built, and tested by Rocket Lab, the end-to-end space company headquartered in California but founded in New Zealand.Read full article\nComments",
      "content_length": 901,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "As shutdown ends, dubious CDC panel gets back to dismantling vaccine schedule",
      "link": "https://arstechnica.com/health/2025/11/as-shutdown-ends-dubious-cdc-panel-gets-back-to-dismantling-vaccine-schedule/",
      "published": "2025-11-14T21:01:15",
      "content": "With the government reopening, the dubious panel of vaccine advisors selected by anti-vaccine Health Secretary Robert F. Kennedy is wasting no time getting back to dismantling the federal childhood vaccine schedule.\nA meeting that was scheduled for October but put on hold during the shutdown has already been rescheduled for December 4 and 5. A Federal Register notice Thursday said that the meeting will “include discussions on vaccine safety, the childhood and adolescent immunization schedule, and hepatitis B vaccines.” The announcement was light on information beyond that but indicated that there would be a vote on hepatitis B vaccines.\nThe panel—the Advisory Committee on Immunization Practices (ACIP) for the Centers for Disease Control and Prevention—is typically composed of preeminent, extensively vetted vaccine experts. But, in June, Kennedy summarily fired all 17 experts on the panel and installed 12 new members, almost all of whom are questionably qualified and espouse anti-vaccine views.Read full article\nComments",
      "content_length": 1034,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "How two Nissan Leafs help make a regional airport more resilient",
      "link": "https://arstechnica.com/cars/2025/11/california-airport-tries-out-bidirectional-ev-charging-microgrid/",
      "published": "2025-11-14T20:45:35",
      "content": "Not everything about the future sucks. Like electric cars. Sure, there’s one thing that dinosaur-burners do better—short refueling stops—but even the least efficient EV is still multiple times better than its gas equivalent. So much better in fact that it offsets all the extra energy needed to make the battery within a year or two. They’re quieter, and easy to drive. And in a pinch, they can power your house from the garage. Or how about an airport?\nOK, we’re not talking about a major international airport (although I really need to talk to someone at Dulles International Airport about my idea to electrify those Space 1999-esque mobile lounges at some point). But up in Humboldt County, California, there’s a microgrid at the Redwood Coast Airport that has now integrated bidirectional charging, and a pair of Nissan Leaf EVs, into its operation.\nThe microgrid has been operating since 2021 with a 2.2 MW solar array, 8.9 MWh of battery storage, and a 300 KW net-metered solar system. It can feed excess power back into PG&amp;E’s local grid and draw power from the same, but in an outage, the microgrid can keep the airport up and operational.Read full article\nComments",
      "content_length": 1178,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "“How about no”: FCC boss Brendan Carr says he won’t end news distortion probes",
      "link": "https://arstechnica.com/tech-policy/2025/11/how-about-no-fcc-boss-brendan-carr-says-he-wont-end-news-distortion-probes/",
      "published": "2025-11-14T20:32:10",
      "content": "Federal Communications Commission Chairman Brendan Carr says he won’t scrap the agency’s controversial news distortion policy despite calls from a bipartisan group of former FCC chairs and commissioners.\n“How about no,” Carr wrote in an X post in response to the petition from former FCC leaders. “On my watch, the FCC will continue to hold broadcasters accountable to their public interest obligations.”\nThe petition filed yesterday by former FCC chairs and commissioners asked the FCC to repeal its 1960s-era news distortion policy, which Carr has repeatedly invoked in threats to revoke broadcast licenses. In the recent Jimmy Kimmel controversy, Carr said that ABC affiliates could have licenses revoked for news distortion if they kept the comedian on the air.Read full article\nComments",
      "content_length": 791,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "What’s it like to compete in the longest US off-road rally with no GPS?",
      "link": "https://arstechnica.com/cars/2025/11/i-drove-for-over-2000-kilometers-off-road-without-gps-in-the-rebelle-rally/",
      "published": "2025-11-14T19:22:25",
      "content": "I’ve been involved with the Rebelle Rally since its inception in 2016, either as a competitor or live show host, and over the past 10 years, I’ve seen it evolve from a scrappy rally with big dreams to the world-class event that it is today.\nIn a nutshell, the Rebelle Rally is the longest competitive off-road rally in the United States, covering over 2,000 kilometers, and it just happens to be for women. Over eight days, teams of two must plot coordinates on a map, figure out their route, and find multiple checkpoints—both marked and unmarked—with no GPS, cell phones, or chase crews. It is not a race for speed but rather a rally for navigational accuracy over some of the toughest terrain California and Nevada have to offer. There are two classes: 4×4 with vehicles like the Jeep Wrangler and Ford Bronco and X-Cross for cars like the Honda Passport and BMW X5. Heavy modifications aren’t needed, and many teams compete for the coveted Bone Stock award.\nFor this 10th anniversary, I got back behind the wheel of a 2025 Subaru Crosstrek Wilderness as a driver, with Kendra Miller as my navigator, to defend my multiple podium finishes and stage wins and get reacquainted with the technology, or lack thereof, that makes this multi-day competition so special.Read full article\nComments",
      "content_length": 1291,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Three astronauts are stuck on China’s space station without a safe ride home",
      "link": "https://arstechnica.com/science/2025/11/three-astronauts-are-stuck-on-chinas-space-station-without-a-safe-ride-home/",
      "published": "2025-11-14T18:56:24",
      "content": "Wrapping up 204 days in orbit, three Chinese astronauts flew back to Earth aboard a Shenzhou spacecraft Friday, leaving three crewmates behind on the Tiangong space station with a busted lifeboat.\nCommander Chen Dong, concluding his third trip to space, and rookie crewmates Chen Zhongrui and Wang Jie touched down inside their spacecraft at the Dongfeng landing zone at 1:29 am EST (06:29 UTC) Friday. The parachute-assisted landing occurred in the mid-afternoon at the return zone, located in the remote Gobi Desert of northwestern China.\nChinese space officials upended operations on the country’s Tiangong space lab last week after astronauts found damage to one of two Shenzhou return capsules docked at the station. The China Manned Space Agency, run by the country’s military, announced changes to the space station’s flight plan November 4, the day before three crew members were supposed to depart and fly home.Read full article\nComments",
      "content_length": 946,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Forget AGI—Sam Altman celebrates ChatGPT finally following em dash formatting rules",
      "link": "https://arstechnica.com/ai/2025/11/forget-agi-sam-altman-celebrates-chatgpt-finally-following-em-dash-formatting-rules/",
      "published": "2025-11-14T18:45:34",
      "content": "Em dashes have become what many believe to be a telltale sign of AI-generated text over the past few years. The punctuation mark appears frequently in outputs from ChatGPT and other AI chatbots, sometimes to the point where readers believe they can identify AI writing by its overuse alone—although people can overuse it, too.\nOn Thursday evening, OpenAI CEO Sam Altman posted on X that ChatGPT has started following custom instructions to avoid using em dashes. “Small-but-happy win: If you tell ChatGPT not to use em-dashes in your custom instructions, it finally does what it’s supposed to do!” he wrote.\nThe post, which came two days after the release of OpenAI’s new GPT-5.1 AI model, received mixed reactions from users who have struggled for years with getting the chatbot to follow specific formatting preferences. And this “small win” raises a very big question: If the world’s most valuable AI company has struggled with controlling something as simple as punctuation use after years of trying, perhaps what people call artificial general intelligence (AGI) is farther off than some in the industry claim.Read full article\nComments",
      "content_length": 1141,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "World’s oldest RNA extracted from Ice Age woolly mammoth",
      "link": "https://arstechnica.com/science/2025/11/worlds-oldest-rna-extracted-from-ice-age-woolly-mammoth/",
      "published": "2025-11-14T18:06:55",
      "content": "A young woolly mammoth now known as Yuka was frozen in the Siberian permafrost for about 40,000 years before it was discovered by local tusk hunters in 2010. The hunters soon handed it over to scientists, who were excited to see its exquisite level of preservation, with skin, muscle tissue, and even reddish hair intact. Later research showed that, while full cloning was impossible, Yuka’s DNA was in such good condition that some cell nuclei could even begin limited activity when placed inside mouse eggs.\nNow, a team has successfully sequenced Yuka’s RNA—a feat many researchers once thought impossible. Researchers at Stockholm University carefully ground up bits of muscle and other tissue from Yuka and nine other woolly mammoths, then used special chemical treatments to pull out any remaining RNA fragments, which are normally thought to be much too fragile to survive even a few hours after an organism has died. Scientists go to great lengths to extract RNA even from fresh samples, and most previous attempts with very old specimens have either failed or been contaminated.\nA different view\nThe team used RNA-handling methods adapted for ancient, fragmented molecules. Their scientific séance allowed them to explore information that had never been accessible before, including which genes were active when Yuka died. In the creature’s final panicked moments, its muscles were tensing and its cells were signaling distress—perhaps unsurprising since Yuka is thought to have died as a result of a cave lion attack.Read full article\nComments",
      "content_length": 1552,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Dogs came in a wide range of sizes and shapes long before modern breeds",
      "link": "https://arstechnica.com/science/2025/11/dogs-came-in-a-wide-range-of-sizes-and-shapes-long-before-modern-breeds/",
      "published": "2025-11-14T17:49:45",
      "content": "Our best friends come in a fantastic array of shapes and sizes; a Borzoi looks nothing like a Boston terrier, except for a certain fundamental, ineffable (except to taxonomists) doggyness about them. And it’s been that way almost from the beginning. A recent study of dog and wolf skulls from the last 50,000 years found that dogs living just after the last Ice Age were already about half as varied in their shape and size as modern dogs.\n“Shaped like a friend” means a lot of different things\nBiologist and archaeologist Allowen Evin, of CNRS, and her colleagues compared the size and shape of 643 skulls from dogs and wolves: 158 from modern dogs, 86 from modern wolves, and 391 from archaeological sites around the world spanning the last 50,000 years. By comparing the locations and sizes of certain skeletal landmarks, such as bony protrusions where muscles attached, the researchers could quantify how different one skull was from another. That suggested a few things about how dogs, or at least the shapes of their heads, have evolved over time.\nThe team’s results suggest that dogs that lived during the Mesolithic (before settled farming life came into fashion in the Middle East) and the Neolithic (after farming took off but before the heyday of copper smelting; 10,000 BCE is a general starting point) were a surprisingly diverse bunch, at least in terms of the size and shape of their skulls.Read full article\nComments",
      "content_length": 1432,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Scientist pleaded guilty to smuggling Fusarium graminearum into US. But what is it?",
      "link": "https://arstechnica.com/science/2025/11/scientist-pleaded-guilty-to-smuggling-fusarium-graminearum-into-us-but-what-is-it/",
      "published": "2025-11-14T17:34:25",
      "content": "A Chinese plant scientist at the University of Michigan, who drew national attention in June 2025 when she was arrested and accused along with another Chinese scientist of smuggling a crop-damaging fungus into the US, pleaded guilty on November 12, 2025, to charges of smuggling and making false statements to the FBI. Under her plea agreement, Yunqing Jian, 33, was sentenced to time served and expected to be deported.\nHer arrest put a spotlight on Fusarium graminearum, a harmful pathogen. But while its risk to grains such as wheat, corn, and rice can be alarming, Fusarium isn’t new to American farmers. The US Department of Agriculture estimates it costs wheat and barley farmers more than $1 billion a year.\nTom Allen, an extension and research professor of plant pathology at Mississippi State University, explains what Fusarium graminearum is and isn’t.Read full article\nComments",
      "content_length": 888,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Years later, Arkane’s Dishonored is still a modern stealth classic",
      "link": "https://arstechnica.com/gaming/2025/11/years-later-arkanes-dishonored-is-still-a-modern-stealth-classic/",
      "published": "2025-11-14T16:22:33",
      "content": "Back in 2012, Dishonored earned the first Game of the Year honor of my tenure at Ars Technica. Looking back on the game some 13 years later, Arkane’s well-constructed world of steam punk magical realism earns its place as a modern classic.\nThe game does a great job of drawing you into that world immediately, with a memorable opening sequence that sees you framed for the on-screen murder of the empress you’ve been sworn to protect. The scene does a great job establishing the emotional stakes of the coming missions while also throwing you into the deep end of the political infighting that has consumed a besieged, plague-beset kingdom.\n\n      A Victorian steam punk world you can lose yourself in.\n        Credit:\n          Arkane Studios\n      \nThose stakes, and a battle against a real feeling of injustice, drive the plot through some admittedly predictable beats as Dishonored continues through a set of sneak-and-assassinate missions. But it’s hard to care about that predictability when even minor side characters on both sides of the conflict quickly develop from stereotypes to engaging, fleshed-out characters.Read full article\nComments",
      "content_length": 1150,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Blue Origin’s New Glenn rocket came back home after taking aim at Mars",
      "link": "https://arstechnica.com/science/2025/11/blue-origin-caps-second-heavy-lift-launch-with-first-offshore-landing/",
      "published": "2025-11-14T14:01:28",
      "content": "The rocket company founded a quarter-century ago by billionaire Jeff Bezos made history Thursday with the pinpoint landing of an 18-story-tall rocket on a floating platform in the Atlantic Ocean.\nThe on-target touchdown came nine minutes after the New Glenn rocket, built and operated by Bezos’ company Blue Origin, lifted off from Cape Canaveral Space Force Station, Florida, at 3:55 pm EST (20:55 UTC). The launch was delayed from Sunday, first due to poor weather at the launch site in Florida, then by a solar storm that sent hazardous radiation toward Earth earlier this week.\n“We achieved full mission success today, and I am so proud of the team,” said Dave Limp, CEO of Blue Origin. “It turns out Never Tell Me The Odds (Blue Origin’s nickname for the first stage) had perfect odds—never before in history has a booster this large nailed the landing on the second try. This is just the beginning as we rapidly scale our flight cadence and continue delivering for our customers.”Read full article\nComments",
      "content_length": 1012,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Researchers question Anthropic claim that AI-assisted attack was 90% autonomous",
      "link": "https://arstechnica.com/security/2025/11/researchers-question-anthropic-claim-that-ai-assisted-attack-was-90-autonomous/",
      "published": "2025-11-14T12:20:48",
      "content": "Researchers from Anthropic said they recently observed the “first reported AI-orchestrated cyber espionage campaign” after detecting China-state hackers using the company’s Claude AI tool in a campaign aimed at dozens of targets. Outside researchers are much more measured in describing the significance of the discovery.\nAnthropic published the reports on Thursday here and here. In September, the reports said, Anthropic discovered a “highly sophisticated espionage campaign,” carried out by a Chinese state-sponsored group, that used Claude Code to automate up to 90 percent of the work. Human intervention was required “only sporadically (perhaps 4-6 critical decision points per hacking campaign).” Anthropic said the hackers had employed AI agentic capabilities to an “unprecedented” extent.\n“This campaign has substantial implications for cybersecurity in the age of AI ‘agents’—systems that can be run autonomously for long periods of time and that complete complex tasks largely independent of human intervention,” Anthropic said. “Agents are valuable for everyday work and productivity—but in the wrong hands, they can substantially increase the viability of large-scale cyberattacks.”Read full article\nComments",
      "content_length": 1221,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Rocket Report: Blue Origin’s stunning success; vive le Baguette One!",
      "link": "https://arstechnica.com/space/2025/11/rocket-report-blue-origins-stunning-success-vive-le-baguette-one/",
      "published": "2025-11-14T12:10:01",
      "content": "Welcome to Edition 8.19 of the Rocket Report! Thursday was a monumental day in launch history with Blue Origin’s New Glenn rocket not just taking off successfully, but with the first stage masterfully returning to the surface of the ocean, hovering near the Jacklyn drone ship, and then making a landing in the center of the barge. It was fantastic to watch and cements our new reality of reusable rockets. The future of space access is very bright indeed.\nAs always, we welcome reader submissions, and if you don’t want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.\n\n    \n                        \n                  \n      \n\nPrivate Chinese rocket fails. Galactic Energy’s solid-fuel Ceres-1 rocket lifted off from Jiuquan Satellite Launch Center in northwest China on Sunday, carrying three satellites toward low-Earth orbit. The rocket’s first three stages performed well, according to media reports, but its fourth and final stage shut down too early, leading to the loss of all three payloads, Space.com reports.Read full article\nComments",
      "content_length": 1269,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "US spy satellites built by SpaceX send signals in the “wrong direction”",
      "link": "https://arstechnica.com/tech-policy/2025/11/us-spy-satellites-built-by-spacex-send-signals-in-the-wrong-direction/",
      "published": "2025-11-14T12:00:46",
      "content": "About 170 Starshield satellites built by SpaceX for the US government’s National Reconnaissance Office (NRO) have been sending signals in the wrong direction, a satellite researcher found.\nThe SpaceX-built spy satellites are helping the NRO greatly expand its satellite surveillance capabilities, but the purpose of these signals is unknown. The signals are sent from space to Earth in a frequency band that’s allocated internationally for Earth-to-space and space-to-space transmissions.\nThere have been no public complaints of interference caused by the surprising Starshield emissions. But the researcher who found them says they highlight a troubling lack of transparency in how the US government manages the use of spectrum and a failure to coordinate spectrum usage with other countries.Read full article\nComments",
      "content_length": 819,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "This flu season looks grim as H3N2 emerges with mutations",
      "link": "https://arstechnica.com/health/2025/11/this-flu-season-looks-grim-as-h3n2-emerges-with-mutations/",
      "published": "2025-11-13T23:22:41",
      "content": "Health officials in the United Kingdom are warning that this year’s flu season for the Northern Hemisphere is looking like it will be particularly rough—and the US is not prepared.\nThe bleak outlook is driven by a new strain of H3N2, which emerged over the summer (at the end of the Southern Hemisphere’s season) sporting several mutations. Those changes are not enough to spark the direst of circumstances—a deadly pandemic—but they could help the virus dodge immune responses, resulting in an outsize number of severe illnesses that could put a significant strain on hospitals and clinics.\nIn the UK, the virus has taken off. The region’s flu season has started around five weeks earlier than normal and is making a swift ascent.Read full article\nComments",
      "content_length": 757,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Google claims win for everyone as text scammers lost their cloud server",
      "link": "https://arstechnica.com/tech-policy/2025/11/google-claims-win-for-everyone-as-text-scammers-lost-their-cloud-server/",
      "published": "2025-11-13T22:10:13",
      "content": "The day after Google filed a lawsuit to end text scams primarily targeting Americans, the criminal network behind the phishing scams was “disrupted,” a Google spokesperson told Ars.\nAccording to messages that the “ringleader” of the so-called “Lighthouse enterprise” posted on his Telegram channel, the phishing gang’s cloud server was “blocked due to malicious complaints.”\n“We will restore it as soon as possible!” the leader posted on the channel—which Google’s lawsuit noted helps over 2,500 members coordinate phishing attacks that have resulted in losses of “over a billion dollars.”Read full article\nComments",
      "content_length": 615,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Are you ready for a $1,000 Steam Machine? Some analysts think you should be.",
      "link": "https://arstechnica.com/gaming/2025/11/are-you-ready-for-a-1000-steam-machine-some-analysts-think-you-should-be/",
      "published": "2025-11-13T21:57:52",
      "content": "If you ask random gamers what price they think Valve will charge for its newly announced Steam Machine hardware, you’ll get a wide range of guesses. But if you ask the analysts who follow the game industry for a living the same question… well, you’ll actually get the same wide range of (somewhat better-informed) guesses.\nAt the high end of those guesses are analysts like F-Squared‘s Michael Futter, who expects a starting price of $799 to $899 for the entry-level 512GB Steam Machine and a whopping $1,000 to $1,100 for the 2TB version. With internal specs that Futter says “will rival a PS5 and maybe even hit PS5 Pro performance,” we can expect a “hefty price tag” from Valve’s new console-like effort. At the same time, since Valve is “positioning this as a dedicated, powerful gaming PC… I suspect that the price will be below a similarly capable traditional desktop,” Futter said.\nDFC Intelligence analyst David Cole similarly expects the Steam Machine to start at a price “around $800” and go up to “around $1,000” for the 2TB model. Cole said he expects Valve will seek “very low margins” or even break-even pricing on the hardware itself, which he said would probably lead to pricing “below a gaming PC but slightly above a high-end console.”Read full article\nComments",
      "content_length": 1279,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Tim Cook could step down as Apple CEO next year",
      "link": "https://www.theverge.com/news/821691/tim-cook-step-down-apple-ceo-next-year",
      "published": "2025-11-15T19:31:45",
      "content": "\n\n\n\t\n\tWave goodbye.\t\n\nAccording to the Financial Times, Tim Cook could step down as Apple CEO as early as next year. And the board has started to seriously work out a succession plan. FT says that John Ternus, Apple’s senior vice-president of hardware engineering, is considered the frontrunner for the position.\n\nCook, who turned 65 recently, has been CEO for 14 years and overseen both incredible growth and his fair share of controversies. He’s also largely seen as responsible for Apple’s shift to outsourcing manufacturing, which has enabled it to operate at much larger scales than it did traditionally. \n\nRumors of Cook’s stepping down follow the retirement of Apple COO Jeff Williams, whose last day at the company was Friday. As part of that departure, there has been some shuffling of responsibilities at the executive level, including expanded roles for Services chief Eddy Cue, head of software engineering Craig Federighi, and Ternus. \n\nRegardless of who winds up taking over as CEO, it’s unlikely to be someone from outside Apple. Tim Cook has previously said there is a strong preference for an internal candidate and that the company has “very detailed succession plans.”\n\n",
      "content_length": 1189,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Here are 25 of our favorite outdoorsy deals from REI’s massive Holiday Sale",
      "link": "https://www.theverge.com/gadgets/821397/best-rei-holiday-sale-2025-deals",
      "published": "2025-11-15T17:00:00",
      "content": "\n\n\n\t\n\tYou can snag the high-end Garmin Fenix 8 for a whopping $250 off right now.\t\n\nREI doesn’t do Black Friday, but that doesn’t mean you won’t be able to save this holiday season. The outdoor retailer’s annual Holiday Sale is now underway and runs through November 24th, offering up to 30 percent off gadgets and gear designed for the outdoors. Right now, you can save on Garmin watches, headlamps, sleeping pads, camp chairs, and Bluetooth speakers from brands like JBL, Yeti, and REI.\n\nBelow, we’ve rounded up some of the best deals you can shop, whether you’re upgrading your kit or working through a wish list. In many cases, we’ve either tested or reviewed the products on sale, so you can shop with confidence for yourself or loved ones. Also, keep in mind that REI members receive special savings on outdoor gear, including 20 percent off one full-price item, plus 20 percent off one eligible item at an REI Outlet.\n\n\nGarmin Fenix 8\nThe Garmin Fenix 8 is a premium multisport watch that adds a speaker, mic, and on-device assistant for calls, timers, and voice commands. It also offers elite battery life, dual-frequency GPS, and robust sensors. Read our review.\n\nWhere to Buy: $1099.99 $849.99 at Amazon (47mm) $1099.99 $849.99 at Walmart (51mm) $1099.99 $849.99 at REI (47mm)Garmin Venu 3\nThe last-gen Venu 3 remains one of our favorite Garmin smartwatches. It deftly balances the brand&#8217;s in-depth training analytics with a host of smartwatch features, including a vibrant OLED display, a battery that can last for several days, and a heart rate sensor that enables FDA-cleared ECG and AFib detection. Read our review.\n\nWhere to Buy: $449.99 $349.99 at Amazon $449.99 $349.99 at Best Buy $449.99 $349.99 at REIGarmin Forerunner 165 Music\nThe Garmin Forerunner 165 Music lets you download songs from Spotify, Amazon Music, and more. It also provides in-depth training metrics; however, it leaves out some of the more advanced features in exchange for a more affordable price. Read our review.\n\nWhere to Buy: $299.99 $249.99 at Amazon $299.99 $249.99 at Best Buy $299.99 $249.99 at REI\n\nThe Garmin Vivoactive 6 has returned to its all-time low of $249.99 ($50 off) at Amazon, Walmart, and REI. The fitness watch provides up to 11 days of battery life and can track a range of workouts, including walking, running, cycling, HIIT, golf, and more. It also provides extensive health monitoring, including wrist-based heart rate, morning report, stress tracking, and menstrual cycle and pregnancy tracking. However, there is no ECG compatibility, though it features a slightly slimmer profile than its predecessor.\n\n\n\nIf you have plans to run one last ultramarathon before the end of the year, you can snag the Garmin Enduro 3 for an all-time low of $749 ($150 off) at Amazon, Walmart, and REI. The high-end fitness watch offers battery life that lasts up to 90 days with solar charging, along with a built-in LED flashlight and multi-band GPS with SatIQ, which helps you stay on course during your trail runs. It also features TopoActive maps, adaptive training, recovery insight, and even rucking and ski profiles.\n\nGarmin inReach Mini 2\nGarmin’s palm-sized inReach Mini 2 satellite communicator offers off-the-grid two-way messaging, built-in navigation capabilities, and powerful mapping features, including the ability to set waypoints when paired with Garmin’s Explore app. A subscription plan is required to access the Iridium network, though, with prices starting at $7.99 a month.\n\nWhere to Buy: $399.99 $249.99 at Amazon $399.99 $249.99 at REI $399.99 $249.99 at Garmin\n\nThe Garmin inReach Messenger Plus, a satellite communicator that provides peace of mind when you’re beyond cell towers, has fallen to an all-time low of $349 ($150 off) at Amazon, Walmart, and REI. It can connect to the Iridium satellite network for global SOS, location sharing, and photo and voice messaging, so you can send a visual marker to a loved one. The richer context makes the Messenger Plus a nice upgrade over the Mini 2’s text-only approach, so long as you’re willing to pay the premium subscription fee.\n\n\n\nIf you like your holiday music, then consider the JBL Flip 7, which has returned to its all-time low of $109.95 ($40 off) at Amazon, Best Buy, and REI. The portable Bluetooth speaker features several notable upgrades over its&nbsp;predecessor, including a more rugged design, an enhanced tweeter, and an additional two hours of playtime. It also features JBL’s AI Sound Boost technology, which can boost the speaker’s volume without introducing distortion. An IP68 rating, meanwhile, means you can enjoy using the Flip 7 by the pool, while a PushLock system lets you attach interchangeable accessories like the included wrist strap.\n\n\n\nThe rugged JBL Charge 6 is currently down to an all-time low of $129.99 ($70 off) in multiple colors at Amazon, Best Buy, and REI. Introduced earlier this year, the portable Bluetooth speaker has an upgraded woofer and up to 28 hours of battery life with JBL’s Playtime Boost feature enabled. Like the Flip 7, the Charge 6 features an IP68 rating and a removable strap, making it easier to transport. It even supports lossless audio through compatible music streaming services, including Apple Music&nbsp;and Spotify, so long as you connect your phone or laptop to the speaker via USB-C.\n\nEcoFlow River 3 Plus Portable Power Station\nThe River 3 Plus is a relatively compact but mighty portable power station with an output of up to 600W. It weighs 10 pounds, features app support, and can double as an uninterruptible power supply in emergencies.\n\nWhere to Buy: $299 $178.99 at REI $299 $269 at Amazon $299 $269 at EcoFlow\n\nWith the holiday travel season coming up, chances are you’ll be away from a charger for an extended period of time. Thankfully, EcoFlow’s versatile Rapid Magnetic Power Bank is down to an all-time low of $68.99 ($51 off) at REI through December 2nd. The 10,000mAh Qi2 battery can snap to the back of your device if you’re using a newer iPhone or select Android devices, thus supplying it with up to 15W of power. It also includes a built-in USB-C cable that can provide up to 65W of power to larger devices, including a 13-inch MacBook Air.\n\n\n\nIf you own an older iPhone with a Lightning port, you can grab&nbsp;InfinityLab’s InstantGo 10,000 Power Bank&nbsp;for just $41.93 (about $20 off) at&nbsp;REI. The portable battery features a 10,000mAh capacity and a built-in Lightning cable, making it a solid all-in-one option for days when you won’t be near an outlet. It also supports passthrough charging, allowing you to charge your phone and the power bank simultaneously.\n\nSea to Summit Hanging Toiletry Bag\nSea to Summit’s small toiletry bag lets you keep all of your essentials close at hand for weekend getaways. It features a water–resistant fabric and a convenient hanging hook, along with internal mesh pockets so you can quickly find whatever it is you need.\n\nWhere to Buy: $49.95 $37.39 at REI $49.95 $37.46 at Amazon $49.95 at Sea to SummitKelty Low Loveseat\nThe Kelty Low Loveseat is a sturdy, low-profile camp chair built for two. It features a steel frame, a padded seat, and extra-large cup holders for your drinks or gear. It also includes a padded roll-tote storage bag, making it easy to transport when it’s folded down.\n\nWhere to Buy: $129.95 $97.39 at REI $129.95 $97.46 at Backcountry\n\nThe&nbsp;JetBoil Stash Cooking System&nbsp;is a compact, lightweight cooking system that’s currently down to $123.69 (about $41 off) at&nbsp;REI, which is one of the lowest prices we’ve seen all year. It features a standalone stove with a titanium burner and a 0.8-liter cooking pot, allowing you to boil water or heat food at your campsite. The pot comes with a lid and a pour handle, too, and everything can be stowed inside the pot when you’re finished, making it exceptionally easy to pack up.\n\n\n\nA small, compact chair is nice to have for lounging around a campfire. REI’s Flexlite Camp Chair&nbsp;is a great option now that it’s down to&nbsp;$55.89 (about $24 off) at&nbsp;REI. It features an aluminum frame, a stable four-leg design, and a ripstop polyester seat with water and stain resistance. When you’re done, it can also quickly fold down into a drawstring bag, so you can throw it in your car or tent.\n\n\n\nThe Yeti Rambler is available for its lowest price of the year from REI, Amazon, and Yeti, where you can grab it for just $30.40 (about $8 off). The 20-ounce water bottle is made of kitchen-grade stainless steel and features double-wall vacuum insulation, ensuring your beverage stays hot or cold for hours. It also features a press-in straw lid that’s leak-resistant, while its tapered design ensures it can fit most cupholders, making it a great companion for road trips.\n\nYeti Roadie 15 cooler\nYeti’s Roadie 15 features a 15-quart capacity, which is enough to fit 22 cans or 16 pounds of ice. The spacious cooler features a durable design, latches that are easy to lock / unlock with one hand, and convenient tie-down slots to attach it to a boat, trailer, or truck bed.\n\nWhere to Buy: $200 $159.99 at REI $200 $160 at Yeti $200 at AmazonMpowerd Luci Solar String Lights: Color\nMpowerd’s solar-powered string lights are perfect for camping or a backyard shindig. The 18-foot string can display six colors and last up to 15 hours on a single charge; the case also doubles as a charger, allowing you to top off your phone in a pinch.\n\nWhere to Buy: $54.95 $32.93 at REI $54.95 $32.97 at Amazon\n\nIt’s that time of year when the sun rises late and sets early, so chances are you’ll be on the trail when it’s dark. If that’s the case, you’re going to need a headlamp. Luckily, the&nbsp;Black Diamond Spot 400 Headlamp is down to around $41.19 (about $13 off) at&nbsp;REI and Backcountry. The headlamp is a great, basic option that features a max output of 400 lumens, a red LED light, and an IPX8 rating, making it safe to use in the rain. It also features an integrated battery meter, which shows the percentage of power remaining, so you know when to replace the batteries before they run out at an inopportune time.\n\n\n\nThe&nbsp;Exped MegaMat Duo Sleeping Pad&nbsp;provides comfort at your campsite or in your car, and currently, you can purchase it for as low as $277.39 (up to $130 off) at REI. The 4-inch, self-inflating mattress features an open-cell polyurethane foam and generous padding, so you won’t “bottom out” while sleeping. A side handle makes it easy to move around, and two deflate valves allow you to quickly deflate the sleeping pad. It also makes for a nice air mattress at home, so guests don’t have to sleep on the floor.\n\n\n\nThe&nbsp;Therm-a-Rest Z Lite Sol Sleeping Pad&nbsp;is a lighter, more compact option that features an accordion-style design, allowing you to attach it to your backpack. Right now, you can get it for as low as $37.39 (about $13 off) at REI. The closed-cell foam provides comfort after a long day of hiking, while the sleeping pad’s surface helps reflect radiant heat back to your body, so you can stay warm in the cool fall weather.\n\nDJI Osmo 360\nDJI’s Osmo 360 is the company’s first 360-degree action camera. The compact camera features strong stabilization, so footage doesn’t come out shaky, and it can record at 8K/30fps for up to 100 minutes on a full charge.\n\nWhere to Buy: $549.99 $410 at Amazon $549.99 $412.49 at REI $549.99 $412.49 at B&amp;H Photo\n\nREI’s Magma 30 Down Trail Quilt&nbsp;will keep you warm when temperatures drop, and it’s now available for $230.29 (about $99 off) at&nbsp;REI. It can be used flat or cinched into a footbox, and it features cords to securely connect to a sleeping pad. The quilt comes with water-resistant, 850-fill goose down, along with insulated draft tubes that help prevent heat loss. With temperatures currently dropping across the US, you’ll need all the warmth you can get.\n\n\n\nThe Leatherman Wingman is a versatile multitool that’s great for everyday odd jobs. Right now, you can snag it for $55.89 (about $14 off) at REI. It offers spring-loaded pliers for one-handed use, an outside-accessible locking blade, and scissors for quick cuts. Additionally, it features Phillips and flathead screwdrivers, a file, a package opener, and a bottle / can opener. Its compact size makes it easy to slide into your pocket, too, making small fixes — like campsite repairs — quick and easy.\n",
      "content_length": 12374,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Possessor(s) is a fast-paced action game that gets off to a slow start",
      "link": "https://www.theverge.com/games/821117/possessors-review-pc-ps5",
      "published": "2025-11-15T16:00:00",
      "content": "\n\n\n\t\n\t\t\n\nI remember being blown away by the 2024 reveal trailer for Possessor(s), the new game from Hyper Light Drifter developer Heart Machine. The trailer features a striking art design, where an animated 2D character explores and fights in side-scrolling environments with gorgeous 3D backgrounds, and it's all set to moody, powerful music. The final game, which came out this month, wasn't quite as awe-inspiring as that initial trailer made it seem, and I almost quit it - but I'm really glad I saw it to the end.\nIn Possessor(s), you play as Luca, a girl who is possessed by Rehm, a demon from another realm. After a catastrophe strikes, Rehm saves Lu …\nRead the full story at The Verge.",
      "content_length": 693,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "How to find music you will love without the algorithm",
      "link": "https://www.theverge.com/report/821614/discover-music-without-algorithms",
      "published": "2025-11-15T15:00:00",
      "content": "\n\n\n\t\n\tOh, how I want to break free.\t\n\nWhile there is plenty of criticism to be hurled at what music the algorithm serves to us, and how, the real problem with music discovery in the age of algorithmic recommendations is that listening has become a passive activity. It's too easy to press play and let a pile of code take the wheel. Whether that's creating a \"station\" based on a particular song or artist, firing up Discover Weekly, or just letting Apple Music autoplay into infinity after a particular album or song ends. \nWith less involvement from the listener, less intentionality, it's easy for music to simply become background noise. Research suggests that younger generations a …\nRead the full story at The Verge.",
      "content_length": 722,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Framework’s franken-laptop is back with big chip upgrades and familiar frustrations",
      "link": "https://www.theverge.com/tech/821420/framework-laptop-16-2025-nvidia-rtx5070-review",
      "published": "2025-11-15T14:00:00",
      "content": "\n\n\n\t\n\tThe new Laptop 16 is a lot like the original on the outside, though here it’s shown with a prototype 3D-printed trackpad surround that’s a single piece.\t\n\nFramework did it again. It promised modular, upgradeable, and user-repairable laptops where other manufacturers dare not venture or have outright failed. And it's delivered. \nThe 2025 version of the Framework Laptop 16 comes with not only new AMD Ryzen AI CPU options, but also Wi-Fi 7, a more powerful USB-C charger, redesigned cooling, and a new webcam - all of which are also sold separately, so existing owners can upgrade. But the biggest bump by far is a more powerful user-replaceable graphics card. The modular, removable GPU is what separates the Laptop 16 from any other laptop on the market. When it announced the Laptop 16, Framework ca …\nRead the full story at The Verge.",
      "content_length": 845,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "The Steam Machine feels like the TV gaming PC I’ve always wanted",
      "link": "https://www.theverge.com/games/818606/valve-steam-machine-tv-gaming-pc-wanted",
      "published": "2025-11-15T13:00:00",
      "content": "\n\n\n\t\n\t\t\n\nThe morning of Monday, October 27th, I started my workweek by asking my colleagues at The Verge for advice on buying a gaming PC. I wanted a small, portable, and semi-powerful machine that could easily sit beneath my living room TV and occasionally move over to my desk to play games or even use for work. My dream was to find something as easy to use as the Steam Deck, which has become my primary gaming device due to its simplicity and massive catalog of PC games.\nJust two days later, I walked into Valve's headquarters and was introduced to the new Steam Machine, a gaming PC and console hybrid. It checked basically every box I was looking fo …\nRead the full story at The Verge.",
      "content_length": 693,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Pluribus’ third episode throws a bomb into things",
      "link": "https://www.theverge.com/entertainment/820523/pluribus-episode-3-discussion",
      "published": "2025-11-15T13:00:00",
      "content": "\n\n\n\t\n\t\t\n\nIf you weren't clear on just what a miserable person Carol (Rhea Seehorn) is, episode 3 of Pluribus sure makes it obvious. It opens with a flashback, as Carol and her partner Helen (Miriam Shor) are on a dream vacation at an ice hotel in Norway, and all she can do is complain about how cold it is. When Carol sees a stunning aurora borealis, her only thought is \"it looks like a screensaver.\" But that cynicism might also be her superpower as she prepares to solve the hive-mind apocalypse that has descended on Earth.\nWelcome! The two-episode premiere of Pluribus, the new Apple TV show from Breaking Bad creator Vince Gilligan, introduced a stra …\nRead the full story at The Verge.",
      "content_length": 693,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "YouTube TV, ESPN, and Disney: the latest on the blackout that’s now over",
      "link": "https://www.theverge.com/news/817403/youtube-tv-disney-espn-blackout-updates",
      "published": "2025-11-15T01:19:23",
      "content": "\n\n\n\t\n\t\t\n\nDisney and YouTube have reached an agreement to bring back ESPN and more than 20 other Disney-owned channels two weeks after they went dark on YouTube TV.\n\nDuring the dispute, Google has accused Disney of trying to raise prices for its customers in an effort to boost its own Hulu + Live TV and Fubo offerings, while Disney claimed that Google was being unreasonable and seeking preferential treatment and below-market rates. \n\nGoogle even gave YouTube TV customers a $20 credit for the inconvenience while the dispute was going on. And days before the deal was done, CEOs Bob Iger and Sundar Pichai reportedly got more involved in the negotiations. FCC Chairman Brendan Carr also urged the companies to “get it done!”\n\nThe situation was quite different from the 2021 carriage blackout between the two companies, which was resolved within a couple of days.\n\nRead on below for all of our news and updates about Google and Disney&#8217;s battle.\n\n\t\t\t\t\t\n\t\t\t\tDisney and ESPN are back on YouTube TV\n\t\t\t\n\t\t\t\t\t\n\t\t\t\tDisney is &#8220;trying really hard&#8221; to get ESPN back on YouTube TV.\n\t\t\t\n\t\t\t\t\t\n\t\t\t\tBob Iger and Sundar Pichai reportedly join the ESPN / YouTube TV dispute.\n\t\t\t\n\t\t\t\t\t\n\t\t\t\tDisney is losing over $4 million a day in revenue on the YouTube TV blackout\n\t\t\t\n\t\t\t\t\t\n\t\t\t\tDisney CEO Bob Iger is going on the ManningCast, which airs on ESPN2.\n\t\t\t\n\t\t\t\t\t\n\t\t\t\tGoogle is issuing a $20 credit to YouTube TV subscribers.\n\t\t\t\n\t\t\t\t\t\n\t\t\t\tFilms from YouTube and Google Play are no longer available on Movies Anywhere\n\t\t\t\n\t\t\t\t\t\n\t\t\t\tNo Monday Night Football, no Election Night ABC News for YouTube TV.\n\t\t\t\n\t\t\t\t\t\n\t\t\t\tESPN, ABC, and other Disney channels go dark on YouTube TV\n\t\t\t\n\t\t\t\t\t\n\t\t\t\tDisney is suing YouTube for poaching a key media and sports executive\n\t\t\t\n\t\t\t",
      "content_length": 1766,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Disney and ESPN are back on YouTube TV",
      "link": "https://www.theverge.com/news/821581/disney-youtube-tv-deal-agreement-espn",
      "published": "2025-11-15T01:10:19",
      "content": "\n\n\n\t\n\t\t\n\nESPN and other Disney-owned channels will be returning to YouTube TV following a new agreement announced Friday. More than 20 channels went dark on YouTube TV on October 30th, but two weeks later — and after CEOs Bob Iger and Sundar Pichai reportedly got more involved in negotiations — the companies have reached a deal.\n\n“Key elements” of the deal include, according to Disney:\n\n\nCarriage of Disney’s full linear portfolio including all the ESPN networks, ABC, the Disney-branded channels, Freeform, the FX Networks, and the National Geographic channels\n\n\n\nESPN’s new direct-to-consumer service (Unlimited Plan) to be made available at no additional cost to YouTube TV subscribers\n\n\n\nAccess to a selection of live and on-demand programming from ESPN Unlimited inside YouTube TV\n\n\n\nSelect networks to be included in various genre-specific packages\n\n\n\nThe ability to include the Disney+, Hulu Bundle as part of select YouTube offerings\n\n\n“We’re happy to share that we’ve reached an agreement with Disney that preserves the value of our service for our subscribers and future flexibility in our offers,” YouTube says. “Subscribers should see channels including ABC, ESPN and FX returning to their service over the course of the day, as well as any recordings that were previously in their Library. We apologize for the disruption and appreciate our subscribers’ patience as we negotiated on their behalf.”\n\n“This new agreement reflects our continued commitment to delivering exceptional entertainment and evolving with how audiences choose to watch,’’ Disney Entertainment co-chairmen Alan Bergman and Dana Walden and ESPN chairman Jimmy Pitaro said in a statement. “It recognizes the tremendous value of Disney’s programming and provides YouTube TV subscribers with more flexibility and choice. We are pleased that our networks have been restored in time for fans to enjoy the many great programming options this weekend, including college football.”\n\nUpdate, November 14th: Added details from Disney’s press release.",
      "content_length": 2026,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "The best early Black Friday deals we’ve found so far on laptops, TVs, and more",
      "link": "https://www.theverge.com/tech/814345/black-friday-best-early-deals-2025",
      "published": "2025-11-14T22:02:20",
      "content": "\n\n\n\t\n\tThe Amazon TV Stick 4K is down to $34.99 — its lowest price to date — for a limited time. | Photo: Antonio G. Di Benedetto / The Verge\t\n\nBlack Friday is the most anticipated day of the year for bargain hunters. While there’s still some time to go before November 28th, we’re already starting to see a healthy selection of early discounts, allowing you to get a jump on your holiday shopping. Right now, for instance, Bose’s QuietComfort Ultra Earbuds are on sale for $50 off, while Apple’s latest 13-inch MacBook Air — our pick for the best laptop — is down to an all-time low of $749.99.\n\nHowever, that’s just a taste of what’s to come in November. As the month goes on, we’re expecting to see even more deals — including sizable drops on robovacs, TVs, and headphones. In fact, retailers like Walmart, Best Buy, and Target have already shared when we can expect their latest sales. We’ll be updating this guide over the next couple of weeks, too, so be sure to check back as we approach the main event.\n\n\n\n\n\n\n\n\nHeadphone and earbud dealsCharger and cable dealsSmartwatch and fitness tracker dealsTablet and e-reader dealsTV and streaming dealsSmart home dealsSoundbar and speaker dealsMiscellaneous deals \n\n\nHeadphone and earbud deals\nBose QuietComfort Ultra Headphones\nBose’s last-gen flagship headphones are a replacement for the Noise Cancelling Headphones 700 that offer a more travel-friendly design, spatial audio, better call quality, excellent comfort, and some of the best noise cancellation around. Read our review.\n\nWhere to Buy: $429 $299 at Amazon $429 $299.99 at Best Buy $429 $299 at BoseSony WH-1000XM6\nSony’s latest pair of flagship headphones feature improved comfort, better noise cancellation, and the ability to charge while in use. They even fold down for travel, which can’t be said about the last-gen XM5. Read our initial impressions.\n\nWhere to Buy: $449.99 $428 at Amazon $449.99 $428 at Best Buy $449.99 $429.99 at Target\n\nBose’s Ultra Open Earbuds are the brand’s boldest, most unique earbuds — and you can pick them up at Amazon, Walmart, and Best Buy for $199 ($100 off), their lowest price to date. Instead of sitting in your ear canal, the earbuds cling to your outer ear like a piece of jewelry. That design means you’ll always hear external noise, which isn’t ideal if you want to block out noisy coworkers; however, it’s great if you need to remain aware of your surroundings, such as when walking or riding a bike. Read our review.\n\n\n\nEarFun is offering up to 65 percent off its already affordable headphones, earbuds, and speakers. The EarFun Free Pro 3, a great pair of cheap wireless earbuds, are currently down to just $27.99 ($52 off) at Earfun’s online storefront with coupon code PDFP3. The wireless earbuds feature ANC, wireless charging, and over seven hours of continuous playback on a single charge. The EarFun Tune Pro, meanwhile, are on sale for $52.49 ($17.50 off) with code PDTP. The over-ear headphones feature noise-canceling tech and support for multipoint Bluetooth connectivity, so you can connect to two devices simultaneously.\n\nBose QuietComfort Ultra Earbuds (second-gen)\nThe second-gen QuietComfort Ultra Earbuds have dynamic, rich sound and the best noise cancellation available in true wireless earbuds. They’re a terrific pick if earbuds you want to listen to your music in peace. Read our review.\n\nWhere to Buy: $299 $249 at Amazon $299 $249 at Best Buy $299 $249.99 at Target\n\nYou can pick up the cream-colored Beats Solo Buds at Walmart for $39 ($40 off), an all-time low. The platform-agnostic earbuds feature gummy tips, offer up to 18 hours of playback per charge, and support both Apple’s Find My and Android’s Find My Device feature, which lets you locate them more easily should you lose them. They don’t have active noise cancellation, but that’s unsurprising at this price. Read our hands-on impressions.\n\n\n\nAmazon, Best Buy, and Target have all marked the AirPods 4 down to $84.99 ($84 off), which is easily their best price to date. Apple’s latest non-Pro AirPods sound great despite their open-style build, support voice isolation for clearer-sounding calls, and have a streamlined setup process and multipoint pairing with Apple devices. You can also get the version with active noise cancellation on sale for around $148.99 ($29 off) at Amazon, Best Buy, and Target. Read our review.\n\nAirPods Pro (second-gen with USB-C)\nThe second-gen AirPods Pro improve upon Apple’s original pair with much better noise cancellation, sound quality, and onboard volume controls. The latest refresh also ships with a USB-C charging case, as opposed to Lightning. Read our review.\n\nWhere to Buy: $249.99 $139 at Walmart\nCharger and cable deals\nAnker MagGo Wireless Charging Station (3-in-1, Dock Stand)\nAnker’s MagGo Wireless Charging Station features a MagSafe charging stand, a Qi wireless charging pad, and an Apple Watch charger, allowing you to charge three devices simultaneously. It also comes with a 40W USB-C power adapter and cable.\n\nWhere to Buy: $89.99 $79.99 at Amazon (with Prime) $89.99 $85.99 at Anker (with code WSPDV2HZU2ZN)\n\nAnker’s 10,000mAh Power Bank, a solid 30W battery pack, is currently on sale for $31.99 ($13 off) at Amazon and Anker’s online storefront (with promo code WS7DV2FNXH3L). The power bank has nearly enough juice to top off an iPhone 15 Pro twice, and it can charge two devices simultaneously using its built-in cable and USB-C port. It’s also a power adapter that can plug directly into an outlet.\n\n\nSmartwatch and fitness tracker deals\nGoogle Pixel Watch 3 (45mm, Wi-Fi)\nGoogle’s last-gen smartwatch features a large screen, a battery that lasts up to 24 hours, and sensors for measuring your blood oxygen levels and taking an EKG. The wearable also offers a host of useful Google integrations and can provide you with custom running workouts. Read our review.\n\nWhere to Buy: $299.99 $199.99 at Amazon $299.99 $199.99 at Walmart\n\nThe Venu X1, one of Garmin’s more premium smartwatches, is available from Amazon and Garmin for a new low of $599.99 ($200 off). The X1 features a 2-inch OLED display and Garmin’s thinnest case yet. It can also track your activity, heart rate, blood oxygen level, and sleep (including naps). It’ll provide you with a morning report based on recorded health metrics, and it offers stress tracking and guided meditations. It can even track over 100 activities and create a running or strength training regimen via Garmin Coach.\n\n\n\nGarmin’s midrange Vivoactive 6 is on sale for $249.99 ($50 off) — its best price to date — at Amazon, Best Buy, and REI. The watch features a circular 1.2-inch OLED screen, a battery that can last up to 11 hours per charge, and Bluetooth support. It can also track your activity, blood oxygen level, sleep, and heart rate, as well as generate fitness plans using the built-in Garmin Coach.\n\nGarmin Fenix 8\nThe Garmin Fenix 8 adds smart features like the ability to take calls on the wrist, and an on-board voice assistant.\n\nWhere to Buy: $999.99 $749.99 at Garmin $1000 $749.99 at REI $999.99 $749.99 at AmazonGarmin Forerunner 265 (42mm)\nGarmin’s midrange Forerunner watch adds an OLED display, a week’s worth of battery life, and dual-frequency GPS for better accuracy. Read our review.\n\nWhere to Buy: $449.99 $299.99 at Amazon (42mm) $449.99 $299.99 at Amazon (46mm) $449.99 $299.99 at Best Buy (42mm)\n\nThe Apple Watch Ultra 3, Apple’s latest premium smartwatch, is currently on sale at Amazon in select configurations for $699.99 ($99 off), which remains its lowest price to date. The newer wearable features a 49mm OLED screen and thinner bezels than prior models, along with a battery that can reasonably last between 60–70 hours on a single charge. It also supports both 5G and satellite connectivity, allowing you to stay connected even when off the grid or in emergency situations. Read our review.\n\n\n\nThe Apple Watch Series 10 has the same wide-angle OLED screen, the same chip, and the same health sensors as the Series 11; however, unlike Apple’s latest smartwatch, the Series 10 is on sale at Walmart in its 42mm base configuration for $249 ($150 off), or at Amazon and Walmart in the larger 46mm variant for $279 ($150 off). The battery life is slightly less than that of the Series 11, and you lose out on the option for 5G connectivity, but we reckon those are pretty minor compromises for most people. Read our review.\n\n\n\nThe&nbsp;46mm OnePlus Watch 3&nbsp;is available via OnePlus for $299.99 ($50 off) — one of its best prices to date — through November 19th when you use code&nbsp;EARLYBF. The newer wearable retains everything&nbsp;we loved about its predecessor, including dual-frequency GPS and long battery life, but improves the experience with a rotating crown that scrolls and up to 120 hours of battery life. It can also provide a quick snapshot of your heart rate, blood oxygen levels, sleep quality, and more. Read our hands-on impressions.\n\nApple Watch SE 3\nThe Apple Watch SE 3 offers some big upgrades over its predecessor, including an always-on display, allowing you to glance at the time or unread notifications. It also has Apple’s powerful S10 chip, which enables on-device Siri requests. Read our review.\n\nWhere to Buy: $249 $199.99 at Amazon (40mm, GPS) $279 $229.99 at Amazon (44mm, GPS) $249 $199.99 at Costco (40mm, GPS)Garmin Venu 3S\nThe Venu 3S remains our favorite Garmin smartwatch. It’s a comfortable wearable with up to 10 days of battery life and a vibrant 1.2-inch OLED display, not to mention solid sleep tracking, Atrial Fibrillation detection, and a built-in EKG reader. Read our review.\n\nWhere to Buy: $449.99 $349.99 at Amazon $449.99 $349.99 at Best Buy $449.99 $349.99 at REI\nTablet and e-reader deals\n11-inch iPad Pro (M5, 2025)\nApple’s newest iPad Pros have an M5 processor, an N1 chip, and a C1X chip for cellular versions. They’re faster, support Wi-Fi 7, charge more quickly, and start with 12GB of RAM. Read our review.\n\nWhere to Buy: $999 $933 at Amazon (256GB, Wi-Fi) $1199 $1149 at Amazon (512GB, Wi-Fi) $1599 $1549 at Amazon (1TB, Wi-Fi)\n\nThe latest Amazon Fire HD 10 Kids tablet is matching its all-time low of $104.99 ($85 off) at Amazon, Target, and Best Buy. The tablet features a 10.1-inch 1080p display, a kid-proof case, and up to 13 hours of battery life. It also comes with 32GB of storage for loading up apps and other content, along with robust parental controls and a two-year warranty. It also comes with a year of Amazon Kids Plus, which features access to ad-free, age-appropriate content, including books, movies, apps, and more.\n\n\n\nIf you’re looking for something more compact, the latest Amazon Fire 7 Kids is currently available at Target, Best Buy, and Amazon, for $49.99 ($60 off), which matches its lowest price to date. The basic tablet offers many of the same features and services found in the larger 10.1-inch model — including an extended two-year warranty, extensive parental controls, and a year of Amazon Kids Plus — but the base Fire 7 Kids comes with 16GB of storage and features a smaller 7-inch display. The device also offers up to 10 hours of battery life, providing plenty of fun while on the road.\n\n\nTV and streaming deals\nSony Bravia 8 II\nThe Bravia 8 II was chosen as the “king of TV” by a panel of judges (including The Verge’s own Nilay Patel) in Value Electronics’ 2025 shootout. The OLED TV has excellent color accuracy, a bright panel, and a 120Hz refresh rate.\n\nWhere to Buy: $2999.99 $1998 at Amazon (55-inch) $2999.99 $1998 at B&amp;H Photo (55-inch) $3499.99 $2298 at Amazon (65-inch)\n\nLG’s 55-inch C5 OLED is down to around $1,196.99 ($804 off) at Amazon, Best Buy, and LG’s online storefront. The midrange TV is a good entry point into the world of OLED technology, offering a solid balance in terms of design, brightness, and high-end gaming features, including four HDMI 2.1 ports that support 4K at 144Hz with variable refresh rate tech. The C5 Series also handles glare and ambient light better than the step-down B5 Series; however, OLED panels are still not ideal for really bright rooms.\n\n\n\nHisense’s 65-inch S7N Canvas TV is the company’s answer to Samsung’s popular Frame TV, one you can currently grab for around $977.99 ($320 off) at Amazon, Best Buy, and Walmart. The 4K set has a matte screen that makes the artwork it displays more akin to a real painting, and Hisense includes a wall mount, allowing you to hang it. The S7N features a QLED panel with a 144Hz refresh rate and four HDMI ports (two HDMI 2.1 and two HDMI 2.0), making it suitable for a mix of current and last-gen gaming consoles.\n\nGoogle TV Streamer (4K)\nGoogle&#8217;s terrific TV Streamer (4K) is the company’s best attempt at a streaming device yet, with built-in ethernet, an excellent interface, and smart home compatibility with both Matter and Thread. Read our review.\n\nWhere to Buy: $99.99 $74.99 at Amazon $99.99 $74.99 at Walmart $99.99 at Best Buy\n\nAmazon’s recently rebranded Fire TV Stick 4K Plus is the company’s midrange option, and it’s down to an all-time low of $24.99 ($25 off) at Amazon and Best Buy. The inexpensive streaming device comes with an Alexa Voice Remote that features a built-in microphone, which lets you use Amazon’s virtual assistant to find TV shows and movies, or control compatible smart home accessories using your voice. You can also use it to access Amazon Luna or Xbox Game Pass, allowing you to play games from their respective cloud gaming libraries.\n\n\n\nLG’s 77-inch G5 OLED is an expensive set, but you can currently snag it for around $3,496.99 ($1,003 off) — one of its best prices to date — at Amazon, Best Buy, and LG’s online storefront. The high-end 4K TV delivers better brightness than the aforementioned C5, allowing you to use it in rooms that are exposed to a lot of ambient light. It also features four HDMI 2.1 ports that support 4K at 165Hz with VRR, as well as support for the popular Dolby Vision HDR format.\n\nAmazon Fire TV Stick 4K Max (2023)\nAmazon’s Fire TV Stick 4K Max is noticeably faster than its predecessor, features Wi-Fi 6E, and benefits from twice the storage. It can also showcase widgets and artwork when idle, and continues to offer robust Alexa integration. \n\nWhere to Buy: $59.99 $34.99 at Amazon $59.99 $34.99 at Best Buy $59.99 $34.99 at Target\nSmart home deals\nBlink Video Doorbell (second-generation)\nBlink’s Video Doorbell is the best if you’re looking for a budget-friendly buzzer that offers motion-activated recording and alerts, night vision, two-way audio, and up to two years of battery life.\n\nWhere to Buy: $69.99 $29.99 at Amazon (with Sync Module Core) $59.99 $29.99 at Best Buy (with Sync Module Core)\n\nThe Ring Battery Doorbell and Indoor Cam Bundle is available at Amazon, Target, and Best Buy for $69.99 ($70), matching its best price to date. The bundle includes a Ring Battery Doorbell and an Indoor Cam, making it a great starter kit for renters and new home owners. The Ring Battery Doorbell offers head-to-toe video outside your front door, while the Indoor Cam let’s you keep an eye on an interior space. They’re easy to install, easy to set up, and easy to use.\n\n\n\nThe Yale Assure Lock 2 Touch is on sale for $199.99 ($100 off) at Best Buy. The stylish smart lock works with every major smart-home platform and supports both Bluetooth and Wi-Fi. It also lets you unlock your door in multiple ways, including via fingerprint, touchscreen, the app, and even has an auto-unlocking feature. Read our review.\n\n\n\nEcovacs Deebot X9 Pro Omni\nThe Ecovacs Deebot X9 Pro Omni features an extendable mop that can clean itself, just like its predecessor. However, it also features Ecovacs&#8217; Boosted Large-Airflow Suction Technology, which optimizes the airflow path from intake to exhaust, rather than relying solely on suction power. \n\nWhere to Buy: $1299.99 $699.99 at Amazon (with Prime) $1299.99 $699.99 at Ecovacs $1299.99 $699.99 at Best Buy\n\nThe&nbsp;Eufy X10 Pro Omni,&nbsp;our favorite midrange robot vacuum / mop, has returned to its Prime Day low of $499.99 ($400 off) at&nbsp;Amazon, Best Buy, and Anker’s online storefront (with code WS24T2351). The X10 Pro Omni is particularly great for cleaning up carpets and tiles, thanks to its 8,000Pa of suction power. It also features reliable AI-powered obstacle detection, dual oscillating brushes for mopping up floors, and a dock that handles auto-emptying, washing, and refilling.\n\n\n\nThe&nbsp;Eufy Omni S1 Pro&nbsp;is also matching its all-time low of $799.99 ($700 off) at Amazon and from Anker’s online storefront (with promo code WS24T2080111). The robovac features an 11.4-inch roller mop and dual spinning side brushes, which work in tandem to leave your hardwood floors spotless. Plus, with 8,000Pa of suction power, it’s decent at picking up dirt and debris from carpets; it also features solid AI-powered obstacle avoidance, so you don’t need to worry about it getting stuck in clutter.\n\n\nSoundbar and speaker deals\nSony Bravia Theater Bar 6\nSony’s Bravia Theater Bar 6 is a 3.1.2 audio system, meaning the soundbar comes with a wireless subwoofer and features multiple drivers pointed at you — and upward — for playing Dolby Atmos audio. You can also purchase the soundbar in a bundle with rear speakers if you want a more traditional surround sound setup. \n\nWhere to Buy: $699.99 $498 at Amazon $699.99 $499.99 at Best Buy $699.99 $499.99 at Sony Sony Bravia Theater Bar 8\nSony packed 11 drivers into the Bravia Theater Bar 8, including both side- and upward-firing drivers for a wider soundstage and better Dolby Atmos playback. If you have a Sony TV, the soundbar and its built-in speakers can work together to create an audio system tuned for even clearer-sounding dialogue.\n\nWhere to Buy: $999.99 $798 at Amazon $999.99 $799.99 at Best Buy $999.99 $799.99 at Sony\n\nJBL’s Charge 6 is marked down to an all-time low of $129.95 ($70 off) at Amazon, Best Buy, and Walmart. The powerful Bluetooth speaker carries an IP68 rating, offers up to 28 hours of playback per charge, and uses JBL’s AI Sound Boost tool to prevent distortion at higher volumes. You can also plug your phone into its USB-C port and use it as a battery pack, but JBL says it can’t be used to top off a laptop.\n\n\n\nThe Bose SoundLink Plus is on sale for $229 ($40 off) at Amazon, Best Buy, and Bose’s online storefront, which matches its best price to date. Despite being about the size of a 20-ounce water bottle, it delivers loud, impressive sound with a rugged IP67 build and USB-C charging. It supports multipoint Bluetooth connectivity and, unlike the Micro, doubles as a 15W power bank, with longer battery life that lasts up to 20 hours. Read our review.\n\n\nMiscellaneous deals \n13-inch MacBook Air (M4, 16GB RAM, 256GB SSD)\nPowered by the M4 chip, Apple’s latest 13-inch MacBook Air is faster than its predecessor and offers double the base RAM. It can also connect to two external displays with the lid open, unlike prior models, and features an improved 12-megapixel Center Stage webcam. Read our review.\n\nWhere to Buy: $999 $749.99 at Amazon $999 $899 at B&amp;H Photo $999 at AppleApple AirTags\nApple’s AirTags are unobtrusive, waterproof, and tap into the massive Find My network for out-of-range locating. Read our original review.\n\nWhere to Buy: $29 $18 at Amazon $99 $64.99 at Amazon (four-pack) $29 $18 at Walmart\n\nHeadspace is offering 50 percent off an annual subscription, bringing the price down to $34.99 ($35 off) through December 4th. The discount only applies to your first year; after that, the subscription will renew at full price. Headspace offers access to guided meditations, online therapy, mental health coaching, and more. At a time when the world feels more dire than ever, Headspace can help bring some calm to your daily life.\n\nLego Minecraft The Crafting Table\nLego’s first Minecraft set for adults essentially resembles an in-game crafting table on the outside, but inside, you’ll find a slick little diorama with 12 brick-ified biomes — including a village-laden Plains and Cherry Grove, which features an abandoned mineshaft.\n\nWhere to Buy: $89.99 $71.99 at Walmart $89.99 $71.99 at Target $89.99 at LegoMeta Quest 3S\nThe Meta Quest 3S is a battery-powered standalone VR headset runs the same chipset as the pricier Quest 3, along with the lenses and screen resolution as the Quest 2. It can also be connected to a PC to play VR games like Half-Life Alyx. Read our review.\n\nWhere to Buy: $299 $249 at Best Buy (128GB) $399.99 $329.99 at Best Buy (256GB, with $50 gift card)\nUpdate, November 14th: Adjusted pricing / availability and added several new deals, including those for the JBL Charge 6 and Apple’s second-gen AirPods Pro. Sheena Vasani and Brandt Ranj also contributed to this post.",
      "content_length": 20736,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Konflikt zum Standardmodell der Kosmologie: Das Sonnensystem ist viel zu schnell",
      "link": "https://www.heise.de/news/Konflikt-zum-Standardmodell-der-Kosmologie-Das-Sonnensystem-ist-viel-zu-schnell-11078614.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-14T11:10:00",
      "content": "Präzise Messungen mehrerer Radioteleskope legen überzeugend nahe, dass unser Sonnensystem viel zu schnell für unsere Modelle ist. Eine Erklärung gibt es nicht.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Schuko-Stecker offiziell solartauglich: DIN für Balkonkraftwerke ist fertig",
      "link": "https://www.heise.de/news/Schuko-Stecker-offiziell-solartauglich-DIN-fuer-Balkonkraftwerke-ist-fertig-11078720.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-14T11:09:00",
      "content": "Die Produktnorm für Balkonkraftwerke ist veröffentlicht – der Schuko-Stecker hat es in die Norm geschafft. Gute Argumente in Diskussionen mit Hausverwaltungen.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Idealo vs. Google: Suchmaschine zu 465 Millionen Euro Schadenersatz verurteilt",
      "link": "https://www.heise.de/news/Idealo-Prozess-Google-zu-465-Millionen-Euro-Schadenersatz-verurteilt-11078424.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-14T09:35:00",
      "content": "Der Preisvergleichsanbieter Idealo hat vor Gericht gegen Google gesiegt. Der Schadenersatz ist beträchtlich, aber auch beträchtlich kleiner als gefordert.",
      "content_length": 154,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Nexperia-Krise: Neue Warnung vor Produktionsstopps, ungewöhnliche Gegenmaßnahmen",
      "link": "https://www.heise.de/news/Nexperia-Krise-Neue-Warnung-vor-Produktionsstopps-ungewoehnliche-Gegenmassnahmen-11078439.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-14T09:02:00",
      "content": "Die Krise um den Chiphersteller Nexperia ist wohl noch nicht beendet und in der Industrie gibt es ungewöhnliche Versuche, Engpässe beim Nachschub zu verhindern.",
      "content_length": 160,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Fortinet: Neuer Exploit missbraucht Zero-Day-Lücke in Firewalls",
      "link": "https://www.heise.de/news/Fortinet-Neuer-Exploit-missbraucht-Zero-Day-Luecke-in-Firewalls-11078310.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-14T07:35:00",
      "content": "IT-Forscher haben neuen Exploit-Code in ihrem Honeypot gefunden. Der attackiert eine bislang unbekannte Fortinet-Sicherheitslücke.",
      "content_length": 130,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "China holt gestrandete Raumfahrer aus dem All zurück",
      "link": "https://www.heise.de/news/China-holt-gestrandete-Raumfahrer-aus-dem-All-zurueck-11078306.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-14T07:04:00",
      "content": "Drei chinesische Astronauten sitzen nach einem Vorfall mit vermutlich Weltraumschrott im All fest. Die Bodenkontrolle will sie am Freitag zurückholen.",
      "content_length": 150,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Für Kontakt zu Weltraumsonden: NASA-Riesenantenne seit Monaten ausgefallen",
      "link": "https://www.heise.de/news/Fuer-Kontakt-zu-Weltraumsonden-NASA-Riesenantenne-seit-Monaten-ausgefallen-11078249.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-14T06:19:00",
      "content": "Über das Deep Space Network kommuniziert die NASA mit Weltraumsonden und Rovern. Schon seit September ist eine der drei größten Antennen aber außer Betrieb.",
      "content_length": 156,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Ubisoft: Geschäftszahlen verzögert, Aktienhandel ausgesetzt",
      "link": "https://www.heise.de/news/Ubisoft-Geschaeftszahlen-verzoegert-Aktienhandel-ausgesetzt-11078217.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-14T05:18:00",
      "content": "Ubisoft hat seine aktuellen Geschäftszahlen nicht wie geplant am Donnerstag veröffentlicht – man brauche mehr Zeit. Der Börsenhandel wurde vorerst eingestellt.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Kritische Infrastruktur: Bundestag verabschiedet NIS2-Gesetz",
      "link": "https://www.heise.de/news/Kritische-Infrastruktur-Bundestag-verabschiedet-NIS2-Gesetz-11077959.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-13T18:11:00",
      "content": "Deutschland hängt mit der NIS2-Umsetzung hinterher. Der Bundestag hat den Vorschlag der Regierung nun abgesegnet. Jetzt ist der Bundesrat am Zug.",
      "content_length": 145,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Idealo-Verfahren: Richter sehen Schaden durch Google",
      "link": "https://www.heise.de/news/Idealo-Verfahren-Richter-sehen-Schaden-durch-Google-11077896.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-13T17:17:00",
      "content": "Im Verfahren des Preisvergleichsdienstes Idealo gegen den US-Suchmaschinenriesen scheint eine Verurteilung Googles zu Schadenersatz wahrscheinlich.",
      "content_length": 147,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Operation Endgame 3: 1025 Server von Netz genommen",
      "link": "https://www.heise.de/news/Operation-Endgame-3-1025-Server-von-Netz-genommen-11077049.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-13T12:17:00",
      "content": "Internationalen Strafverfolgern ist ein neuerlicher Schlag gegen Malware und dahinterliegende Infrastruktur gelungen.",
      "content_length": 117,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Analyse: Weltweiter CO₂-Ausstoß steigt trotz aller Fortschritte auch 2025",
      "link": "https://www.heise.de/news/Analyse-Weltweiter-CO-Ausstoss-steigt-trotz-aller-Fortschritte-auch-2025-11077011.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-13T11:20:00",
      "content": "Dass es der Menschheit noch gelingt, die Klimaerwärmung auf weniger als 1,5 Grad Celsius über dem vorindustriellen Niveau zu halten, \"ist nicht mehr plausibel\".",
      "content_length": 160,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Ruhe, bitte! Wärmepumpen müssen ab 2026 deutlich leiser werden",
      "link": "https://www.heise.de/news/Ruhe-bitte-Waermepumpen-muessen-ab-2026-deutlich-leiser-werden-11076858.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-13T09:55:00",
      "content": "Ab 1. Januar 2026 gelten strengere Fördervorschriften für Wärmepumpen. Die Geräte müssen dann 10 dB leiser sein als nach EU-Vorgabe, 5 dB leiser als bisher.",
      "content_length": 156,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Meta verdient Milliarden mit betrügerischer Werbung",
      "link": "https://www.heise.de/news/Meta-verdient-Milliarden-mit-betruegerischer-Werbung-11076561.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-13T08:59:00",
      "content": "Wir sehen dubiose Anzeigen, Zuckerberg wird reich: So lautet offenbar ein Teil des Geschäfts. Scam bringt Meta Milliarden ein.",
      "content_length": 126,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Angriffe auf Watchguard Firebox und Gladinet Triofox beobachtet",
      "link": "https://www.heise.de/news/Angriffe-auf-Watchguard-Firebox-und-Gladinet-Triofox-beobachtet-11076496.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-13T07:46:00",
      "content": "Die US-IT-Sicherheitsbehörde CISA warnt vor laufenden Angriffen auf Schwachstellen in Watchguards Firebox und Gladinets Triofox. ",
      "content_length": 129,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Donnerstag: Google gegen Phishing-Kartell, Prüfung auf DSA-Verstöße bei X",
      "link": "https://www.heise.de/news/Donnerstag-Google-gegen-Phishing-Kartell-Pruefung-auf-DSA-Verstoesse-bei-X-11076395.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-13T05:15:00",
      "content": "Online-Betrug als Geschäftsmodell + Widerspruchsrecht bei Löschanträgen + EU-Parlamentarier gegen KI-Kündigungen + Steam Frame VR-Headset ohne PC + #heiseshow",
      "content_length": 158,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Astronomie: Erstmals initiale Geometrie einer Supernova ergründet",
      "link": "https://www.heise.de/news/Astronomie-Erstmals-initiale-Geometrie-einer-Supernova-ergruendet-11075229.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-12T19:00:00",
      "content": "Wenn ein Stern explodiert, expandiert er mit großer Geschwindigkeit. Wie eine Supernova direkt nach ihrem Beginn aussieht, war deshalb unbekannt – bis jetzt.",
      "content_length": 157,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Linux-Konsole: Valve kündigt neue Steam Machine an",
      "link": "https://www.heise.de/news/Linux-Konsole-Valve-kuendigt-neue-Steam-Machine-an-11076221.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-12T18:34:00",
      "content": "Ein Jahrzehnt nach dem Scheitern der Steam Machines wagt Valve einen neuen Versuch: Die neue Steam-Machine ist ein Würfel mit SteamOS. ",
      "content_length": 135,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Studie: DMA bringt Nutzern keine günstigeren App-Preise",
      "link": "https://www.heise.de/news/Studie-DMA-bringt-Nutzern-keine-guenstigeren-App-Preise-11075918.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-12T16:00:00",
      "content": "Die Vorschriften des Digital Markets Act (DMA) sollten für mehr Wettbewerb in App Stores sorgen, doch eine neue Studie zeigt: Nutzer sehen kaum Preissenkungen.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Miniatur Wunderland Ziel von IT-Angriff: Kreditkartendaten abgeflossen",
      "link": "https://www.heise.de/news/Miniatur-Wunderland-Ziel-von-IT-Angriff-Kreditkartendaten-abgeflossen-11076011.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-12T15:41:00",
      "content": "Das Online-Buchungssystem des Miniatur Wunderlands wurde Ziel eines IT-Angriffs. Untersuchungen laufen derzeit noch.",
      "content_length": 116,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Microsoft ermöglicht externe Passkey-Verwaltung in Windows 11",
      "link": "https://www.heise.de/news/Microsoft-ermoeglicht-externe-Passkey-Verwaltung-in-Windows-11-11075235.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-12T10:45:00",
      "content": "Microsoft hat die Passkey-Verwaltung in Windows 11 aufgebohrt. Nun können das externe Programme übernehmen – etwa 1Password und Bitwarden.",
      "content_length": 138,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Patchday Microsoft: Attacken auf Windows-Kernel beobachtet",
      "link": "https://www.heise.de/news/Patchday-Microsoft-Attacken-auf-Windows-Kernel-beobachtet-11074858.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-12T07:36:00",
      "content": "Microsofts Entwickler haben Sicherheitslücken in unter anderem Azure, Office und Windows geschlossen. Es gibt bereits Attacken. ",
      "content_length": 128,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Linux: KI-Richtlinien für Kernel-Entwickler in der Diskussion",
      "link": "https://www.heise.de/news/Linux-KI-Richtlinien-fuer-Kernel-Entwickler-in-der-Diskussion-11074886.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-12T07:21:00",
      "content": "Der Linux-Erfinder will KI-Tools genauso behandeln wie andere Werkzeuge – und sieht auch beim Copyright von KI-Beiträgen keine Gründe für Sonderbehandlungen.",
      "content_length": 157,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Windows 10 22H2: Update außer der Reihe – korrigiert ESU-Probleme",
      "link": "https://www.heise.de/news/Windows-10-22H2-Update-ausser-der-Reihe-korrigiert-ESU-Probleme-11074832.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-12T06:47:00",
      "content": "Einige Windows-10-Nutzer erhalten ein Update-Angebot nach dem Support-Ende. Es korrigiert Probleme mit der Supportverlängerung.",
      "content_length": 127,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Über 127.000 Bitcoin entwendet: China wirft US-Regierung Milliardendiebstahl vor",
      "link": "https://www.heise.de/news/Ueber-127-000-Bitcoin-entwendet-China-wirft-US-Regierung-Milliardendiebstahl-vor-11074826.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-12T06:10:00",
      "content": "Vor fünf Jahren wurden einer Kryptofirma über 127.000 Bitcoin gestohlen, jetzt werden Details bekannt. Nun wirft China der US-Regierung vor, dahinterzustecken.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "SAP-Patchday bringt 18 neue Sicherheitsmitteilungen",
      "link": "https://www.heise.de/news/SAP-Patchday-bringt-18-neue-Sicherheitsmitteilungen-11073912.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-11T12:33:00",
      "content": "SAP korrigiert Schwachstellen in mehrere Produkten und dokumentiert dies in 18 Sicherheitsmitteilungen zum November-Patchday.",
      "content_length": 125,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "iPhone Air 2: Schlechte Verkäufe sorgen angeblich für Verschiebung",
      "link": "https://www.heise.de/news/iPhone-Air-2-Schlechte-Verkaeufe-sorgen-angeblich-fuer-Verschiebung-11073002.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-11T09:57:00",
      "content": "Das dünnste iPhone aller Zeiten kommt Analysten zufolge schlechter an als von Apple erhofft. Das ändert nun offenbar den Release-Plan für ein neues Modell.",
      "content_length": 155,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "GEMA vs. OpenAI: Niederlage für ChatGPT vor Münchner Gericht",
      "link": "https://www.heise.de/news/GEMA-vs-OpenAI-Niederlage-fuer-ChatGPT-vor-Muenchner-Gericht-11073532.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-11T09:41:00",
      "content": "Das Landgericht München hat gegen OpenAI entschieden. Geklagt hatte die GEMA – es geht um Liedtexte von Helene Fischer und mehr.",
      "content_length": 128,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Dank Digitaleinnahmen: KI-generierter Song an Spitze einer US-Bestenliste",
      "link": "https://www.heise.de/news/Walk-My-Walk-KI-generierter-Song-erstmals-an-Spitze-einer-Billboard-Liste-11073272.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-11T09:21:00",
      "content": "Nachdem KI-Musik in den vergangenen Monaten immer wieder für Aufsehen gesorgt hat, hat jetzt erstmals ein KI-Song die Spitze einer US-Hitliste erreicht.",
      "content_length": 152,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Nach 15 Jahren: Facebook nimmt externe Like- und Kommentar-Buttons offline",
      "link": "https://www.heise.de/news/Nach-15-Jahren-Facebook-nimmt-Like-und-Kommentar-Buttons-offline-11073094.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-11T06:20:00",
      "content": "15 Jahre lang gehörte der Like-Button von Facebook zu einem festen Bestandteil des Internets. Nun steht das Ende an, am 10. Februar soll er verschwinden.",
      "content_length": 153,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Wenn jede Minute zählt: Predictive Maintenance in der modernen Landwirtschaft",
      "link": "https://www.heise.de/news/Wenn-jede-Minute-zaehlt-Predictive-Maintenance-in-der-modernen-Landwirtschaft-11072991.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-11T06:15:00",
      "content": "Maschinenausfälle in der Landwirtschaft können die Ernte und die Existenz bedrohen. Smarte Sensoren und KI-gestützte Wartung sollen vorbeugen.",
      "content_length": 142,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "ESA will Astronautennahrung aus Luft und Urin herstellen",
      "link": "https://www.heise.de/news/ESA-will-Astronautennahrung-aus-Luft-und-Urin-herstellen-11072760.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-10T16:22:00",
      "content": "Die ESA entwickelt mit Solar Foods ein System zur Protein-Herstellung im All. Mikroben sollen aus Luft, Strom und Astronautenurin essbare Nährstoffe erzeugen.",
      "content_length": 158,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Windows 11 26H1: Unterstützung für bestimmte Prozessoren",
      "link": "https://www.heise.de/news/Windows-11-26H1-Unterstuetzung-fuer-bestimmte-Prozessoren-11071382.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-08T12:11:00",
      "content": "Die Gerüchteküche brodelte, nun hat Microsoft eine Insider-Vorschau für Windows 11 26H1 herausgegeben. Sie unterstützt bestimmte CPUs.",
      "content_length": 134,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Steam-Spiele laufen auch auf Android (ja, wirklich)",
      "link": "https://www.heise.de/news/Steam-Spiele-laufen-auch-auf-Android-ja-wirklich-11070912.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-07T15:00:00",
      "content": "Fast ohne Frickelei: Emulations-Apps wie GameHub oder Winlator bringen Windows-Spiele auf Android zum Laufen.",
      "content_length": 109,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Ende der Krise? Die Niederlande würden Kontrolle über Nexperia wieder abgeben",
      "link": "https://www.heise.de/news/Ende-der-Krise-Die-Niederlande-wuerden-Kontrolle-ueber-Nexperia-wieder-abgeben-11069118.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-07T08:44:00",
      "content": "Wenn China den Export von Nexperia-Produkten wieder zulässt, würden die Niederlande die Kontrolle über das Unternehmen abgeben. Das berichtet Bloomberg.",
      "content_length": 152,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Cisco: Tausende Firewalls verwundbar, neue Angriffswege beobachtet",
      "link": "https://www.heise.de/news/Cisco-Tausende-Firewalls-verwundbar-neue-Angriffswege-beobachtet-11068989.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-07T07:32:00",
      "content": "Zum Missbrauch der seit Ende September bekannten Sicherheitslücken in Cisco-Firewalls haben Angreifer neue Wege gefunden. Tausende sind verwundbar.",
      "content_length": 147,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "\"GTA 6\": Nächster Teil der Open-World-Saga um weitere sechs Monate verschoben",
      "link": "https://www.heise.de/news/GTA-6-Naechster-Teil-der-Open-World-Saga-um-weitere-sechs-Monate-verschoben-11068955.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-07T06:02:00",
      "content": "\"Grand Theft Auto VI\" wird frühestens in einem Jahr erscheinen, das sind noch einmal sechs Monate später als bislang angekündigt. Das hat Rockstar mitgeteilt.",
      "content_length": 158,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Vorsicht Kunde: Strafen im Bahnverkehr",
      "link": "https://www.heise.de/news/Vorsicht-Kunde-Strafen-im-Bahnverkehr-11067893.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-07T05:00:00",
      "content": "Das Bahnticket in der App ist praktisch. Doch fällt die App bei einer Kontrolle aus, droht eine Strafe. Wir erklären die Rechtslage und geben Tipps.",
      "content_length": 148,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Bundestag: Polizei darf mit Staatstrojanern Geldautomatensprenger jagen",
      "link": "https://www.heise.de/news/Bundestag-Polizei-darf-mit-Staatstrojanern-Geldautomatensprenger-jagen-11068749.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-06T18:05:00",
      "content": "Die Abgeordneten haben ein Gesetz zu Explosionsgefährdungen beschlossen. Strafverfolger dürfen damit eine Quellen-TKÜ bei Geldautomatensprengungen durchführen.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Frankreich kontrolliert 200.000 Shein-Pakete am Flughafen",
      "link": "https://www.heise.de/news/Frankreich-kontrolliert-200-000-Shein-Pakete-am-Flughafen-11068739.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-06T17:42:00",
      "content": "Gefährliche Spielzeuge, gefälschte Kosmetik und verbotene Produkte: Frankreich nimmt 200.000 Shein-Pakete am Flughafen auseinander. Was dahinter steckt.",
      "content_length": 152,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Windows: Oktober-Sicherheitsupdates können Bitlocker-Wiederherstellung auslösen",
      "link": "https://www.heise.de/news/Windows-Oktober-Sicherheitsupdates-koennen-Bitlocker-Wiederherstellung-ausloesen-11068172.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-06T12:57:00",
      "content": "Die Sicherheitsupdates vom Oktober-Patchday für Windows können dazu führen, dass die Bitlocker-Wiederherstellung startet.",
      "content_length": 121,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Microsoft: Millionen-Rückzahlungen in Australien wegen teurer Office-Abos mit KI",
      "link": "https://www.heise.de/news/Microsoft-Millionen-Rueckzahlungen-in-Australien-wegen-teurer-Office-Abos-mit-KI-11068054.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-06T12:25:00",
      "content": "Nach Klageeinreichung von Australiens Verbraucherschutzbehörde wegen verteuerter Office-Abos mit KI bietet Microsoft Rückzahlungen an.",
      "content_length": 134,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Standardmodell der Kosmologie falsch? Expansion des Universums verlangsamt sich",
      "link": "https://www.heise.de/news/Standardmodell-der-Kosmologie-falsch-Expansion-des-Universums-verlangsamt-sich-11067763.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-06T11:13:00",
      "content": "Seit Jahrzehnten geht man davon aus, dass sich die Expansion des Universums beschleunigt – dafür gab es gar den Nobelpreis. Nun werden die Zweifel noch lauter.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Have I Been Pwned: Milliarden neuer Passwörter in Sammlung",
      "link": "https://www.heise.de/news/Have-I-Been-Pwned-Milliarden-neuer-Passwoerter-in-Sammlung-11067453.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-06T08:46:00",
      "content": "Aus Infostealer-Datensätzen konnte Have-I-Been-Pwned-Betreiber Troy Hunt 1,3 Milliarden einzigartige Passwörter extrahieren.",
      "content_length": 124,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Gnome wirft X11-Backend endgültig raus",
      "link": "https://www.heise.de/news/X11-in-Gnome-ist-Geschichte-Backend-entfernt-11066916.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-05T16:30:00",
      "content": "Angedeutet hatte es sich schon, nun haben die Entwickler durchgezogen: Sie haben den X11-Backend-Code aus Gnome entfernt.",
      "content_length": 121,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "\"Entlastungskabinett\": Mehr als nur das offizielle Aus für DE-Mail",
      "link": "https://www.heise.de/news/Entlastungskabinett-Mehr-als-nur-das-offizielle-Aus-fuer-DE-Mail-11066393.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-05T11:14:00",
      "content": "Die schwarz-rote Bundesregierung will den Alltag für Bürgerinnen und Bürger, aber auch für Unternehmen einfacher machen. Das soll Kosten und Aufwand sparen.",
      "content_length": 156,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Badcandy: Angreifer brechen tausendfach in alte Cisco-IOS-XE-Lücke ein",
      "link": "https://www.heise.de/news/Badcandy-Alte-Luecke-in-Cisco-IOS-XE-noch-tausendfach-missbraucht-11064981.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-05T11:11:00",
      "content": "Ein Update gegen die Cisco-IOS-XE-Lücke CVE-2023-20198 gibt es seit 2023. Die Shadowserver Foundation sieht 15.000 infizierte Geräte.",
      "content_length": 133,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "\"Operation Chargeback\": Umfangreicher Missbrauch mit Mini-Abbuchungen aufgedeckt",
      "link": "https://www.heise.de/news/Operation-Chargeback-Grossangelegter-Betrug-mit-Kreditkartendaten-aufgedeckt-11061633.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-05T10:37:00",
      "content": "Deutschen Strafverfolgungsbehörden ist nach eigenen Angaben ein großer Schlag gegen ein Betrugsnetzwerk gelungen. Das hat Zahlungsdienstleister kompromittiert.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Microsoft gibt Tipps für erweiterten Support für kommerzielles Windows 10",
      "link": "https://www.heise.de/news/Microsoft-gibt-Tipps-fuer-erweiterten-Support-fuer-kommerzielles-Windows-10-11057081.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-05T08:06:00",
      "content": "Windows 10 erhält seit dem 14. Oktober keinen Support mehr. Microsoft gibt Admins Tipps für kommerziellen, erweiterten Support.",
      "content_length": 127,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Paukenschlag: Google und Epic einigen sich auf weltweite Android-Änderungen",
      "link": "https://www.heise.de/news/Google-und-Epic-einigen-sich-auf-weltweite-Android-Aenderungen-11057051.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-05T07:25:00",
      "content": "Überraschend haben sich Google und Epic im Android-Gerichtsstreit auf einen gemeinsamen Vorschlag geeinigt. Die geplanten Änderungen sollen weltweit gelten. ",
      "content_length": 157,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "AirPods Pro und AirPods 4: Live-Übersetzung kommt nach Europa",
      "link": "https://www.heise.de/news/AirPods-Pro-und-AirPods-4-Live-Uebersetzung-kommt-nach-Europa-11055015.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-04T18:00:00",
      "content": "Die KI-Übersetzungsfunktion kommt im Dezember auf unterstützte iPhones und Apple-Hörer. Als Grund für die Verzögerung nennt Apple den Digital Markets Act.",
      "content_length": 154,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Telekom-Rechenzentrum mit 10.000 Nvidia-GPUs entsteht in München",
      "link": "https://www.heise.de/news/Telekom-Rechenzentrum-mit-10-000-Nvidia-GPUs-entsteht-in-Muenchen-11056756.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-04T16:21:00",
      "content": "In Partnerschaft mit Nvidia baut die Telekom ein KI-Rechenzentrum in München und will damit \"das Wasser testen\". Die Dienste laufen unter deutscher Flagge.",
      "content_length": 155,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Cyberkriminelle brechen in Logistikunternehmen ein und stehlen Fracht",
      "link": "https://www.heise.de/news/Cyberkriminelle-brechen-in-Logistikunternehmen-ein-und-stehlen-Fracht-11053409.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-04T13:49:00",
      "content": "IT-Forscher beobachten, wie Cyberkriminelle in die IT von Logistikunternehmen einbrechen und schließlich wertvolle Fracht stehlen.",
      "content_length": 130,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Astronomie: Interstellarer Komet 3I/ATLAS wieder von der Erde aus sichtbar",
      "link": "https://www.heise.de/news/Astronomie-Interstellarer-Komet-3I-ATLAS-wieder-von-der-Erde-aus-sichtbar-11040533.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-04T09:37:00",
      "content": "Ein Astronom aus den USA hat in den frühen Morgenstunden mehrere Aufnahmen des interstellaren Kometen 3I/ATLAS gemacht. Er war vorher nicht für uns sichtbar.",
      "content_length": 157,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Natrium-Ionen-Batterie: Fraunhofer ersetzt kritische Rohstoffe durch Holz",
      "link": "https://www.heise.de/news/Fraunhofer-forscht-an-kleinen-aufladbaren-Batterien-mit-Material-aus-Holzresten-11039553.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-04T09:11:00",
      "content": "Das Fraunhofer IKTS will die Batterieproduktion nachhaltiger gestalten und kritische Rohstoffe zunehmend ersetzen. Ein mögliches Material ist Holz. ",
      "content_length": 148,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Tansania: Internetblockade nach fünf Tagen beendet, WhatsApp & Co. noch gesperrt",
      "link": "https://www.heise.de/news/Tansania-Internetblockade-nach-fuenf-Tagen-beendet-WhatsApp-Co-noch-gesperrt-11038139.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-04T08:21:00",
      "content": "Fast eine Woche war Tansania komplett offline, jetzt geht das Internet wieder. Soziale Netzwerke und Messenger werden aber offenbar weiterhin blockiert.",
      "content_length": 152,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Microsoft führt Passkey-Synchronisation in Edge ein",
      "link": "https://www.heise.de/news/Microsoft-fuehrt-Passkey-Synchronisation-in-Edge-ein-11038464.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-04T08:09:00",
      "content": "Microsofts Passwort-Manager im Webbrowser Edge kann Passkeys jetzt speichern und über Windows-Geräte synchronisieren.",
      "content_length": 117,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Zero-Day-Lücke bei LNK-Anzeige in Windows gegen Diplomaten missbraucht",
      "link": "https://www.heise.de/news/Windows-Zero-Day-Luecke-bei-LNK-Anzeige-gegen-Diplomaten-missbraucht-10983101.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-03T13:39:00",
      "content": "Microsoft hält eine Lücke in der LNK-Anzeige für nicht behebenswert. Sie wurde inzwischen gegen europäische Diplomaten missbraucht.",
      "content_length": 131,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "KI-Musik: Nutzer-Frust nach Einigung zwischen Universal Music und Udio",
      "link": "https://www.heise.de/news/KI-Musik-Nutzer-Frust-nach-Einigung-zwischen-Universal-Music-und-Udio-10980796.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-03T12:55:00",
      "content": "Universal Music hat eine Einigung zum KI-Training mit der Udio-Plattform erzielt. Nutzer sind frustriert: Downloads gibt es nicht mehr.",
      "content_length": 135,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Windows bekommt gemeinsames Musikhören mit Bluetooth LE Shared Audio",
      "link": "https://www.heise.de/news/Windows-bekommt-gemeinsames-Musikhoeren-mit-Bluetooth-LE-Shared-Audio-10967210.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-03T09:56:00",
      "content": "Neue Windows-Insider-Vorschauen bringen \"Shared Audio\" für Bluetooth LE mit. Damit lässt sich der Klang auf zwei Geräten zugleich ausgeben.",
      "content_length": 139,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Softwarearchitekt: \"Ein gutes Framework sollte einfach zu verwenden sein\"",
      "link": "https://www.heise.de/hintergrund/Software-Frameworks-Uebergreifende-Konzepte-zu-finden-ist-eine-Kunst-11078734.html",
      "published": "2025-11-15T08:30:00",
      "content": "Im Interview spricht der Softwarearchitekt Peter Hruschka über Framework-Architektur, Wiederverwendung und Wissensaustausch.",
      "content_length": 124,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Developer Snapshots: Kleinere News der Woche",
      "link": "https://www.heise.de/news/Developer-Snapshots-Kleinere-News-der-Woche-11078459.html",
      "published": "2025-11-15T08:11:00",
      "content": "Die Übersicht enthält kleine, aber interessante Meldungen zu Google, Unreal, Rust, Databricks, Docker, BoxLang, Keycloak und W3C.",
      "content_length": 129,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "KubeCon: Fortschritte, aber auch mehr Arbeit bei Cloud-Native und Cybersecurity",
      "link": "https://www.heise.de/news/KubeCon-Fortschritte-aber-auch-mehr-Arbeit-bei-Cloud-Native-und-Cybersecurity-11078678.html",
      "published": "2025-11-14T15:14:00",
      "content": "Angesichts wachsender Angriffsflächen bei OSS sollten Entwickler Schwachstellen beheben, Software auditieren und sichere Container-Images nutzen.",
      "content_length": 145,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Spring Framework 7 bringt neues Konzept für Null Safety und setzt auf Java 25",
      "link": "https://www.heise.de/news/Spring-Framework-7-bringt-neues-Konzept-fuer-Null-Safety-und-setzt-auf-Java-25-11078318.html",
      "published": "2025-11-14T09:56:00",
      "content": "Das neue Spring Framework verwendet JSpecify für Null Safety. Außerdem führt es API-Versionierung ein und bietet ein neues Retry-Konzept für die Resilienz an.",
      "content_length": 158,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Aus Softwarefehlern lernen – Teil 8: Rundungs- und Gleitkommafehler",
      "link": "https://www.heise.de/hintergrund/Aus-Softwarefehlern-lernen-Teil-8-Rundungs-und-Gleitkommafehler-11078354.html",
      "published": "2025-11-14T09:32:00",
      "content": "Ein minimaler Rundungsfehler führte zum scheinbaren Markteinbruch an der Börse in Vancouver. Mit der richtigen Dezimalarithmetik lässt sich das vermeiden.",
      "content_length": 154,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "KI-Quellen sicher einbinden – JFrog kündigt MCP Registry an",
      "link": "https://www.heise.de/news/KI-Quellen-sicher-einbinden-JFrog-kuendigt-MCP-Registry-an-11078282.html",
      "published": "2025-11-14T09:22:00",
      "content": "JFrog stellt eine MCP Registry vor, die lokale und externe KI-Quellen auf Sicherheit prüft. Für den AI Catalog gibt es ferner eine Suche nach Schatten-KI.",
      "content_length": 154,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "10 Jahre CNCF: Neuigkeiten von Kubernetes – Cloud-Native und KI wachsen zusammen",
      "link": "https://www.heise.de/news/10-Jahre-CNCF-Neuigkeiten-von-Kubernetes-Cloud-Native-und-KI-wachsen-zusammen-11077448.html",
      "published": "2025-11-13T14:45:00",
      "content": "Kubernetes wird flexibler beim Versionsmanagement. Die CNCF treibt KI-Integration voran und stellt neue Projekte für Cloud-Native-Entwickler vor.",
      "content_length": 145,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Docker Desktop 4.50: KI-Integration und kostenlose Debug-Tools für Entwickler",
      "link": "https://www.heise.de/news/Docker-Desktop-4-50-KI-Integration-und-kostenlose-Debug-Tools-fuer-Entwickler-11076710.html",
      "published": "2025-11-13T11:39:00",
      "content": "Docker Desktop 4.50 bietet kostenlose Debug-Tools, erweiterte KI-Features und verbesserte Sicherheitsoptionen für Entwickler von Container-Anwendungen.",
      "content_length": 151,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "software-architektur.tv: Subjektives Schätzen, beliebige Deadlines?",
      "link": "https://www.heise.de/news/software-architektur-tv-Subjektives-Schaetzen-beliebige-Deadlines-11075141.html",
      "published": "2025-11-13T11:01:00",
      "content": "In dieser Folge beleuchtet Eberhard Wolff das Thema Aufwandsschätzung in Projekten, und wie Teams mit Deadlines umgehen sollten.",
      "content_length": 128,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Databricks: Wie KI-Agenten den Sprung in den Produktivbetrieb schaffen sollen",
      "link": "https://www.heise.de/news/Databricks-Wie-KI-Agenten-den-Sprung-in-den-Produktivbetrieb-schaffen-sollen-11075902.html",
      "published": "2025-11-13T07:35:00",
      "content": "Databricks hat auf der Data+AI World Tour neue Funktionen seiner Data-Intelligence-Plattform vorgestellt. Im Mittelpunkt stand die Plattform Agent Bricks.",
      "content_length": 154,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Uno Platform Studio 2.0 und Uno Platform 6.4: KI-Assistent und .NET-10.0-Support",
      "link": "https://www.heise.de/news/Uno-Platform-Studio-2-0-und-Uno-Platform-6-4-KI-Assistent-und-NET-10-0-Support-11075898.html",
      "published": "2025-11-12T17:04:00",
      "content": "Mit .NET 10.0 und Visual Studio 2026 kompatibel, ist die neue Uno-Platform-Version erschienen. Für die kommerzielle Variante gibt es neue KI-Features.",
      "content_length": 150,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Warum objektive Schätzungen in der Softwareentwicklung nicht funktionieren",
      "link": "https://www.heise.de/blog/Warum-objektive-Schaetzungen-in-der-Softwareentwicklung-nicht-funktionieren-11074323.html",
      "published": "2025-11-12T14:13:00",
      "content": "Der geschätzte Aufwand eines Softwareprojekts bezieht sich meist auf das jeweilige Team. Aber Aufwand ist nicht objektiv und unabhängig vom Team schätzbar.",
      "content_length": 155,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Fachbücher zu .NET 10.0, C# 14.0, Entity Framework Core 10.0 und Blazor 10.0",
      "link": "https://www.heise.de/blog/Fachbuecher-zu-NET-10-0-C-14-0-Entity-Framework-Core-10-0-und-Blazor-10-0-11075034.html",
      "published": "2025-11-12T10:15:00",
      "content": "Vier aktuelle .NET-Bücher des Dotnet-Doktors sind bereits auf dem Stand des gestern veröffentlichten stabilen Release verfügbar.",
      "content_length": 128,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": ".NET 10.0 ist fertig",
      "link": "https://www.heise.de/news/NET-10-0-ist-fertig-11074367.html",
      "published": "2025-11-12T08:11:00",
      "content": "Microsoft hat die produktionsreifen Versionen von .NET 10.0 und Visual Studio 2026 veröffentlicht. Spannende Neuerungen gibt es vor allem für C# und Blazor.",
      "content_length": 156,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "programmier.bar: Embedded Development mit Jakob Czekansky",
      "link": "https://www.heise.de/blog/programmier-bar-Embedded-Development-mit-Jakob-Czekansky-11074291.html",
      "published": "2025-11-12T07:25:00",
      "content": "Jakob Czekansky erläutert, wieso Embedded Systems wichtiger Teil unseres Alltags sind, wie sie entwickelt werden und wie sie die technologische Zukunft prägen.",
      "content_length": 159,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Linux: KI-Richtlinien für Kernel-Entwickler in der Diskussion",
      "link": "https://www.heise.de/news/Linux-KI-Richtlinien-fuer-Kernel-Entwickler-in-der-Diskussion-11074886.html",
      "published": "2025-11-12T07:21:00",
      "content": "Der Linux-Erfinder will KI-Tools genauso behandeln wie andere Werkzeuge – und sieht auch beim Copyright von KI-Beiträgen keine Gründe für Sonderbehandlungen.",
      "content_length": 157,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "CNCF standardisiert KI-Infrastruktur mit neuem Kubernetes-Programm",
      "link": "https://www.heise.de/news/CNCF-standardisiert-KI-Infrastruktur-mit-neuem-Kubernetes-Programm-11074337.html",
      "published": "2025-11-11T16:07:00",
      "content": "Mit dem Kubernetes-AI-Conformance-Programm legt die CNCF einen technischen Standard für KI-Plattformen vor, der Portabilität und Souveränität garantieren soll.",
      "content_length": 159,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "fish 4.2.0: Mehrzeilige Befehle und UTF-8 als Standard",
      "link": "https://www.heise.de/news/fish-4-2-0-Mehrzeilige-Befehle-und-UTF-8-als-Standard-11073639.html",
      "published": "2025-11-11T11:48:00",
      "content": "Die Shell fish 4.2.0 bietet mehrzeilige Befehle in der Autovervollständigung und setzt UTF-8 als Standard voraus.",
      "content_length": 113,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Unsichtbarer Wurm in Visual Studio Extensions: GlassWorm lebt",
      "link": "https://www.heise.de/news/Schadsoftware-weiter-aktiv-GlassWorm-erneut-in-Open-VSX-Paketen-gefunden-11073146.html",
      "published": "2025-11-11T11:43:00",
      "content": "Weitere Instanzen der Schadsoftware, die Credentials und Kryptowährung abgreift, sind auf Open VSX aufgetaucht und wollen sich auf GitHub einnisten.",
      "content_length": 148,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Software Testing: Mensch vs. Maschine – wer urteilt fairer?",
      "link": "https://www.heise.de/blog/Software-Testing-Mensch-vs-Maschine-wer-urteilt-fairer-11073300.html",
      "published": "2025-11-11T09:07:00",
      "content": "In dieser Episode des Podcasts sprechen Richard Seidl und Sam Goetjes über Vertrauen in KI-Ergebnisse.",
      "content_length": 102,
      "source": "Heise Developer",
      "category": "Tech News"
    }
  ],
  "stats": {
    "by_category": {
      "German News": 132,
      "International News": 69,
      "Tech News": 110
    },
    "by_source": {
      "Tagesschau": 40,
      "Tagesschau Ausland": 64,
      "Deutschlandfunk": 28,
      "The Guardian World": 45,
      "France 24 English": 24,
      "Ars Technica": 20,
      "The Verge": 10,
      "Heise Top": 60,
      "Heise Developer": 20
    }
  }
}