{
  "date": "2025-11-10",
  "timestamp": "2025-11-10T07:13:50.138718",
  "total_articles": 308,
  "articles": [
    {
      "title": "Drohnen fliegen über Flughafen und Kernkraftwerk in Belgien",
      "link": "https://www.tagesschau.de/ausland/europa/belgien-drohnen-flughafen-akw-100.html",
      "published": "2025-11-10T06:54:12",
      "content": "   In Belgien hat es erneut Vorfälle mit Drohnen unbekannter Herkunft gegeben. Es gab Sichtungen über einem wichtigen Flughafen und einem AKW. Nach Deutschland hilft nun auch Großbritannien mit Spezialisten.[mehr]",
      "content_length": 213,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Prozess um Anschlag auf Magdeburger Weihnachtsmarkt startet",
      "link": "https://www.tagesschau.de/inland/regional/sachsenanhalt/prozess-anschlag-magdeburger-weihnachtsmarkt-100.html",
      "published": "2025-11-10T07:04:38",
      "content": "   Am Landgericht Magdeburg beginnt der Prozess um den Anschlag auf den Weihnachtsmarkt. 47 Verhandlungstage sind bislang geplant - in einem extra für den Prozess errichteten Gerichtssaal mit Platz für 700 Menschen.[mehr]",
      "content_length": 221,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Shutdown in den USA: Senat stimmt für Kompromissvorschlag",
      "link": "https://www.tagesschau.de/ausland/amerika/shutdown-148.html",
      "published": "2025-11-10T06:06:28",
      "content": "   Der US-Senat hat einen ersten Schritt zur Beendigung des Regierungsstillstands gemacht. Die Senatoren stimmten einem Kompromiss zu, der den Weg zu einer Übergangsfinanzierung freimachen könnte. Nun ist das Repräsentantenhaus gefragt.[mehr]",
      "content_length": 242,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Durchschnittlicher Kassen-Zusatzbeitrag auf 2,9 Prozent festgelegt",
      "link": "https://www.tagesschau.de/inland/innenpolitik/warken-krankenkassen-100.html",
      "published": "2025-11-10T03:46:39",
      "content": "   Der durchschnittliche Zusatzbeitrag für gesetzliche Krankenkassen soll bei 2,9 Prozent bleiben. Das kündigte Gesundheitsministerin Warken an. Allerdings gibt das Ministerium nur eine Orientierungsmarke.[mehr]",
      "content_length": 211,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Anhörung zur Rente im Bundestag",
      "link": "https://www.tagesschau.de/inland/innenpolitik/rente-366.html",
      "published": "2025-11-10T02:46:43",
      "content": "   Bundestagsabgeordnete hören heute Experten und Verbände an, danach könnten in den nächsten Wochen die Haltelinie beim Rentenniveau und die Mütterrente verabschiedet werden. Wenn nicht doch noch etwas dazwischenkommt. Von Jan-Peter Bartels.[mehr]",
      "content_length": 248,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "BBC-Chef tritt nach Kritik an Bearbeitung von Trump-Aussagen zurück",
      "link": "https://www.tagesschau.de/ausland/europa/bbc-ruecktritte-100.html",
      "published": "2025-11-10T02:50:30",
      "content": "   Der Direktor und die Nachrichtenchefin der britischen Rundfunkanstalt BBC sind zurückgetreten. Hintergrund sind Vorwürfe im Zusammenhang mit einer Trump-Dokumentation. Wie es nach den Rücktritten weitergeht, ist unklar.[mehr]",
      "content_length": 228,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Bundesumweltminister: Heizungstausch wird weiterhin gefördert",
      "link": "https://www.tagesschau.de/inland/innenpolitik/schneider-heizung-foerderung-100.html",
      "published": "2025-11-09T19:59:12",
      "content": "   Klimafreundliche Heizungen sollen laut Umweltminister Schneider weiterhin gefördert werden. Das Gebäudeenergiegesetz werde \"im Grundsatz\" so bleiben, sagte der SPD-Politiker im Bericht aus Berlin. Im Koalitionsvertrag klang das anders.[mehr]",
      "content_length": 244,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Reportage aus Guyana: \"Der Ölboom übersteigt unsere Kapazitäten\"",
      "link": "https://www.tagesschau.de/ausland/amerika/guyana-oelboom-umwelt-100.html",
      "published": "2025-11-09T17:56:34",
      "content": "   Vor zehn Jahren wurden vor Guyana riesige Ölvorkommen entdeckt. Seitdem wächst die Ölindustrie rasant, boomt der Export. Doch die Armut ist noch lange nicht überwunden, und Sorgen vor den Umweltfolgen bleiben. Von J. Barke.[mehr]",
      "content_length": 232,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Zahl der Schüler wächst laut Prognose in den kommenden Jahren",
      "link": "https://www.tagesschau.de/inland/gesellschaft/schueler-zahlen-100.html",
      "published": "2025-11-09T16:27:57",
      "content": "   Die Schülerzahl in Deutschland wächst nach aktuellen Berechnungen der Bildungsministerkonferenz bis zum Jahr 2032 weiter deutlich an - und geht danach zurück. Allerdings gibt es große regionale Unterschiede.[mehr]",
      "content_length": 216,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Afghanen mit Aufnahmezusage appellieren in Brief an Kanzler Merz",
      "link": "https://www.tagesschau.de/inland/afghanen-aufnahmezusage-merz-100.html",
      "published": "2025-11-09T16:07:29",
      "content": "   Afghanen mit Aufnahmezusage haben einen Brief an Kanzler Merz geschrieben. Sie fordern Deutschland auf, sein Schutzversprechen einzuhalten. Das Angebot, gegen Geld darauf zu verzichten, nennen sie \"verletzend\". Von B. Schwarz.[mehr]",
      "content_length": 235,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Hunderte Vermisste nach Bootsunglück vor Malaysia",
      "link": "https://www.tagesschau.de/ausland/asien/malaysia-bootsunglueck-100.html",
      "published": "2025-11-09T15:40:17",
      "content": "   Zwischen Malaysia und Thailand ist mindestens ein Boot mit geflüchteten Rohingya an Bord gekentert. Mindestens sieben Personen wurden tot geborgen, die Behörden suchen noch nach Hunderten Vermissten und zwei weiteren Booten.[mehr]",
      "content_length": 233,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Ratsvorsitzende der evangelischen Kirche fordert Widerstand gegen AfD",
      "link": "https://www.tagesschau.de/inland/innenpolitik/ekd-kolping-afd-100.html",
      "published": "2025-11-09T15:36:14",
      "content": "   Die EKD-Ratsvorsitzende Bischöfin Fehrs sieht die AfD \"außerhalb der Grundlagen des Grundgesetzes\". Auf der Jahrestagung der Synode ruft sie zum Widerstand auf. Auch das katholische Kolpingwerk distanziert sich deutlich von der Partei.[mehr]",
      "content_length": 244,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Von Hamas übergebene Leiche ist verschleppter Soldat",
      "link": "https://www.tagesschau.de/ausland/asien/israel-hamas-leiche-102.html",
      "published": "2025-11-09T18:22:03",
      "content": "   Israel hat nach forensischen Untersuchungen die Identität einer von der militant-islamistischen Hamas ausgehändigten Leiche bestätigt. Es handele es sich um einen Soldaten, der bereits 2014 im Gazastreifen getötet wurde. [mehr]",
      "content_length": 230,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Zehntausende Menschen in Russland ohne Strom nach ukrainischen Angriffen",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-russland-angriffe-energie-100.html",
      "published": "2025-11-09T13:56:45",
      "content": "   Nach den massiven russischen Angriffen auf die ukrainische Energieinfrastruktur hat die Ukraine nun zum Gegenschlag ausgeholt: Im russischen Grenzgebiet wurde das Energienetz attackiert. Etwa 20.000 Haushalte waren zeitweise ohne Strom. [mehr]",
      "content_length": 246,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Steinmeier: Demokratie so bedroht wie seit Jahrzehnten nicht",
      "link": "https://www.tagesschau.de/inland/gesellschaft/steinmeier-demokratie-bedrohung-100.html",
      "published": "2025-11-09T21:16:48",
      "content": "   Wachsender Rechtsextremismus, Hass und Populismus - Bundespräsident Steinmeier warnt vor der größten Bedrohung der deutschen Demokratie seit der Wiedervereinigung. Es sei an der Zeit sich einzumischen und für die Freiheit einzustehen.[mehr]",
      "content_length": 243,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Blockade von Treibstoff-Einfuhr: Islamisten legen Mali lahm",
      "link": "https://www.tagesschau.de/ausland/afrika/mali-islamisten-treibstoff-100.html",
      "published": "2025-11-09T11:25:53",
      "content": "   Mali steht nahezu still. Islamisten haben das westafrikanische Land weitgehend von Benzin- und Diesellieferungen abgeschnitten. Eine Zermürbungstaktik, die die Wut auf Malis Militärregierung schüren soll. Von Karin Bensch.[mehr]",
      "content_length": 231,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Lateinamerika-EU-Gipfel: Ein Treffen überschattet von Trump",
      "link": "https://www.tagesschau.de/ausland/amerika/celac-eu-lateinamerika-gipfel-trump-100.html",
      "published": "2025-11-09T10:04:11",
      "content": "   Eigentlich geht es beim EU-Lateinamerika-Gipfel in Kolumbien um eine engere Zusammenarbeit. Doch die jüngsten US-Angriffe auf mutmaßliche Drogenboote überschatten das Treffen - und die EU scheint das Thema am liebsten meiden zu wollen. Von M.-K. Boese und A. Demmer.[mehr]",
      "content_length": 275,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Tote durch Riesenwellen auf Teneriffa",
      "link": "https://www.tagesschau.de/ausland/europa/teneriffa-tote-wellengang-100.html",
      "published": "2025-11-09T14:53:49",
      "content": "   Riesige Wellen haben Teneriffa getroffen. An mehreren Stellen der spanischen Insel wurden Menschen ins Wasser gerissen - teils von Uferpromenaden weg. Es gab Tote und Verletzte. Die Behörden hatten gewarnt.[mehr]",
      "content_length": 215,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Nach Unglück - US-Behörde verhängt Flugverbot für MD-11-Maschinen",
      "link": "https://www.tagesschau.de/ausland/amerika/usa-flugverbot-mcdonnell-absturz-100.html",
      "published": "2025-11-09T09:04:46",
      "content": "   Kurz nach dem Start verliert eine Maschine des Frachtunternehmens UPS ein Triebwerk und stürzt ab. Nun haben die USA Konsequenzen gezogen, die Folgen für den weltweiten Transport haben könnte.[mehr]",
      "content_length": 201,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Sportpsychologie: Die zwei Seiten von Fitness-Apps",
      "link": "https://www.tagesschau.de/wissen/gesundheit/fitness-apps-100.html",
      "published": "2025-11-09T07:06:59",
      "content": "   Bei manchen Menschen lösen Fitness-Apps statt Motivation eher Gefühle wie Frust oder Scham aus. Das hat ein Forschungsteam aus London durch die Analyse von Social-Media-Beiträgen herausgefunden. Von A. Braun.[mehr]",
      "content_length": 217,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "\"Little Berlin\": Museum erzählt vom Leben am Eisernen Vorhang",
      "link": "https://www.tagesschau.de/kultur/little-berlin-museum-moedlareuth-100.html",
      "published": "2025-11-09T07:06:03",
      "content": "   Die innerdeutsche Grenze teilte ganz Europa und ging auch mitten durch das Dorf Mödlareuth. Ein neues Museum zeigt den damaligen Alltag und bietet ungewöhnliche Perspektiven auf die Mauer. Von Mareike Wiemann.[mehr]",
      "content_length": 218,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Nächster Taifun trifft Philippinen: Mehr als eine Million Menschen evakuiert",
      "link": "https://www.tagesschau.de/ausland/asien/taifun-fung-wong-philippinen-100.html",
      "published": "2025-11-09T12:59:36",
      "content": "   Erst vor wenigen Tagen riss der verheerende Taifun \"Kalmaegi\" Hunderte Menschen in den Tod, jetzt zieht ein neuer Tropensturm über die Philippinen. Mehr als eine Million Menschen verlassen ihre Häuser.[mehr]",
      "content_length": 210,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Deutschland hält sich auf der Klimakonferenz mit klaren Zusagen zurück",
      "link": "https://www.tagesschau.de/ausland/klimakonferenz-deutschland-zusagen-absichten-100.html",
      "published": "2025-11-09T05:36:17",
      "content": "   Die Ausgangslage auf der Weltklimakonferenz in Brasilien ist schwierig: Die USA sitzen nicht am Tisch, und die EU-Staaten reisen mit abgeschwächten Zielen an. Deutschland hält sich zudem zurück, eine Vorreiterrolle zu übernehmen. Von D. Hebestreit.[mehr]",
      "content_length": 257,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Hunderte Flüge ausgefallen - Sondersitzung zu Shutdown in USA",
      "link": "https://www.tagesschau.de/ausland/amerika/shutdown-usa-flugausfaelle-sondersitzung-100.html",
      "published": "2025-11-09T07:37:38",
      "content": "   In den USA sind erneut Tausende Flüge ausgefallen oder hatten enorme Verspätung. Grund ist der Personalmangel bei den Fluglotsen wegen des Haushaltsstreits, der nach wie vor nicht gelöst ist. Heute soll es eine Sondersitzung geben.[mehr]",
      "content_length": 240,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "9. November: Deutschland erinnert an Pogromnacht und Mauerfall",
      "link": "https://www.tagesschau.de/inland/neunter-november-gedenken-100.html",
      "published": "2025-11-09T11:37:20",
      "content": "   Der 9. November ist für Deutschland in mehrfacher Hinsicht ein besonderer Tag. Auch dieses Jahr fanden zahlreiche Gedenkveranstaltungen statt. Bundespräsident Steinmeier warnte vor den Gefahren für die Demokratie.[mehr]",
      "content_length": 222,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Syriens Interimspräsident al-Scharaa in USA eingetroffen",
      "link": "https://www.tagesschau.de/ausland/amerika/syrien-al-scharaa-usa-100.html",
      "published": "2025-11-09T01:45:51",
      "content": "   Es ist ein historischer Besuch: Nur einen Tag, nachdem er von der Terrorliste gestrichen wurde, ist Syriens Übergangspräsident al-Scharaa zu einem Staatsbesuch in den USA eingetroffen. Er und Präsident Trump wollen künftig zusammenarbeiten.[mehr]",
      "content_length": 249,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Ehemalige Geiseln der Hamas fordern Rückgabe aller Leichname",
      "link": "https://www.tagesschau.de/ausland/asien/israel-geiseln-rueckgabe-leichen-100.html",
      "published": "2025-11-09T00:23:22",
      "content": "   In Israel haben Tausende Menschen für die Rückgabe der sterblichen Überreste der letzten fünf Geiseln der Hamas demonstriert. Unter ihnen waren auch Personen, die bis vor kurzem selbst noch in der Gewalt der Terroristen waren.[mehr]",
      "content_length": 235,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Reformer Paz als neuer Präsident Boliviens vereidigt",
      "link": "https://www.tagesschau.de/ausland/amerika/paz-vereidigung-102.html",
      "published": "2025-11-08T19:52:45",
      "content": "   In Bolivien geht eine fast 20 Jahre währende Ära linker Regierungen zu Ende: Mit Rodrigo Paz ist ein moderater Reformer als Präsident vereidigt worden. Die Herausforderungen in dem krisengeschüttelten Land sind groß.[mehr]",
      "content_length": 225,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Tornado in Brasilien zerstört Kleinstadt und fordert Tote und Verletzte",
      "link": "https://www.tagesschau.de/ausland/amerika/brasilien-tornado-100.html",
      "published": "2025-11-08T18:19:31",
      "content": "   Im Süden Brasiliens sind bei einem Tornado mindestens sechs Menschen ums Leben gekommen, Hunderte wurden verletzt. Eine Kleinstadt wurde fast völlig zerstört. Die Behörden warnen vor weiteren schweren Stürmen.[mehr]",
      "content_length": 218,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Lange Trockenperiode: Trinkwasser in Teheran wird rationiert",
      "link": "https://www.tagesschau.de/ausland/asien/iran-wasserrationierung-100.html",
      "published": "2025-11-08T16:37:48",
      "content": "   Im Iran ist vielerorts seit Wochen kein Regen mehr gefallen, Stauseen haben zu wenig Wasser. 15 Millionen Menschen in der Hauptstadt Teheran wird deshalb nachts das Wasser abgedreht. Könnte das neue Proteste auslösen?[mehr]",
      "content_length": 226,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Gedenken Pogromnacht: Holocaust-Überlebende warnen vor neuem Antisemitismus",
      "link": "https://www.tagesschau.de/inland/gesellschaft/pogromnacht-warnungen-antisemitismus-100.html",
      "published": "2025-11-08T16:14:45",
      "content": "   Zum Jahrestag der Novemberpogrome gegen Juden 1938 warnen Holocaust-Überlebende vor neuem Antisemitismus. Der Präsident des Zentralrats der Juden hält israelfeindliche Demonstrationen in Berlin für eine \"Perversion der Geschichte\".[mehr]",
      "content_length": 240,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Tschechien: Ein Rechtsextremer als dritter Mann im Staat",
      "link": "https://www.tagesschau.de/ausland/europa/tschechien-okamura-parlamentspraesident-100.html",
      "published": "2025-11-08T15:26:06",
      "content": "   Nach einem Wahlkampf á la Musk und Milei hat Tomio Okamura sein Ziel erreicht: Der rassistische Anti-System-Politiker ist Tschechiens neuer Parlamentspräsident. Das verleiht ihm beträchtlichen Einfluss. Von M. Allweiss.[mehr]",
      "content_length": 228,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Brandenburger Koalition sagt Krisentreffen ab",
      "link": "https://www.tagesschau.de/inland/regional/brandenburg/koalitionsstreit-brandenburg-100.html",
      "published": "2025-11-08T17:18:49",
      "content": "   Das BSW in Brandenburg stellt sich quer: Wegen seiner Vorbehalte gegen zwei Staatsverträge zur Rundfunkreform und zum Jugendschutz wollte die Regierungskoalition kurzfristig ein Krisentreffen ansetzen - nun wurde es überraschend gestrichen.[mehr]",
      "content_length": 249,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Schwarz-Rot will China-Kommission einrichten",
      "link": "https://www.tagesschau.de/inland/innenpolitik/schwarz-rot-kommission-china-100.html",
      "published": "2025-11-08T15:23:16",
      "content": "   Es geht um Abhängigkeiten und Investitionen in die kritische Infrastruktur: Die schwarz-rote Koalition will eine Kommission einrichten, die den Handel mit China beleuchten soll. Schon am Freitag soll der Bundestag darüber debattieren. [mehr]",
      "content_length": 244,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Generalsekretäre von CDU und SPD rufen zu Reformen und Kompromissen auf",
      "link": "https://www.tagesschau.de/inland/innenpolitik/linnemann-kluessendorf-100.html",
      "published": "2025-11-08T15:14:23",
      "content": "   Die Koalition gibt kein gutes Bild ab: Die Beliebtheitswerte sind im Keller, immer wieder gibt es Streit. Die Generalsekretäre von CDU und SPD  reagieren mit einem gemeinsamen Appell - gerichtet an die eigenen Parteien.[mehr]",
      "content_length": 228,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Tausende demonstrieren in Köln für Freilassung von PKK-Gründer Öcalan",
      "link": "https://www.tagesschau.de/inland/regional/nordrheinwestfalen/demo-koeln-kurden-oecalan-100.html",
      "published": "2025-11-08T16:15:00",
      "content": "   Tausende haben in Köln für die Freilassung des in der Türkei inhaftierten PKK-Führers Öcalan demonstriert. Die PKK gilt in der EU als Terrororganisation. Im Mai hatte sie ihre Auflösung angekündigt und war damit einem Aufruf Öcalans gefolgt.[mehr]",
      "content_length": 250,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Nach \"Kalmaegi\": Philippinen wappnen sich für nächsten Taifun",
      "link": "https://www.tagesschau.de/ausland/asien/taifune-philippinen-vietnam-100.html",
      "published": "2025-11-08T13:36:30",
      "content": "   Nur wenige Tage nach der Verwüstung durch Taifun \"Kalmaegi\" müssen sich die Philippinen auf einen neuen Wirbelsturm vorbereiten. \"Fung-Wong\" könnte sich zu einem Supertaifun entwickeln und noch verheerender werden.[mehr]",
      "content_length": 223,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "US-Shutdown: Der Unmut in der Bevölkerung wächst",
      "link": "https://www.tagesschau.de/ausland/amerika/usa-shutdown-konsequenzen-100.html",
      "published": "2025-11-08T12:44:36",
      "content": "   Der Shutdown in den USA hält an: Während Millionen Menschen unter ausbleibenden Gehältern oder Lebensmittelhilfen leiden, ringt der Senat weiter um eine Lösung. Ob an diesem Wochenende eine Einigung erzielt wird, bleibt ungewiss. Von Anne Schneider.[mehr]",
      "content_length": 258,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Brandenburgs Regierung trifft sich zu Krisensitzung",
      "link": "https://www.tagesschau.de/inland/regional/brandenburg/brandenburg-streit-medienstaatsvertraege-100.html",
      "published": "2025-11-08T12:09:47",
      "content": "   Die bundesweit einzige Koalition von SPD und BSW ringt in Brandenburg um ihre Zukunft. Anlass ist die anstehende Abstimmung über die Rundfunkreform, die die BSW-Fraktion ablehnt. Ein Spitzentreffen morgen soll eine Lösung bringen.[mehr]",
      "content_length": 239,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Im Streit um Nexperia deutet sich Entspannung an",
      "link": "https://www.tagesschau.de/wirtschaft/nexperia-streit-andeutung-loesung-100.html",
      "published": "2025-11-08T15:56:24",
      "content": "   Im Streit um den Chiphersteller Nexperia könnte es Bewegung geben: Die Regierung in Peking zeigte sich gegenüber den Niederlanden gesprächsbereit, um den Konflikt beizulegen. Auch die EU vermeldet Fortschritte.[mehr]",
      "content_length": 219,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Drohnen fliegen über Flughafen und Kernkraftwerk in Belgien",
      "link": "https://www.tagesschau.de/ausland/europa/belgien-drohnen-flughafen-akw-100.html",
      "published": "2025-11-10T06:54:12",
      "content": "   In Belgien hat es erneut Vorfälle mit Drohnen unbekannter Herkunft gegeben. Es gab Sichtungen über einem wichtigen Flughafen und einem AKW. Nach Deutschland hilft nun auch Großbritannien mit Spezialisten.[mehr]",
      "content_length": 213,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Neue Vorwürfe gegen SOS-Kinderdorf",
      "link": "https://www.tagesschau.de/ausland/europa/oesterreich-sos-kinderdoerfer-missbrauch-100.html",
      "published": "2025-11-08T10:39:13",
      "content": "   Die Berichte über Gewalt und Missbrauch in österreichischen SOS-Kinderdörfern sorgten zuletzt für Entsetzen. Die Organisation bemüht sich um Aufarbeitung - doch nun kommen neue Vorwürfe ans Licht. Von Alexandra Pöhler. [mehr]",
      "content_length": 228,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Wie Rumäniens Urwälder illegaler Rodung zum Opfer fallen",
      "link": "https://www.tagesschau.de/ausland/europa/rumaenien-waelder-abholzung-100.html",
      "published": "2025-11-08T05:51:27",
      "content": "   Einer der letzten großen Urwälder Europas befindet sich in Rumänien. Doch Millionen von Kubikmetern Holz werden dort illegal geschlagen, Korruption und schwache Kontrollen helfen dabei. Umweltschützer leben gefährlich. Von Anna Tillack.[mehr]",
      "content_length": 245,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Dänemark will Mindestalter von 15 Jahren für Social Media einführen",
      "link": "https://www.tagesschau.de/ausland/europa/daenemark-verbot-sozialer-medien-100.html",
      "published": "2025-11-07T16:30:18",
      "content": "   Das dänische Parlament will ein Mindestalter von 15 Jahren für die Nutzung sozialer Medien einführen. Doch noch sind viele Fragen offen. Vor allem ist unklar, wann und wie das Gesetz umgesetzt werden soll.[mehr]",
      "content_length": 214,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "EU schränkt Vergabe von Schengen-Visa an russische Staatsbürger ein",
      "link": "https://www.tagesschau.de/ausland/europa/eu-einschraenkung-schengen-visa-russland-100.html",
      "published": "2025-11-07T14:30:48",
      "content": "   Bereits vergangenen Monat hat die EU die Grenzkontrollen für russische Diplomaten erschwert. Nun sollen alle russischen Staatsbürger die härteren Einreise-Bedingungen zu spüren bekommen. Ausnahmen gibt es nur noch wenige.[mehr]",
      "content_length": 230,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Weitere Drohnensichtung in Belgien: Flughafen Lüttich gesperrt",
      "link": "https://www.tagesschau.de/ausland/europa/flugverkehr-liege-drohne-100.html",
      "published": "2025-11-07T10:17:33",
      "content": "   Der belgische Flughafen Lüttich ist nach einer Drohnensichtung erneut kurzzeitig gesperrt worden. Es ist ein weiterer in einer Reihe von Vorfällen der letzten Tage, die nun auch Deutschland zum Eingreifen bewegen. [mehr]",
      "content_length": 223,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Bundeswehr unterstützt Belgien bei Drohnenabwehr",
      "link": "https://www.tagesschau.de/ausland/belgien-bundeswehr-drohnen-100.html",
      "published": "2025-11-06T21:16:43",
      "content": "   In Belgien häufen sich Drohnenvorfälle. Am Abend gab es einen neuen Vorfall am Flughafen Brüssel. Nun hilft Deutschland dem Nachbarland. Erste Vorauskräfte der Luftwaffe sind eingetroffen. Auch in Schweden gab es eine Drohnensichtung. [mehr]",
      "content_length": 244,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Frankreichs Rechnungshof kritisiert mangelhafte Sicherheit im Louvre",
      "link": "https://www.tagesschau.de/ausland/europa/louvre-sicherheitsmassnahmen-kritik-100.html",
      "published": "2025-11-06T12:58:36",
      "content": "   Der französische Rechnungshof übt scharfe Kritik am Sicherheitskonzept des Louvre. Wichtige Empfehlungen seien jahrelang nicht umgesetzt worden. Für die Sicherheit wurde nur ein Bruchteil des Budgets verwendet.[mehr]",
      "content_length": 219,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "EU-Staaten einigen sich auf Klimaziel für 2040",
      "link": "https://www.tagesschau.de/ausland/europa/eu-klimaziel-2040-cop-102.html",
      "published": "2025-11-05T12:55:45",
      "content": "   Die EU-Umweltminister haben sich zu einem neuen Klimaziel für 2040 durchgerungen, das von Zugeständnissen geprägt ist. Um bei der Weltklimakonferenz etwas vorweisen zu können, wurde es eine Marathonsitzung. Von Sabrina Fritz.[mehr]",
      "content_length": 234,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Frankreich: Autofahrer fährt mehrere Passanten an",
      "link": "https://www.tagesschau.de/ausland/europa/frankreich-vorfall-auto-100.html",
      "published": "2025-11-05T15:27:00",
      "content": "   Auf der westfranzösischen Atlantikinsel Île d’Oléron sind mehrere Menschen angefahren und verletzt worden. Der Autofahrer wurde festgenommen. Er ist der Polizei bereits mehrfach aufgefallen.[mehr]",
      "content_length": 199,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "EU will Reisezeiten von Zügen zwischen Metropolen verkürzen",
      "link": "https://www.tagesschau.de/ausland/europa/eu-zugverkehr-aktionsplan-100.html",
      "published": "2025-11-05T10:27:32",
      "content": "   Von Hauptstadt zu Hauptstadt in wenigen Stunden: Die EU will schnellere Zugreisen innerhalb Europas ermöglichen. Damit das Realität wird, müssen Netze modernisiert und Milliarden Euro ausgegeben werden.[mehr]",
      "content_length": 211,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Shutdown in den USA: Senat stimmt für Kompromissvorschlag",
      "link": "https://www.tagesschau.de/ausland/amerika/shutdown-148.html",
      "published": "2025-11-10T06:06:28",
      "content": "   Der US-Senat hat einen ersten Schritt zur Beendigung des Regierungsstillstands gemacht. Die Senatoren stimmten einem Kompromiss zu, der den Weg zu einer Übergangsfinanzierung freimachen könnte. Nun ist das Repräsentantenhaus gefragt.[mehr]",
      "content_length": 242,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Reportage aus Guyana: \"Der Ölboom übersteigt unsere Kapazitäten\"",
      "link": "https://www.tagesschau.de/ausland/amerika/guyana-oelboom-umwelt-100.html",
      "published": "2025-11-09T17:56:34",
      "content": "   Vor zehn Jahren wurden vor Guyana riesige Ölvorkommen entdeckt. Seitdem wächst die Ölindustrie rasant, boomt der Export. Doch die Armut ist noch lange nicht überwunden, und Sorgen vor den Umweltfolgen bleiben. Von J. Barke.[mehr]",
      "content_length": 232,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Lateinamerika-EU-Gipfel: Ein Treffen überschattet von Trump",
      "link": "https://www.tagesschau.de/ausland/amerika/celac-eu-lateinamerika-gipfel-trump-100.html",
      "published": "2025-11-09T10:04:11",
      "content": "   Eigentlich geht es beim EU-Lateinamerika-Gipfel in Kolumbien um eine engere Zusammenarbeit. Doch die jüngsten US-Angriffe auf mutmaßliche Drogenboote überschatten das Treffen - und die EU scheint das Thema am liebsten meiden zu wollen. Von M.-K. Boese und A. Demmer.[mehr]",
      "content_length": 275,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Nach Unglück - US-Behörde verhängt Flugverbot für MD-11-Maschinen",
      "link": "https://www.tagesschau.de/ausland/amerika/usa-flugverbot-mcdonnell-absturz-100.html",
      "published": "2025-11-09T09:04:46",
      "content": "   Kurz nach dem Start verliert eine Maschine des Frachtunternehmens UPS ein Triebwerk und stürzt ab. Nun haben die USA Konsequenzen gezogen, die Folgen für den weltweiten Transport haben könnte.[mehr]",
      "content_length": 201,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Deutschland hält sich auf der Klimakonferenz mit klaren Zusagen zurück",
      "link": "https://www.tagesschau.de/ausland/klimakonferenz-deutschland-zusagen-absichten-100.html",
      "published": "2025-11-09T05:36:17",
      "content": "   Die Ausgangslage auf der Weltklimakonferenz in Brasilien ist schwierig: Die USA sitzen nicht am Tisch, und die EU-Staaten reisen mit abgeschwächten Zielen an. Deutschland hält sich zudem zurück, eine Vorreiterrolle zu übernehmen. Von D. Hebestreit.[mehr]",
      "content_length": 257,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Hunderte Flüge ausgefallen - Sondersitzung zu Shutdown in USA",
      "link": "https://www.tagesschau.de/ausland/amerika/shutdown-usa-flugausfaelle-sondersitzung-100.html",
      "published": "2025-11-09T07:37:38",
      "content": "   In den USA sind erneut Tausende Flüge ausgefallen oder hatten enorme Verspätung. Grund ist der Personalmangel bei den Fluglotsen wegen des Haushaltsstreits, der nach wie vor nicht gelöst ist. Heute soll es eine Sondersitzung geben.[mehr]",
      "content_length": 240,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Syriens Interimspräsident al-Scharaa in USA eingetroffen",
      "link": "https://www.tagesschau.de/ausland/amerika/syrien-al-scharaa-usa-100.html",
      "published": "2025-11-09T01:45:51",
      "content": "   Es ist ein historischer Besuch: Nur einen Tag, nachdem er von der Terrorliste gestrichen wurde, ist Syriens Übergangspräsident al-Scharaa zu einem Staatsbesuch in den USA eingetroffen. Er und Präsident Trump wollen künftig zusammenarbeiten.[mehr]",
      "content_length": 249,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Reformer Paz als neuer Präsident Boliviens vereidigt",
      "link": "https://www.tagesschau.de/ausland/amerika/paz-vereidigung-102.html",
      "published": "2025-11-08T19:52:45",
      "content": "   In Bolivien geht eine fast 20 Jahre währende Ära linker Regierungen zu Ende: Mit Rodrigo Paz ist ein moderater Reformer als Präsident vereidigt worden. Die Herausforderungen in dem krisengeschüttelten Land sind groß.[mehr]",
      "content_length": 225,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Tornado in Brasilien zerstört Kleinstadt und fordert Tote und Verletzte",
      "link": "https://www.tagesschau.de/ausland/amerika/brasilien-tornado-100.html",
      "published": "2025-11-08T18:19:31",
      "content": "   Im Süden Brasiliens sind bei einem Tornado mindestens sechs Menschen ums Leben gekommen, Hunderte wurden verletzt. Eine Kleinstadt wurde fast völlig zerstört. Die Behörden warnen vor weiteren schweren Stürmen.[mehr]",
      "content_length": 218,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Zehntausende Menschen in Russland ohne Strom nach ukrainischen Angriffen",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-russland-angriffe-energie-100.html",
      "published": "2025-11-09T13:56:45",
      "content": "   Nach den massiven russischen Angriffen auf die ukrainische Energieinfrastruktur hat die Ukraine nun zum Gegenschlag ausgeholt: Im russischen Grenzgebiet wurde das Energienetz attackiert. Etwa 20.000 Haushalte waren zeitweise ohne Strom. [mehr]",
      "content_length": 246,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Russland greift massiv ukrainische Energieanlagen an",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-angriffe-energie-100.html",
      "published": "2025-11-08T18:43:38",
      "content": "   Russland hat wieder ukrainische Energieanlagen und andere Infrastruktur mit Raketen und Hunderten Drohnen angegriffen. Stromausfälle waren die Folge. Ein ORF-Reporter im Donbass hatte einen \"Schutzengel\", wie er sagt.[mehr]",
      "content_length": 226,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "NATO-Generalsekretär Rutte warnt Putin vor Atomwaffeneinsatz",
      "link": "https://www.tagesschau.de/ausland/europa/rutte-nato-abschreckung-100.html",
      "published": "2025-11-08T04:23:55",
      "content": "   Kremlchef Putin stellt immer wieder das Potenzial der russischen Atomwaffen heraus. NATO-Generalsekretär Rutte kritisiert die \"gefährliche nukleare Rhetorik\" und will stärker dagegen halten.[mehr]",
      "content_length": 199,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Was würde der Fall der Stadt Pokrowsk für die Ukraine bedeuten?",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-krieg-russland-pokrowsk-100.html",
      "published": "2025-11-07T10:53:05",
      "content": "   Die Kämpfe um die ukrainische Stadt Pokrowsk haben sich weiter verschärft. Experten zufolge würde ihr Fall zwar kein Ende der Verteidigung der Donbass-Region bedeuten - aber einen schweren moralischen Rückschlag für die Ukraine. Von S. Petersohn und K. Lutska.[mehr]",
      "content_length": 269,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Ukraine: Wie Selenskyj seine Macht in den Kommunen ausweitet",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-kommunale-selbstverwaltung-100.html",
      "published": "2025-11-07T07:58:30",
      "content": "   Die Regierung von Präsident Selenskyj beschränkt zunehmend die lokale Selbstverwaltung. In 200 Kommunen wurde schon eine Militärverwaltung eingesetzt - und in den übrigen Gemeinden steigt offenbar der Druck auf Politiker. Von F. Kellermann.[mehr]",
      "content_length": 249,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Experten befürchten Einkesselung ukrainischer Soldaten in Pokrowsk",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-pokrowsk-122.html",
      "published": "2025-11-06T01:32:41",
      "content": "   Seit mehr als einem Jahr versucht die russische Armee, die logistisch wichtige Stadt Pokrowsk im Osten der Ukraine einzunehmen. Jetzt befürchten viele Beobachter eine Einkesselung der ukrainischen Soldaten. Von Rebecca Barth.[mehr]",
      "content_length": 234,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Verletzte nach russischen Angriffen - Ukraine attackiert Ölindustrie",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-russland-angriffe-128.html",
      "published": "2025-11-04T17:39:34",
      "content": "   Die Ukraine hat erneut die russische Ölindustrie ins Visier genommen. In der Nacht gab es zahlreiche Drohnenangriffe. Auch Russland setzte seine Attacken fort - und meldete Fortschritte bei der Offensive gegen die Stadt Pokrowsk.[mehr]",
      "content_length": 238,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Russland meldet Vormarsch in strategisch wichtiger Stadt Pokrowsk",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-russland-vormarsch-pokrowsk-sumy-100.html",
      "published": "2025-11-03T15:31:55",
      "content": "   Seit mehr als einem Jahr versucht Russland die ukrainische Stadt Pokrowsk zu erobern und ist diesem Ziel nach eigenen Angaben nun näher gekommen. Auch andere ukrainische Landesteile melden russische Angriffe - etwa Sumy.[mehr]",
      "content_length": 229,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "11KM-Podcast: Wie Ukrainer ohne Strom und Wasser leben",
      "link": "https://www.tagesschau.de/ausland/europa/podcast-ukraine-alltag-100.html",
      "published": "2025-11-03T05:22:20",
      "content": "   Tage ohne Strom und Wasser sind Alltag in der Ukraine. 11KM erzählt, wie die Menschen sich an die Folgen der heftigen russischen Angriffe anpassen. Denn vor dem Kriegswinter zielen die gerade auf die Energieinfrastruktur.[mehr]",
      "content_length": 230,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Von Hamas übergebene Leiche ist verschleppter Soldat",
      "link": "https://www.tagesschau.de/ausland/asien/israel-hamas-leiche-102.html",
      "published": "2025-11-09T18:22:03",
      "content": "   Israel hat nach forensischen Untersuchungen die Identität einer von der militant-islamistischen Hamas ausgehändigten Leiche bestätigt. Es handele es sich um einen Soldaten, der bereits 2014 im Gazastreifen getötet wurde. [mehr]",
      "content_length": 230,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Ehemalige Geiseln der Hamas fordern Rückgabe aller Leichname",
      "link": "https://www.tagesschau.de/ausland/asien/israel-geiseln-rueckgabe-leichen-100.html",
      "published": "2025-11-09T00:23:22",
      "content": "   In Israel haben Tausende Menschen für die Rückgabe der sterblichen Überreste der letzten fünf Geiseln der Hamas demonstriert. Unter ihnen waren auch Personen, die bis vor kurzem selbst noch in der Gewalt der Terroristen waren.[mehr]",
      "content_length": 235,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Lange Trockenperiode: Trinkwasser in Teheran wird rationiert",
      "link": "https://www.tagesschau.de/ausland/asien/iran-wasserrationierung-100.html",
      "published": "2025-11-08T16:37:48",
      "content": "   Im Iran ist vielerorts seit Wochen kein Regen mehr gefallen, Stauseen haben zu wenig Wasser. 15 Millionen Menschen in der Hauptstadt Teheran wird deshalb nachts das Wasser abgedreht. Könnte das neue Proteste auslösen?[mehr]",
      "content_length": 226,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Israelisch-libanesische Grenze: Wiederaufbau mit Ungewissheit",
      "link": "https://www.tagesschau.de/ausland/asien/israel-libanon-wiederaufbau-100.html",
      "published": "2025-11-08T03:37:27",
      "content": "   Metulla im Norden Israels ist umgeben von libanesischen Dörfern. Viele Häuser wurden im Krieg mit der Hisbollah beschädigt oder zerstört. Nun kehren Anwohner zurück und bauen den Ort wieder auf. Doch die Waffenruhe ist zerbrechlich. Von Bettina Meier.[mehr]",
      "content_length": 260,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Von Hamas übergebene Leiche war letzte deutsche Geisel",
      "link": "https://www.tagesschau.de/ausland/asien/israel-hamas-148.html",
      "published": "2025-11-05T19:54:30",
      "content": "   Eine am Dienstag von der Hamas an Israel übergebene Leiche ist identifiziert worden: Es handelt sich um die sterblichen Überreste der letzten Geisel mit deutscher Staatsbürgerschaft. Die Familie des Toten hatte Kanzler Merz getroffen.[mehr]",
      "content_length": 243,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Deutschland entschärft Reisehinweise für Israel",
      "link": "https://www.tagesschau.de/ausland/deutschland-israel-reisewarnung-100.html",
      "published": "2025-11-04T14:44:24",
      "content": "   Deutschland hat eine Reisewarnung für Israel aufgehoben. Außenminister Wadephul begründete den Schritt mit gewachsenem Vertrauen in den Friedensprozess. Die Waffenruhe im Gazastreifen bleibt aber brüchig.[mehr]",
      "content_length": 213,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "30 Jahre nach Rabin-Ermordung: \"Jemanden wie ihn brauchen wir heute\"",
      "link": "https://www.tagesschau.de/ausland/asien/rabin-ermordung-jahrestag-100.html",
      "published": "2025-11-04T03:58:47",
      "content": "   Vor 30 Jahren wurde Israels Premier Rabin nach einer Friedenskundgebung erschossen. Zum Jahrestag erinnern in Tel Aviv mehr als 100.000 Menschen an den Politiker, der den Dialog mit den Palästinensern suchte. Von B. Meier.[mehr]",
      "content_length": 231,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Video-Leak: Israels Militäranwältin nach Rücktritt festgenommen",
      "link": "https://www.tagesschau.de/ausland/asien/militaeranwaeltin-israel-festnahme-100.html",
      "published": "2025-11-03T09:32:01",
      "content": "   Das geleakte Video hatte 2024 Empörung ausgelöst: Es zeigt offenbar, wie israelische Soldaten einen Palästinenser misshandeln. Erst trat die oberste Militäranwältin wegen des Leaks zurück - jetzt wurde sie festgenommen.[mehr]",
      "content_length": 228,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Hamas übergibt weitere Leichen israelischer Geiseln",
      "link": "https://www.tagesschau.de/ausland/asien/hamas-leichen-geiseln-100.html",
      "published": "2025-11-03T07:08:34",
      "content": "   Die Terrororganisation Hamas hat dem Roten Kreuz erneut Leichen übergeben. Inzwischen bestätigte die israelische Armee, dass es sich um die sterblichen Überreste von in den Gazastreifen verschleppten Soldaten handelt.[mehr]",
      "content_length": 226,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Hunderte Vermisste nach Bootsunglück vor Malaysia",
      "link": "https://www.tagesschau.de/ausland/asien/malaysia-bootsunglueck-100.html",
      "published": "2025-11-09T15:40:17",
      "content": "   Zwischen Malaysia und Thailand ist mindestens ein Boot mit geflüchteten Rohingya an Bord gekentert. Mindestens sieben Personen wurden tot geborgen, die Behörden suchen noch nach Hunderten Vermissten und zwei weiteren Booten.[mehr]",
      "content_length": 233,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Nach \"Kalmaegi\": Philippinen wappnen sich für nächsten Taifun",
      "link": "https://www.tagesschau.de/ausland/asien/taifune-philippinen-vietnam-100.html",
      "published": "2025-11-08T13:36:30",
      "content": "   Nur wenige Tage nach der Verwüstung durch Taifun \"Kalmaegi\" müssen sich die Philippinen auf einen neuen Wirbelsturm vorbereiten. \"Fung-Wong\" könnte sich zu einem Supertaifun entwickeln und noch verheerender werden.[mehr]",
      "content_length": 223,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "China stellt seinen dritten Flugzeugträger in Dienst",
      "link": "https://www.tagesschau.de/ausland/asien/china-flugzeugtraeger-in-dienst-100.html",
      "published": "2025-11-07T07:56:47",
      "content": "   Es ist ein Meilenstein für die chinesische Marine: Der selbst entwickelte Flugzeugträger \"Fujian\" ist offiziell in Dienst gestellt worden. Das Schiff ist deutlich größer und moderner als die beiden Vorgänger.[mehr]",
      "content_length": 217,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Taifun \"Kalmaegi\" erreicht Vietnam - Chaos auf den Philippinen",
      "link": "https://www.tagesschau.de/ausland/asien/taifun-kalmaegi-vietnam-100.html",
      "published": "2025-11-07T04:35:25",
      "content": "   Erst die Philippinen, jetzt Vietnam: Taifun \"Kalmaegi\" hinterlässt mit Toten und Überschwemmungen eine Spur der Zerstörung. Auf den Philippinen stieg die Zahl der Todesopfer auf 188. Und dem Land nähert sich schon der nächste Tropensturm.[mehr]",
      "content_length": 247,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Japans Armee geht nach tödlichen Angriffen gegen Bären vor",
      "link": "https://www.tagesschau.de/ausland/asien/japan-baeren-angriffe-miltaer-100.html",
      "published": "2025-11-05T12:11:42",
      "content": "   Sie griffen Kunden in einem Supermarkt an, attackierten einen Touristen und zerfleischten einen Badmitarbeiter: Seit April haben Bären in Japan zwölf Menschen getötet. Nun soll die Armee das Problem in den Griff bekommen.[mehr]",
      "content_length": 230,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "E-Mail des Bundesinnenministeriums schockt Afghanen auf der Flucht",
      "link": "https://www.tagesschau.de/ausland/asien/aufnahmezusagen-afghanistan-102.html",
      "published": "2025-11-05T09:03:55",
      "content": "   Die E-Mail des deutschen Innenministeriums lässt Hunderte Afghanen verzweifelt zurück: Statt von Deutschland aufgenommen zu werden, sollen sie für Geld in ihre Heimat zurückkehren. Für viele ist das keine Option. Von Peter Hornung.[mehr]",
      "content_length": 240,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Dauerregen und Sturmfluten: Tote und Verletzte durch Taifun auf Philippinen",
      "link": "https://www.tagesschau.de/ausland/asien/vietnam-philippinen-taifun-102.html",
      "published": "2025-11-04T13:42:54",
      "content": "   In Südostasien hat ein Taifun die Philippinen erreicht. Trotz einer großen Evakuierungsaktion starben mindestens 44 Menschen. In den nächsten Tagen wird der Wirbelsturm in Vietnam erwartet. [mehr]",
      "content_length": 199,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Dauerregen und Sturmfluten: Taifun trifft Philippinen und bedroht Vietnam",
      "link": "https://www.tagesschau.de/ausland/asien/vietnam-philippinen-taifun-100.html",
      "published": "2025-11-04T08:29:06",
      "content": "   In Südostasien hat ein Taifun die Philippinen erreicht. Mehrere Menschen kamen ums Leben. In den nächsten Tagen wird der Wirbelsturm in Vietnam erwartet. Dort kamen bei Überschwemmungen bereits mindestens 40 Menschen ums Leben.[mehr]",
      "content_length": 236,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Sieben Tote bei Lawinenunglück in Nepal",
      "link": "https://www.tagesschau.de/ausland/asien/nepal-lawine-100.html",
      "published": "2025-11-04T07:21:42",
      "content": "   Sie wollten den Yalung Ri in Nepal besteigen, doch dann traf eine Lawine ihr Basislager: Im Himalaya sind sieben Bergsteiger ums Leben gekommen. Die Rettungsarbeiten auf fast 5.000 Metern Höhe sind schwierig. [mehr]",
      "content_length": 218,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Blockade von Treibstoff-Einfuhr: Islamisten legen Mali lahm",
      "link": "https://www.tagesschau.de/ausland/afrika/mali-islamisten-treibstoff-100.html",
      "published": "2025-11-09T11:25:53",
      "content": "   Mali steht nahezu still. Islamisten haben das westafrikanische Land weitgehend von Benzin- und Diesellieferungen abgeschnitten. Eine Zermürbungstaktik, die die Wut auf Malis Militärregierung schüren soll. Von Karin Bensch.[mehr]",
      "content_length": 231,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Miliz im Sudan stimmt Waffenruhe zu - Reaktion der Regierung steht aus",
      "link": "https://www.tagesschau.de/ausland/afrika/sudan-waffenruhe-106.html",
      "published": "2025-11-06T19:21:39",
      "content": "   Massenmorde, Vergewaltigungen und Hungernde - der Bürgerkrieg im Sudan gilt als einer der schlimmsten Konflikte weltweit. Nun hat die RSF-Miliz einer Feuerpause zugestimmt. Die Reaktion der Militärregierung steht noch aus.[mehr]",
      "content_length": 231,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Immer mehr Hinweise auf Gräueltaten im sudanesischen Al-Faschir",
      "link": "https://www.tagesschau.de/ausland/afrika/sudan-darfur-gewalt-102.html",
      "published": "2025-11-06T03:00:46",
      "content": "   Massenhinrichtungen, Vergewaltigungen, äußerste Brutalität - Berichte über die Situation im sudanesischen Al-Faschir bestätigen die Hinweise auf Gräueltaten an Zivilisten. In der Stadt sitzen wohl noch 150.000 Menschen fest. Von Heiko Wirtz.[mehr]",
      "content_length": 250,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Al-Faschir: Weltstrafgericht will Gräueltaten in Al-Faschir untersuchen",
      "link": "https://www.tagesschau.de/ausland/afrika/sudan-448.html",
      "published": "2025-11-03T17:05:34",
      "content": "   Nach Berichten über Gräueltaten in Al-Faschir im Sudan hat der Internationale Strafgerichtshof eine Untersuchung angekündigt. Derweil flüchten laut UN Zehntausende aus der Region Kordofan - aus Angst vor Kämpfen.[mehr]",
      "content_length": 221,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Wie reagieren Menschen in Nigeria auf Trumps Drohung?",
      "link": "https://www.tagesschau.de/ausland/afrika/nigeria-reaktionen-drohung-trump-100.html",
      "published": "2025-11-03T14:57:23",
      "content": "   US-Präsident Trump hatte Nigeria mit einem Militäreinsatz gedroht, sollten Christen nicht besser vor Gewalt geschützt werden. In Nigeria sorgt das für Schlagzeilen. Doch die Lage ist komplexer, als von Trump dargestellt. Von K. Bensch.[mehr]",
      "content_length": 244,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Tansanias Präsidentin Hassan zur Wahlsiegerin erklärt",
      "link": "https://www.tagesschau.de/ausland/afrika/tansania-wahlsieg-praesidentin-hassan-100.html",
      "published": "2025-11-01T08:46:51",
      "content": "   Die Wahlkommission hat Tansanias Präsidentin mit fast 98 Prozent der Stimmen zur Wahlsiegerin erklärt. Seit Tagen wird das Land von Protesten erschüttert - Kritiker werfen ihr massive Repressionen vor.[mehr]",
      "content_length": 210,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "UN-Sicherheitsrat unterstützt Marokkos Westsahara-Autonomieplan",
      "link": "https://www.tagesschau.de/ausland/afrika/westsahara-un-sicherheitsrat-100.html",
      "published": "2025-11-01T00:45:00",
      "content": "   Im jahrzehntelangen Konflikt um die Westsahara haben elf von 15 Mitglieder des UN-Sicherheitsrats für den marokkanischen Autonomieplan gestimmt. In Marokko führte das zu spontanen Feiern auf den Straßen.[mehr]",
      "content_length": 212,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Tansania: Schwere Unruhen nach umstrittener Wahl",
      "link": "https://www.tagesschau.de/ausland/afrika/tansania-wahl-proteste-100.html",
      "published": "2025-10-31T19:29:35",
      "content": "   In Tansania kommt es nach umstrittenen Wahlen am dritten Tag infolge zu gewaltsamen Protesten. Es gibt Berichte über Tote und Verletzte. Die Opferzahlen gehen jedoch weit auseinander.[mehr]",
      "content_length": 192,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Westsahara: Starker Wind und ungeklärte Zukunft",
      "link": "https://www.tagesschau.de/ausland/afrika/westsahara-marokko-un-100.html",
      "published": "2025-10-30T13:54:38",
      "content": "   Vor 50 Jahren marschierte Marokko in die Westsahara ein. Durch gewaltige Investitionen versucht das Land, Fakten zu schaffen. Doch Diplomaten und Völkerrechtler warnen vor weltweiten Folgen einer Annexion. Von S. Ehlert und S. Kisters.[mehr]",
      "content_length": 244,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Neuer Nationalpark in Australien soll Koalas schützen",
      "link": "https://www.tagesschau.de/ausland/ozeanien/koala-nationalpark-australien-100.html",
      "published": "2025-09-08T13:31:56",
      "content": "   Koalas sind vom Aussterben bedroht. Ein riesiger neuer Nationalpark in ihrer Heimat Australien soll nun Tausenden der Tiere Lebensraum und Schutz bieten. Der WWF spricht von einer echten Chance.[mehr]",
      "content_length": 203,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Australien macht den Iran für antisemitische Anschläge verantwortlich",
      "link": "https://www.tagesschau.de/ausland/ozeanien/australien-iran-ausweisung-botschafter-100.html",
      "published": "2025-08-26T06:07:33",
      "content": "   Australien weist den Botschafter des Iran aus - ein lange nicht da gewesener diplomatischer Schritt. Hintergrund sind antisemitische Anschläge in Australien. Laut Regierung ist erwiesen, dass Irans Führung den Auftrag dazu gegeben hat.[mehr]",
      "content_length": 244,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Korallenbleiche im Great Barrier Reef erreicht Rekordausmaß",
      "link": "https://www.tagesschau.de/ausland/ozeanien/australien-great-barrier-reef-korallenbleiche-100.html",
      "published": "2025-08-07T12:43:32",
      "content": "   Das 2.300 Kilometer lange Great Barrier Reef vor der Küste Australiens gehört zum UNESCO-Weltnaturerbe. Doch der Klimawandel setzt ihm immer mehr zu. Wissenschaftler blicken mit Sorge in die Zukunft. Von Udo Schmidt. [mehr]",
      "content_length": 226,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Australien will auch YouTube für Kinder unter 16 Jahren beschränken",
      "link": "https://www.tagesschau.de/ausland/ozeanien/australien-youtube-verbot-100.html",
      "published": "2025-07-30T11:17:25",
      "content": "   Erst Insta, TikTok &amp; Co - und jetzt auch YouTube. Australien will die Nutzung der Videoplattform für Minderjährige einschränken. Wer unter 16 Jahren ist, soll sich kein Konto mehr anlegen dürfen.[mehr]",
      "content_length": 208,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Giftige Algenblüte tötet massenhaft Meerestiere vor Südaustralien",
      "link": "https://www.tagesschau.de/ausland/ozeanien/algenbluete-suedaustralien-naturkatastrophe-100.html",
      "published": "2025-07-23T11:11:17",
      "content": "   An der Südküste Australiens kommt es derzeit zu einem massenhaften Sterben von Meerestieren. Grund ist eine Alge, die sich dort stark ausbreitet. Es herrscht Verzweiflung und Fassungslosigkeit. Von Udo Schmidt.[mehr]",
      "content_length": 219,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Anträge auf Klima-Asyl in Australien: Tausende wollen weg aus Tuvalu",
      "link": "https://www.tagesschau.de/ausland/ozeanien/tuvalu-australien-klimawandel-100.html",
      "published": "2025-07-21T12:28:47",
      "content": "   Malerisch liegt Tuvalu im Pazifik, doch der Inselstaat droht unterzugehen. Australien hat angeboten, die Bevölkerung aufzunehmen - Tausende haben sich beworben. Thorsten Iffland und Anna-Lou Beckmann über die Sorge der Inselbewohner.[mehr]",
      "content_length": 242,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Klimawandel: Warum Bewohner von Tuvalu nach Australien ziehen",
      "link": "https://www.tagesschau.de/ausland/ozeanien/tuvalu-bewohner-klimawandel-100.html",
      "published": "2025-07-21T09:42:52",
      "content": "   Etwa 10.000 Menschen leben in Tuvalu. Doch der Inselstaat im Südpazifik droht wegen des steigenden Meeresspiegels unterzugehen. Die Hälfte der Bevölkerung hat bereits ein Klimavisum beantragt - in Australien. [mehr]",
      "content_length": 218,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Berichterstattung weltweit: Die Korrespondentinnen und Korrespondenten der ARD",
      "link": "https://www.tagesschau.de/korrespondenten",
      "published": "2024-09-09T11:44:16",
      "content": "   Die rund 100 Auslands-Korrespondentinnen und Korrespondenten sind das Rückgrat der ARD-Nachrichtensendungen. Sie berichten aus 28 Studios weltweit - im Fernsehen, im Hörfunk und Online.[mehr]",
      "content_length": 194,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Brasilien - 30. UNO-Klimakonferenz beginnt in Belém",
      "link": "https://www.deutschlandfunk.de/30-uno-klimakonferenz-beginnt-in-bel-m-106.html",
      "published": "2025-11-10T07:02:03",
      "content": "In der brasilianischen Stadt Belém beginnt heute die 30. UNO-Klimakonferenz. An den zweiwöchigen Verhandlungen beteiligen sich Delegationen aus mehr als 190 Staaten. Insgesamt werden 50.000 Teilnehmer erwartet.",
      "content_length": 210,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "30. UNO-Klimakonferenz - BDI fordert mehr Effizienz und Wettbewerb in der Energiepolitik",
      "link": "https://www.deutschlandfunk.de/bdi-fordert-mehr-effizienz-und-wettbewerb-in-der-energiepolitik-100.html",
      "published": "2025-11-10T07:02:03",
      "content": "Vor dem heutigen Beginn der 30. UNO-Klimakonferenz hat der Bundesverband der Deutschen Industrie für mehr Effizienz und Wettbewerb in der Energiepolitik geworben. Der Hochlauf der Erneuerbaren werde am Ende das Spiel gewinnen, sagte der stellvertretende Hauptgeschäftsführer Lösch im Deutschlandfunk. Allerdings dauere dies länger als geplant.",
      "content_length": 343,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "COP30 - Klimakonferenz in Brasilien: Das sind die wichtigsten Themen",
      "link": "https://www.deutschlandfunk.de/klimakonferenz-in-brasilien-das-sind-die-wichtigsten-themen-100.html",
      "published": "2025-11-10T07:02:03",
      "content": "Vertreter von fast 200 Staaten wollen sich von heute an im brasilianischen Belém auf neue Vorgaben für den Klimaschutz verständigen. Die USA nehmen nicht an der UNO-Konferenz teil.",
      "content_length": 180,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Berlin - Bundesregierung über Zukunft von Heizungsgesetz weiter uneins",
      "link": "https://www.deutschlandfunk.de/bundesregierung-ueber-zukunft-von-heizungsgesetz-weiter-uneins-100.html",
      "published": "2025-11-10T07:02:03",
      "content": "Vertreter der Bundesregierung haben erneut ihre teils unterschiedlichen Positionen zum künftigen Umgang mit dem sogenannten Heizungsgesetz zum Ausdruck gebracht. CSU-Chef Söder plädierte für eine Streichung des Gesetzes und widersprach damit Umweltminister Schneider.",
      "content_length": 267,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Ex-Parteichefin - Kramp-Karrenbauer will Lammert an der Spitze der CDU-nahen Konrad-Adenauer-Stiftung ablösen",
      "link": "https://www.deutschlandfunk.de/kramp-karrenbauer-will-lammert-an-der-spitze-der-cdu-nahen-konrad-adenauer-stiftung-abloesen-100.html",
      "published": "2025-11-10T07:02:03",
      "content": "Die ehemalige CDU-Chefin Kramp-Karrenbauer ist im Gespräch als künftige Vorsitzende der Konrad-Adenauer-Stiftung.",
      "content_length": 113,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Haushaltssperre - US-Senat stimmt für Beratungen über einen Übergangsetat",
      "link": "https://www.deutschlandfunk.de/us-senat-stimmt-fuer-beratungen-ueber-einen-uebergangsetat-102.html",
      "published": "2025-11-10T07:02:03",
      "content": "In den USA haben Republikaner und Demokraten einen ersten Schritt unternommen, um die seit mehr als 40 Tagen andauernde Haushaltssperre zu beenden.",
      "content_length": 147,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Südkorea - Weitere Anklage gegen Ex-Präsidenten Yoon",
      "link": "https://www.deutschlandfunk.de/weitere-anklage-gegen-ex-praesidenten-yoon-100.html",
      "published": "2025-11-10T07:02:03",
      "content": "In Südkorea hat die Staatsanwaltschaft weitere Vorwürfe gegen den früheren Präsidenten Yoon erhoben.",
      "content_length": 100,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Großbritannien - BBC-Generaldirektor und Nachrichtenchefin treten nach Kritik an Beitrag über Trump zurück",
      "link": "https://www.deutschlandfunk.de/bbc-generaldirektor-und-nachrichtenchefin-treten-nach-kritik-an-beitrag-ueber-trump-zurueck-100.html",
      "published": "2025-11-10T07:02:03",
      "content": "Nach Kritik an einem BBC-Beitrag über US-Präsident Trump sind der Generaldirektor der britischen Rundfunkanstalt, Davie, und die Nachrichtenchefin Turness zurückgetreten. Auslöser war ein internes Memo, das dem \"Daily Telegraph\" zugespielt wurde.",
      "content_length": 246,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Landgericht - Prozess um Anschlag auf den Magdeburger Weihnachtsmarkt beginnt",
      "link": "https://www.deutschlandfunk.de/prozess-um-anschlag-auf-den-magdeburger-weihnachtsmarkt-beginnt-100.html",
      "published": "2025-11-10T07:02:03",
      "content": "Fast elf Monate nach dem Anschlag auf den Magdeburger Weihnachtsmarkt beginnt heute vor dem Landgericht der Prozess gegen den Täter.",
      "content_length": 132,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Wehrpflicht - Verteidigungsausschuss berät in öffentlicher Sitzung",
      "link": "https://www.deutschlandfunk.de/verteidigungsausschuss-beraet-in-oeffentlicher-sitzung-102.html",
      "published": "2025-11-10T07:02:03",
      "content": "Der Verteidigungsausschuss des Bundestags befasst sich heute mit der künftigen Ausgestaltung der Wehrpflicht.",
      "content_length": 109,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Rede zur Pogromnacht - AfD kritisiert Steinmeiers Äußerung zu Parteiverbotsverfahren",
      "link": "https://www.deutschlandfunk.de/afd-kritisiert-steinmeiers-aeusserung-zu-parteiverbotsverfahren-100.html",
      "published": "2025-11-10T07:02:03",
      "content": "Die AfD hat die Äußerungen von Bundespräsident Steinmeier zu einem möglichen Parteiverbotsverfahren scharf kritisiert.",
      "content_length": 118,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Kultusministerkonferenz - Schülerzahl in Deutschland steigt bis 2032 deutlich an",
      "link": "https://www.deutschlandfunk.de/schuelerzahl-in-deutschland-steigt-bis-2032-deutlich-an-100.html",
      "published": "2025-11-10T07:02:03",
      "content": "Die Zahl der Schüler in Deutschland wird in den kommenden Jahren deutlich steigen.",
      "content_length": 82,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Bolivien - Bundesaußenminister Wadephul (CDU) berät in Bolivien über Lithium-Lieferungen",
      "link": "https://www.deutschlandfunk.de/bundesaussenminister-wadephul-cdu-beraet-in-bolivien-ueber-lithium-lieferungen-100.html",
      "published": "2025-11-10T07:02:03",
      "content": "In Bolivien berät Bundesaußenminister Wadephul heute mit Wirtschaftsvertretern unter anderem über Lithium-Lieferungen nach Deutschland.",
      "content_length": 135,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Washington - US-Präsident Trump empfängt Syriens Übergangspräsident al-Scharaa",
      "link": "https://www.deutschlandfunk.de/us-praesident-trump-empfaengt-syriens-uebergangspraesident-al-scharaa-100.html",
      "published": "2025-11-10T07:02:03",
      "content": "Als erster syrischer Staatschef seit der Unabhängigkeit des Landes 1946 wird Übergangspräsident al-Scharaa heute im Weißen Haus in Washington empfangen.",
      "content_length": 152,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Belgien - Drohnen über Kernkraftwerk und Flughafen gesichtet",
      "link": "https://www.deutschlandfunk.de/drohnen-ueber-kernkraftwerk-und-flughafen-gesichtet-102.html",
      "published": "2025-11-10T07:02:03",
      "content": "In Belgien sind drei Drohnen über einem Kernkraftwerk in der Nähe von Antwerpen gesichtet worden.",
      "content_length": 97,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Berlin - Nach Äußerungen des israelischen Botschafters: Linkspartei wehrt sich gegen Schuldzuweisungen bezüglich Antisemitismus",
      "link": "https://www.deutschlandfunk.de/nach-aeusserungen-des-israelischen-botschafters-linkspartei-wehrt-sich-gegen-schuldzuweisungen-bezue-102.html",
      "published": "2025-11-10T07:02:03",
      "content": "Auch die Linkspartei hat vor einem erstarkenden Antisemitismus in Deutschland gewarnt und zugleich Schuldzuweisungen an das linke Lager zurückgewiesen. Die Vorsitzenden von Bundespartei und Bundestagsfraktion erklärten, aufrichtiges Gedenken verpflichte zu mehr als nur dem bloßen Erinnern.",
      "content_length": 290,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Paris - Entscheidung über weitere Haft von Ex-Präsident Sarkozy",
      "link": "https://www.deutschlandfunk.de/entscheidung-ueber-weitere-haft-von-ex-praesident-sarkozy-102.html",
      "published": "2025-11-10T07:02:03",
      "content": "Ein Berufungsgericht in Paris entscheidet heute, ob der frühere französische Präsident Sarkozy nach seiner Verurteilung in der Libyen-Affäre das Gefängnis unter Auflagen wieder verlassen darf.",
      "content_length": 192,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Gaza - Israel bestätigt Identität des übergebenen Leichnams - verschleppter Soldat Hadar Goldin",
      "link": "https://www.deutschlandfunk.de/israel-bestaetigt-identitaet-des-uebergebenen-leichnams-verschleppter-soldat-hadar-goldin-106.html",
      "published": "2025-11-10T07:02:03",
      "content": "Bei dem heute von der Hamas im Gazastreifen übergebenen Leichnam handelt es sich um einen 2014 getöteten israelischen Soldaten.",
      "content_length": 127,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Mali - Afrikanische Union fordert internationale Antwort auf Benzin-Blockade",
      "link": "https://www.deutschlandfunk.de/afrikanische-union-fordert-internationale-antwort-auf-benzin-blockade-106.html",
      "published": "2025-11-10T07:02:03",
      "content": "Die Afrikanische Union hat sich besorgt über die anhaltende Benzin-Blockade durch Dschihadisten in Mali geäußert.",
      "content_length": 113,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Unwetter - Super-Taifun \"Fung-wong\" erreicht Philippinen - Mehr als eine Million Menschen evakuiert",
      "link": "https://www.deutschlandfunk.de/super-taifun-fung-wong-erreicht-philippinen-mehr-als-eine-million-menschen-evakuiert-110.html",
      "published": "2025-11-10T07:02:03",
      "content": "Der Taifun \"Fung-wong\" hat die Philippinnen erreicht.",
      "content_length": 53,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Spanien - Riesenwellen an Teneriffas Küste reißen Menschen ins Meer - drei Tote und mehrere Verletzte",
      "link": "https://www.deutschlandfunk.de/riesenwellen-an-teneriffas-kueste-reissen-menschen-ins-meer-drei-tote-und-mehrere-verletzte-104.html",
      "published": "2025-11-10T07:02:03",
      "content": "An den Küsten der spanischen Insel Teneriffa sind drei Menschen durch sogenannte Riesenwellen ums Leben gekommen.",
      "content_length": 113,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Fußball - Bundesligist Wolfsburg entlässt Trainer Simonis",
      "link": "https://www.deutschlandfunk.de/bundesligist-wolfsburg-entlaesst-trainer-simonis-104.html",
      "published": "2025-11-10T07:02:03",
      "content": "Fußball-Bundesligist Wolfsburg hat sich von seinem Trainer Paul Simonis getrennt. Damit zog der Verein zwei Tage nach der 1:2-Niederlage gegen Werder Bremen die Konsequenzen aus der sportlichen Krise in dieser Saison.",
      "content_length": 217,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Fußball-Bundesliga - Freiburg gewinnt gegen St. Pauli, Stuttgart besiegt Augsburg, Frankfurt punktet gegen Mainz",
      "link": "https://www.deutschlandfunk.de/freiburg-gewinnt-gegen-st-pauli-stuttgart-besiegt-augsburg-frankfurt-punktet-gegen-mainz-104.html",
      "published": "2025-11-10T07:02:03",
      "content": "In der Fußball-Bundesliga hat der SC Freiburg den dritten Saisonerfolg geschafft und gegen den FC St. Pauli mit 2:1 gewonnen. Für die Hamburger geht damit die Negativ-Serie ohne Siege weiter. Stuttgart dreht das Spiel gegen Augsburg und stürzt die Fuggerstädter weiter in die Krise.",
      "content_length": 282,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Formel 1 in São Paulo - Norris gewinnt Großen Preis von Brasilien",
      "link": "https://www.deutschlandfunk.de/norris-gewinnt-grossen-preis-von-brasilien-106.html",
      "published": "2025-11-10T07:02:03",
      "content": "In der Formel 1 hat Lando Norris den Großen Preis von Brasilien gewonnen. Der McLaren-Pilot kam vor dem Mercedes-Fahrer Kimi Antonelli ins Ziel, Weltmeister Max Verstappen wurde im Red Bull Dritter. In der WM-Wertung baute Norris seine Führung weiter aus.",
      "content_length": 255,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Wetter - Im Westen wechselnd, sonst dicht bewölkt, örtlich etwas Regen",
      "link": "https://www.deutschlandfunk.de/im-westen-wechselnd-sonst-dicht-bewoelkt-oertlich-etwas-regen-108.html",
      "published": "2025-11-10T07:02:03",
      "content": "Das Wetter: Vielfach bewölkt oder neblig-trüb, örtlich etwas Regen. 7 bis 13 Grad.",
      "content_length": 82,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Tanzania police arrest opposition party official after deadly election protests",
      "link": "https://www.theguardian.com/world/2025/nov/08/tanzania-officials-seek-arrest-key-opposition-figures-fatal-election-protests--samia-suluhu-hassan-",
      "published": "2025-11-08T15:17:47",
      "content": "Chadema party says deputy secretary general arrested and calls election of incumbent president fraudulentTanzanian authorities have detained a senior official from the main opposition party, Chadema, amid a spate of arrests in connection to deadly protests during elections last week.More than 1,000 people were killed by security forces during the demonstrations, according to Chadema and human rights bodies. The Tanzanian government has said these figures were exaggerated but did not give its own figures. Continue reading...",
      "content_length": 529,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Trump says US will boycott G20 summit in South Africa, citing treatment of white farmers",
      "link": "https://www.theguardian.com/us-news/2025/nov/07/trump-boycott-g20-south-africa-white-farmers",
      "published": "2025-11-07T22:57:16",
      "content": "Administration has long accused South Africa of allowing white Afrikaner farmers to be persecuted and attackedDonald Trump said Friday that no US government officials would be attending the Group of 20 summit this year in South Africa, citing the country’s treatment of white farmers.The US president had already announced he would not attend the annual summit for heads of state from the globe’s leading and emerging economies. JD Vance had been scheduled to attend in Trump’s place, but a person familiar with Vance’s plans who was granted anonymity to talk about his schedule said Vance would no longer travel there for the summit. Continue reading...",
      "content_length": 654,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Civil rescue groups in Mediterranean cut ties with Libyan coastguard",
      "link": "https://www.theguardian.com/world/2025/nov/07/civil-rescue-groups-in-mediterranean-cut-ties-with-libyan-coastguard",
      "published": "2025-11-07T15:58:35",
      "content": "Accusations of violent interceptions and human rights violations levelled at EU-funded Libyan services by NGOsMore than a dozen NGO rescue vessels operating in the Mediterranean have suspended communication with the Libyan coastguard, citing escalating incidents of asylum seekers being violently intercepted at sea and taken to camps rife with torture, rape and forced labour.The 13 search-and-rescue organisations described their decision as a rejection of mounting pressure by the EU, and Italy in particular, to share information with the Libyan coastguard, which receives training, equipment and funding from the EU. Continue reading...",
      "content_length": 641,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "UK rejected atrocity prevention plans for Sudan despite warning of possible genocide",
      "link": "https://www.theguardian.com/global-development/2025/nov/07/aid-cuts-uk-rejected-atrocity-prevention-sudan-civilians-rsf-massacres-el-fasher",
      "published": "2025-11-07T06:00:19",
      "content": "Exclusive: British government adopted ‘least ambitious’ option months before RSF’s massacres in El FasherBritain rejected atrocity prevention plans for Sudan despite intelligence warnings that the city of El Fasher would fall amid a wave of ethnic cleansing and possible genocide, according to a report seen by the Guardian.Government officials turned down the plans six months into the 18-month siege of El Fasher in favour of the “least ambitious” option of four presented. Continue reading...",
      "content_length": 495,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Sudanese militia group accused of war crimes agrees to a ceasefire",
      "link": "https://www.theguardian.com/world/2025/nov/06/sudanese-militia-group-accused-of-war-crimes-agrees-to-a-ceasefire",
      "published": "2025-11-06T18:38:21",
      "content": "International mediators broker three-month halt to civil war as further evidence emerges of mass civilian killingsA Sudanese paramilitary group accused of killing thousands of unarmed civilians in an ethnically motivated massacre has agreed to a truce.The Rapid Support Forces (RSF), which is facing mounting criticism over apparent war crimes committed by its fighters in the city of El Fasher last month, said it had agreed to a “humanitarian ceasefire” put forward by the quad countries of the US, Egypt, the UAE and Saudi Arabia. Continue reading...",
      "content_length": 553,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Guyana in turmoil after opposition leader arrested and faces US extradition",
      "link": "https://www.theguardian.com/world/2025/nov/08/guyana-azruddin-nazar-mohamed-arrested-us-extradition",
      "published": "2025-11-08T13:00:04",
      "content": "Azruddin Mohamed had emerged as a surprise contender in the presidential election and claims political persecutionGuyana has been thrown into political turmoil following the arrest and possible extradition to the United States of the country’s main opposition leader just two months after he emerged as the surprise contender in the presidential election that kept incumbent Irfaan Ali in power.Azruddin Mohamed, 38, and his father, Nazar Mohamed, 73, two of Guyana’s wealthiest figures thanks to their gold mining empire, were arrested on 31 October in the capital, Georgetown, in response to a formal extradition request from the US government. Continue reading...",
      "content_length": 666,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Carney survives two confidence votes on budget, quashing fears of winter election",
      "link": "https://www.theguardian.com/world/2025/nov/08/carney-confidence-vote-canada-budget",
      "published": "2025-11-08T11:00:01",
      "content": "Minority government benefitted from opposition members voting across the aisle, paving way for billions in spendingCanada’s prime minister Mark Carney’s minority government has survived two confidence votes on its budget, quashing fears – for now – of a winter federal election.The Liberals managed to pass the second of three votes on the plan on Friday, paving the way for tens of billions in new spending. Continue reading...",
      "content_length": 428,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Iran accused of plot to assassinate Israeli ambassador to Mexico",
      "link": "https://www.theguardian.com/world/2025/nov/07/iran-assassination-plot-israel-ambassador-mexico",
      "published": "2025-11-07T17:49:52",
      "content": "Israel says Mexico thwarted attempt in aftermath of deadly 2024 Israeli bombing of Iranian embassy in SyriaThe United States and Israel have accused Iran of plotting to assassinate Israel’s ambassador to Mexico, in what would be the latest attempt to take the two countries’ conflict to another region.Israel said that Mexican authorities intervened to stop the attempt to kill the ambassador, Einat Kranz-Neiger. Continue reading...",
      "content_length": 433,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Over 100 US leaders to attend Cop30 climate summit as Trump stays away",
      "link": "https://www.theguardian.com/environment/2025/nov/07/cop30-climate-trump-us-officials",
      "published": "2025-11-07T11:00:38",
      "content": "Dozens of US state and local leaders will be at talks in Brazil with president’s team expected to send no representativesThe Trump administration appears to be sitting out this month’s United Nations climate talks known as Cop30, telling the Guardian it will not deploy any high-level representatives to the negotiations.But dozens of US subnational leaders attend to promote their climate efforts. Continue reading...",
      "content_length": 418,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "US strikes another alleged drug boat bringing death toll from campaign in Latin America to 70",
      "link": "https://www.theguardian.com/us-news/2025/nov/07/us-strikes-another-alleged-drug-boat-latin-america",
      "published": "2025-11-07T04:25:33",
      "content": "US strikes have destroyed at least 18 vessels, but Washington has yet to make public any concrete evidence that its targets posed a threat to AmericaUS forces struck another alleged drug trafficking boat in the Caribbean, killing three people, defense secretary Pete Hegseth has said, bringing the death toll from the Trump administration’s controversial campaign to at least 70.The US began carrying out such strikes – which some experts say amount to extrajudicial killings even if they target known traffickers – in early September, taking aim at vessels in the Caribbean and eastern Pacific. Continue reading...",
      "content_length": 615,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Fury as Indonesia declares late authoritarian ruler Suharto a national hero",
      "link": "https://www.theguardian.com/world/2025/nov/10/indonesia-declares-president-suharto-national-hero",
      "published": "2025-11-10T04:37:34",
      "content": "Suharto presided over a period marked by rampant corruption, nepotism, censorship and allegations of mass human rights abusesIndonesia has awarded former authoritarian leader Suharto the title of national hero, in a move that has sparked accusations of historical revisionism in the world’s third-largest democracy.The award has deepened fears about attempts to whitewash Suharto’s rise and decades-long rule, a period marked by rampant corruption, censorship and accusations of mass human rights violations. Continue reading...",
      "content_length": 528,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "More than 1 million evacuated in the Philippines as Typhoon Fung-wong makes landfall",
      "link": "https://www.theguardian.com/world/2025/nov/09/more-than-100000-evacuated-in-the-philippines-as-fung-wong-intensifies-into-super-typhoon",
      "published": "2025-11-09T19:20:12",
      "content": "At least two people found dead as super-typhoon hits Philippines, days after Typhoon Kalmaegi killed at least 224More than 1 million people have been evacuated from their homes in the Philippines and at least two people have been killed as Typhoon Fung-wong – the second big storm to hit in days – made landfall on the east coast.The super-typhoon crossed over the north of the archipelago’s most populous island, Luzon, with torrential rain, sustained winds of 115mph (185km/h) and gusts of up to 140mph (225km/h). Continue reading...",
      "content_length": 535,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "‘Loophole’ in sanctions allowing Russian oil to be imported to Australia through port part-owned by Macquarie Bank",
      "link": "https://www.theguardian.com/australia-news/2025/nov/09/loophole-russian-sanctions-oil-imported-to-australia",
      "published": "2025-11-08T23:00:15",
      "content": "Australia stopped buying fuel directly from Russia after its invasion of Ukraine but has imported more than 3m tonnes of its oil products since 2023Get our breaking news email, free app or daily news podcastMillions of tonnes of Russian oil have been traded through a port part-owned by Macquarie Bank and potentially sold on to Australian businesses, new data shows.The identification of a new link between Australia and the trade in Russian-origin products exposes further gaps in government sanctions, as Australia lags behind the EU and the UK in tightening import rules. Continue reading...",
      "content_length": 595,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "US and China seek to project power with huge and expensive aircraft carriers",
      "link": "https://www.theguardian.com/world/2025/nov/08/us-china-aircraft-carriers-naval-fleet-defence",
      "published": "2025-11-08T05:00:53",
      "content": "China launches £5.4bn ship capable of carrying 60 aircraft that Beijing values as much for maintaining its global influence as for its use in warfare In port, the 80,000-tonne Fujian aircraft carrier would be impossible to miss. More than 300 metres long and capable of carrying about 60 aircraft, the £5.4bn super-vessel places China second among the world’s navies, with three aircraft carriers, though still a long way behind the global leader, the US, which has 11.Yet for all the great power projection of the new warship, nearly 5,000 miles away from its home port another conflict appears to suggest size may not matter. In the Black Sea, Ukraine achieved an extraordinary military success by inflicting a “functional defeat” on Russia’s naval fleet using swarms of skilfully targeted sea drones. Continue reading...",
      "content_length": 823,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "At least 54 people injured in explosions at Indonesian school mosque",
      "link": "https://www.theguardian.com/world/2025/nov/07/jakarta-indonesia-high-school-mosque-explosions",
      "published": "2025-11-07T18:31:49",
      "content": "Authorities say suspect is 17-year-old male student and warn against terrorist attack speculation after Jakarta blasts At least 54 people have been injured in explosions that shook a mosque at a high school during Friday prayers in the Indonesian capital, Jakarta. Authorities later said the suspect was a 17-year-old male student who had been injured and was undergoing surgery.Witnesses told local television stations that they heard at least two loud blasts at about midday, just as the sermon had started, from inside and outside the mosque at SMA 72, a state high school within a navy compound in Jakarta’s northern Kelapa Gading neighbourhood. Continue reading...",
      "content_length": 669,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "NSW MP rebuffed by security after asking to relocate planned neo-Nazi protest away from parliament",
      "link": "https://www.theguardian.com/australia-news/2025/nov/10/nsw-mp-rebuffed-by-security-after-asking-to-relocate-planned-neo-nazi-protest-away-from-building",
      "published": "2025-11-10T06:48:18",
      "content": "Greg Piper says one of his staffers told him about the protest and his request to move it away from the building was rejectedGet our breaking news email, free app or daily news podcastThe New South Wales speaker says he knew about Saturday’s neo-Nazi rally outside parliament the day before it took place, but was told his request to relocate the protest from the front of the building was not possible.Greg Piper, the house speaker in NSW’s Legislative Assembly, told Guardian Australia a member of his staff advised him about the planned rally late on Friday afternoon. Continue reading...",
      "content_length": 591,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Jacinta Nampijinpa Price backs out as headlining speaker at anti-immigration rally due to feature Tommy Robinson",
      "link": "https://www.theguardian.com/australia-news/2025/nov/10/jacinta-nampijinpa-price-backs-out-speaker-anti-immigration-put-australia-first-rally-tommy-robinson",
      "published": "2025-11-10T06:42:19",
      "content": "Exclusive: Rallies, organised by anti-lockdown protester Monica Smit and others, are set to go ahead in Sydney, Melbourne and Brisbane at the end of NovemberGet our breaking news email, free app or daily news podcastLiberal Jacinta Nampijinpa Price backed out as the headlining speaker at an upcoming anti-immigration protest spanning several of Australia’s cities that was inspired by rightwing protests in the UK in September.The Northern Territory senator announced shortly before midday on Friday she was “honoured” to join the rally against “mass immigration” and net zero. Less than 24 hours later, and after Guardian Australia contacted Nampijinpa Price’s office with questions, her announcement was wiped from social media. Continue reading...",
      "content_length": 751,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Jay Weatherill named next high commissioner to UK – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/nov/10/australia-news-live-john-laws-radio-social-media-age-ban-reserve-bank-pauline-hanson-sussan-ley-anthony-albanese-net-zerontwnfb",
      "published": "2025-11-10T05:59:21",
      "content": "This blog is now closedJacinta Nampijinpa Price backs out as headlining speaker at anti-immigration rally due to feature Tommy RobinsonGet our breaking news email, free app or daily news podcastAlbanese says outrage over Joy Division shirt ‘load of nonsense’Anthony Albanese has finally commented on the non-furore about his Joy Division T-shirt, calling it “a load of nonsense”.What a load of nonsense that was, hey? … It was rather extraordinary, I’ve got to say, but a few people commented exactly that on Friday night. Continue reading...",
      "content_length": 542,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Female NSW MPs Allegra Spender and Kellie Sloane report death and rape threats after condemning neo-Nazi rally in Sydney",
      "link": "https://www.theguardian.com/australia-news/2025/nov/10/neo-nazi-rally-sydney-female-nsw-mps-allegra-spender-kellie-sloane-death-rape-threats",
      "published": "2025-11-10T04:45:35",
      "content": "Allegra Spender and Kellie Sloane report threats to police, as premier says government is investigating whether ban on Nazi symbols should be expandedFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastTwo female MPs have reported the threats they received following their condemnation of Saturday’s neo-Nazi rally outside New South Wales parliament to the police, as the premier rejected any suggestion there was a “double standard” in how the far right is dealt with compared with pro-Palestine activism.The alleged threats against federal MP Allegra Spender and state MP Kellie Sloane, which included death threats and calls to “rhetorically rape” the federal MP, came after both took to social media to condemn Saturday’s rally, in which about 60 men held a banner calling for the abolition of the “Jewish lobby”, with speakers repeating antisemitic tropes. Continue reading...",
      "content_length": 942,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Twice as effective as nets: shark-spotting drones to become ‘permanent fixture’ on Queensland beaches",
      "link": "https://www.theguardian.com/environment/2025/nov/10/twice-as-effective-as-nets-shark-spotting-drones-to-become-permanent-fixture-on-queensland-beaches",
      "published": "2025-11-10T00:00:46",
      "content": "State government says expanded use of shark nets and drum lines will continue despite evidence of deadly impact on other marine lifeSign up for climate and environment editor Adam Morton’s free Clear Air newsletter hereQueensland will roll out shark-spotting drones to more beaches, after a major study found drones detected more than double the number of sharks caught in adjacent nets.But while drones would become a “permanent fixture” of the state’s shark-control operations, the Department of Primary Industries said Queensland would continue to rely on “traditional measures like nets and drum lines”, despite evidence of their deadly impact on dolphins, whales, turtles and dugongs. Continue reading...",
      "content_length": 709,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Who is ‘fedora man’? Dapper French teenager in viral Louvre heist photo unmasked",
      "link": "https://www.theguardian.com/world/2025/nov/10/fedora-man-louvre-photo-pedro-elias-garzon-delvaux",
      "published": "2025-11-10T00:59:47",
      "content": "Fifteen-year-old Pedro Elias Garzon Delvaux was captured looking suave in a  picture outside the Paris museum on the day of a crown jewels heistWhen 15-year-old Pedro Elias Garzon Delvaux realised an Associated Press photo of him at the Louvre on the day of the crown jewels heist had drawn millions of views, his first instinct was not to rush online and unmask himself.Quite the opposite. A fan of Sherlock Holmes and Hercule Poirot who lives with his parents and grandfather in Rambouillet, 30km (19 miles) from Paris, Pedro decided to let the mystery linger. Continue reading...",
      "content_length": 582,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Russian activist held in Poland admits he worked as FSB agent, court papers say",
      "link": "https://www.theguardian.com/world/2025/nov/09/russian-activist-held-in-poland-admits-he-worked-as-fsb-agent-court-papers-say",
      "published": "2025-11-09T16:31:41",
      "content": "Igor Rogov, who left Russia in 2021, due to go on trial accused of informing on other Russian opposition activistsA Russian opposition activist arrested in Poland and due to go on trial next month has admitted he worked as an undercover agent for Russia’s FSB security service and informed on other opposition figures, court documents claim.Igor Rogov, 30, has been associated with various opposition movements in the Russian city of Saransk, including Alexei Navalny’s Anti-Corruption Foundation and Open Russia, linked to the exiled businessman Mikhail Khodorkovsky. Continue reading...",
      "content_length": 588,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Bad Bridgets podcast about crime among Irish women in US inspires film",
      "link": "https://www.theguardian.com/tv-and-radio/2025/nov/09/bad-bridgets-podcast-about-irish-womens-lives-of-us-inspires-film",
      "published": "2025-11-09T15:00:35",
      "content": "Margot Robbie’s company to make movie based on Northern Ireland academics’ stories of poverty and prisonIt started as a trawl of dusty archives for an academic project about female Irish emigrants in Canada and the US by two history professors, a worthy but perhaps niche topic for research.The subjects, after all, were human flotsam from Ireland’s diaspora whose existence was often barely recorded, let alone remembered. Continue reading...",
      "content_length": 443,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Palestinian man dismissed from Gaza border assistance role to sue EU",
      "link": "https://www.theguardian.com/world/2025/nov/09/palestinian-man-dismissed-from-gaza-border-assistance-role-to-sue-eu",
      "published": "2025-11-09T13:00:14",
      "content": "Exclusive: Mohammed Baraka’s case alleges discrimination on basis of nationality after EU counterparts were transferredA Palestinian man who was dismissed from his job in Gaza after the war broke out is suing the European Union for allegedly breaching Belgian law.Mohammed Baraka, who worked at the EU border assistance mission (EUBam) at Rafah after its inception in 2006 as an unarmed civilian third-party presence, has filed his case in a Belgian court. Continue reading...",
      "content_length": 476,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Britain sends RAF specialists to help Belgium combat disruptive drones",
      "link": "https://www.theguardian.com/uk-news/2025/nov/09/britain-sends-raf-specialists-help-belgium-combat-disruptive-drones",
      "published": "2025-11-09T12:31:54",
      "content": "Incursions halted flights at Brussels and Liège airports last week with Russia said to be the most likely culpritBritain is deploying Royal Air Force specialists to help Belgium counter drone threats to the country’s airports after disruptive sightings last week that some politicians blamed on Russia.Sir Richard Knighton, the head of the UK’s armed forces, said the British military would provide “our people, our equipment” to help Belgium, though he was careful to say “we don’t yet know” the origin of the drones seen last week. Continue reading...",
      "content_length": 553,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Syrian president to hold talks with Trump at White House",
      "link": "https://www.theguardian.com/world/2025/nov/10/syrian-president-talks-trump-white-house",
      "published": "2025-11-10T05:00:54",
      "content": "Ahmed al-Sharaa is expected to push for full lifting of remaining sanctions imposed during 13-year civil warSyria’s president, Ahmed al-Sharaa, will on Monday hold talks with Donald Trump at the White House, the first such official visit by a Syrian leader since national independence in 1946. He is expected to push for a full lifting of the remaining sanctions on his war-ravaged country.Sharaa, whose Islamist rebel forces toppled the longtime ruler Bashar al-Assad late last year, has courted the US president to try to reverse the economic restrictions imposed during the 13-year civil war, arguing they are no longer justified. Continue reading...",
      "content_length": 653,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Water levels below 3% in dam reservoirs for Iran’s second city, say reports",
      "link": "https://www.theguardian.com/world/2025/nov/09/water-levels-below-3-percent-in-dam-reservoirs-for-iran-second-city-say-mashhad-reports",
      "published": "2025-11-09T12:37:36",
      "content": "Storage dwindles in Mashhad, home to 4 million people, as country struggles with droughtWater levels at the dam reservoirs supplying Iran’s north-eastern city of Mashhad have plunged below 3%, according to reports, as the country suffers from severe water shortages.“The water storage in Mashhad’s dams has now fallen to less than 3%,” Hossein Esmaeilian, the chief executive of the water company in Iran’s second largest city by population, told the ISNA news agency. Continue reading...",
      "content_length": 488,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Royal College of Psychiatrists faces member backlash over Qatar partnership",
      "link": "https://www.theguardian.com/society/2025/nov/09/royal-college-of-psychiatrists-faces-member-backlash-over-qatar-partnership",
      "published": "2025-11-09T06:00:25",
      "content": "More than 150 psychiatrists sign letter condemning contract to host exams in country with well-documented human rights abusesThe Royal College of Psychiatrists is facing a backlash from members over a controversial partnership with Qatar’s state healthcare provider.The college has signed a contract with the state-owned Hamad Medical Corporation to host international exams in Doha, enabling psychiatrists from across the Middle East and beyond to apply for membership. Continue reading...",
      "content_length": 490,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Syria carries out preemptive raids against Islamic State",
      "link": "https://www.theguardian.com/world/2025/nov/08/syria-carries-out-preemptive-strikes-against-islamic-state",
      "published": "2025-11-08T21:15:09",
      "content": "Security operations came as Syrian president Ahmed al-Sharaa arrived in Washington to meet Donald TrumpSyria has carried out nationwide preemptive operations targeting Islamic State cells, a spokesperson for the interior ministry said on Saturday, as the country’s president arrived in the US for talks with Donald Trump.Syrian security forces carried out 61 raids, with 71 people arrested and explosives and weapons seized, the spokesperson told state-run Al Ekhbariya TV. Continue reading...",
      "content_length": 493,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Israel’s underground jail, where Palestinians are held without charge and never see daylight",
      "link": "https://www.theguardian.com/world/2025/nov/08/israel-underground-jail-rakefet-palestinians-gaza-detainees",
      "published": "2025-11-08T12:24:02",
      "content": "Exclusive: Detainees at Rakefet include nurse deprived of natural light since January, and teenager held for nine monthsIsrael is holding dozens of Palestinians from Gaza isolated in an underground jail where they never see daylight, are deprived of adequate food and barred from receiving news of their families or the outside world.The detainees have included at least two civilians held for months without charge or trial: a nurse detained in his scrubs, and a young food seller, according to lawyers from the Public Committee Against Torture in Israel (PCATI) who represent both men. Continue reading...",
      "content_length": 607,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "British Asian families urged to share stories of ‘greatest generation’ who fought for Britain",
      "link": "https://www.theguardian.com/uk-news/2025/nov/09/british-asian-families-share-stories-greatest-generation-fought-for-britain",
      "published": "2025-11-09T07:00:27",
      "content": "Half of UK public unaware of contribution made by 2.5m British Asian members of armed forces who served in second world warBritish Asian families are being urged to record the experiences of relatives who fought for Britain for “future generations” as data reveals half the British public don’t know that Indian members of the armed forces served in the second world war.The My Family Legacy project, backed by the Royal British Legion, is building an online archive of Asian veterans’ experiences to raise awareness of the shared histories and sacrifices of Britain’s diverse communities. Continue reading...",
      "content_length": 609,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Hit for six: why India’s Women’s Cricket World Cup win is victory for equality",
      "link": "https://www.theguardian.com/world/2025/nov/07/india-women-cricket-world-cup-win-victory-equality",
      "published": "2025-11-07T14:00:01",
      "content": "Sacrifices made to reach final – defying social stigma, lack of resources and juggling jobs between training – makes victory still more extraordinaryGrowing up in rural India, Shafali Verma always knew she had a hunger to play cricket. But in her small town of Rohtak, in the north Indian state of Haryana, cricket was not a game for girls. Aged nine, desperate to play, she cut her hair short, entered a tournament disguised as her brother, and went on to win man of the match.Verma’s determined father, Sanjeev, in the face of refusal from every cricket academy or training centre who would not accept his daughter, enrolled her as a boy. “Luckily, nobody noticed,” he recalled, as Verma made her debut for the national women’s team at 15 years old. Continue reading...",
      "content_length": 771,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Dick Cheney, vice-president and giant of Republican politics, dies aged 84",
      "link": "https://www.theguardian.com/us-news/2025/nov/04/dick-cheney-vice-president-republican-bush-dies",
      "published": "2025-11-04T16:42:09",
      "content": "Cheney, who served under presidents from Nixon to George W Bush, will be remembered for controversial role after 9/11Dick Cheney created the ground for Trump’s excesses, despite their differencesDick Cheney, the divisive US vice-president under George W Bush who helped lead the country into a disastrous invasion of Iraq, died on Monday, his family has said. He was 84.Cheney at various times held the roles of member of Congress, White House chief of staff and secretary of defense, but it was as one of the country’s most powerful vice-presidents that he had the biggest impact, wielding great influence over the less experienced Bush. Continue reading...",
      "content_length": 658,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Five climbers and two guides killed in Nepal avalanche, say officials",
      "link": "https://www.theguardian.com/world/2025/nov/03/climbers-guides-killed-mount-yalung-ri-nepal-avalanche-officials",
      "published": "2025-11-03T16:13:00",
      "content": "Bad weather hampering rescue efforts after avalanche that swept through Mount Yalung Ri base camp on MondayAn avalanche has swept through a camp on Mount Yalung Ri in Nepal, killing five foreign climbers and two Nepali guides, officials said.Shailendra Thapa, an armed police force spokesperson, said five other people had been hurt at the base camp, located at 4,900 metres (16,070ft). Continue reading...",
      "content_length": 406,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Powerful Afghan earthquake leaves at least 20 dead and hundreds injured",
      "link": "https://www.theguardian.com/world/2025/nov/03/afghanistan-earthquake-death-toll-reportedly-damages-blue-mosque",
      "published": "2025-11-03T14:19:11",
      "content": "Northern provinces of Balkh and Samangan worst hit by magnitude 6.3 quake, which also damaged Mazar-i-Sharif’s Blue MosqueA powerful 6.3 magnitude earthquake shook northern Afghanistan before dawn on Monday, killing at least 20 people and injuring more than 640 others, 25 critically, a disaster management official said. Health officials said the numbers could rise.The US Geological Survey said the quake’s epicentre was located 22km (14 miles) south-west of the town of Khulm, and that it struck at 12.59am at a depth of 28km (17 miles). Continue reading...",
      "content_length": 560,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Documentary explores whether JMW Turner may have been neurodivergent",
      "link": "https://www.theguardian.com/artanddesign/2025/nov/10/documentary-jmw-turner-secret-sketchbooks-neurodivergence-bbc",
      "published": "2025-11-10T06:00:54",
      "content": "Programme uses artist’s sketches, drawings and watercolours to build unprecedented psychological portraitHe is widely regarded as England’s greatest painter, but despite his extraordinary output, elements of JMW Turner’s personality have remained a mystery.Now, a groundbreaking BBC documentary delves into Turner’s 37,000 sketches, drawings and watercolours to build an unprecedented psychological portrait, one that raises the possibility that Turner’s singular vision was shaped by childhood trauma and neurodivergence. Continue reading...",
      "content_length": 542,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Crisis charity to become a landlord in attempt to rectify ‘catastrophic’ housing in UK",
      "link": "https://www.theguardian.com/society/2025/nov/10/crisis-charity-to-become-a-landlord-in-attempt-to-rectify-catastrophic-housing-in-uk",
      "published": "2025-11-10T05:00:54",
      "content": "Exclusive: Homelessness charity planning to buy properties as it can no longer rely on access to social housing‘Similar pressure to London’: the housing crisis reaches NewcastleThe homelessness charity Crisis is going to become a landlord for the first time in its 60-year history, saying the housing crisis in the UK has reached a “catastrophic scenario”.Matt Downie, the charity’s chief executive, said it was preparing to launch a fundraising appeal to buy its own housing stock as it can longer get access to social housing to help homeless people. Continue reading...",
      "content_length": 572,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "No link between paracetamol in pregnancy and autism or ADHD in children, review finds",
      "link": "https://www.theguardian.com/lifeandstyle/2025/nov/10/no-link-between-paracetamol-tylenol-in-pregnancy-and-autism-or-adhd-in-children-review-finds",
      "published": "2025-11-10T00:01:46",
      "content": "Wide-ranging review finds no convincing connection after Trump said women should ‘fight like hell’ to avoid painkillerA wide-ranging review into paracetamol use by pregnant women has found no convincing link between the common painkiller and the chances of children being diagnosed with autism and ADHD.Publication of the work was fast-tracked to provide prospective mothers and their doctors with reliable information after the Trump administration urged pregnant women to avoid paracetamol – also known as acetaminophen or Tylenol – claiming it was contributing to rising rates of autism. Continue reading...",
      "content_length": 610,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Will Tim Davie’s resignation be enough to restore public trust in the BBC?",
      "link": "https://www.theguardian.com/media/2025/nov/09/tim-davies-resignation-restore-public-trust-in-bbc",
      "published": "2025-11-09T20:47:32",
      "content": "Senior insiders admit concern about big editorial errors and fear attacks are part of ongoing campaign to undermine the broadcasterThere is a joke regularly deployed by BBC staff that “deputy heads must roll” over big mistakes because they rarely appear to have any impact on those at the top of the organisation. That all changed on Sunday, when Tim Davie and Deborah Turness both quit their jobs.Davie oversaw no shortage of scandals during his five years as director general – in recent months these included rows over a Gaza documentary and Glastonbury coverage – and was nicknamed “Teflon Tim” by BBC insiders because nothing seemed to stick. Continue reading...",
      "content_length": 667,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "‘I have to take ultimate responsibility’: Tim Davie’s BBC resignation statement",
      "link": "https://www.theguardian.com/media/2025/nov/09/tim-davie-bbc-resignation-statement-deborah-turness",
      "published": "2025-11-09T19:58:12",
      "content": "Full text of director general’s note to staff and the resignation statement from head of news Deborah TurnessDavie resigns as BBC director general after accusations of ‘serious and systemic’ bias in coverageBBC bias row: how a week of hostile headlines from rightwing media led to resignationsTim Davie, the BBC’s director general, and the head of BBC News have resigned after a former adviser to the corporation accused it of “serious and systemic” bias in its coverage of issues including Donald Trump, Gaza and trans rights.This afternoon Davie sent the following note to staff:Dear all,I wanted to let you know that I have decided to leave the BBC after 20 years. This is entirely my decision, and I remain very thankful to the Chair and Board for their unswerving and unanimous support throughout my entire tenure, including during recent days.Dear all,I have never been more proud of the work that you do every day. You really are the best of the best. Continue reading...",
      "content_length": 978,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "US Senate vote marks step towards ending federal shutdown",
      "link": "https://www.theguardian.com/us-news/2025/nov/09/senate-moves-vote-federal-government-shutdown",
      "published": "2025-11-10T02:46:09",
      "content": "Senators vote on advancing House-passed stopgap funding bill, suggesting end to historic 40-day shutdown in reachThe US Senate on Sunday took a key vote on a bill that would end the record-setting federal government shutdown without extending the healthcare subsidies that Democrats have demanded.Senators began voting on Sunday night to advance House-passed stopgap funding legislation that Senate majority leader John Thune said would be amended to combine another short-term spending measure with a package of three full-year appropriations bills. Continue reading...",
      "content_length": 570,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Growth in global demand for ‘green’ office buildings slows amid Trump policies",
      "link": "https://www.theguardian.com/business/2025/nov/10/growth-in-global-demand-for-green-office-buildings-slows-amid-trump-policies",
      "published": "2025-11-10T00:01:45",
      "content": "Fall reported by Royal Institution of Chartered Surveyors as UN calls for accelerated action in buildings sector to meet global climate goalsThe growth in global demand for “green” office buildings has slowed after Donald Trump’s assault on environmental protection policies caused a slump in interest in the US, according to a survey of construction industry professionals.Building occupiers and investors across North America and South America expressed significantly lower growth in demand for green commercial buildings, a shift that “seems to be in response to a change in US policy focus”, according to a survey of members of the Royal Institution of Chartered Surveyors (Rics). Reported demand across the rest of the world also fell, albeit not as sharply. Continue reading...",
      "content_length": 783,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Trump booed at Commanders NFL game before calling plays from Fox broadcast booth",
      "link": "https://www.theguardian.com/sport/2025/nov/09/donald-trump-commanders-nfl-game-fan-reaction",
      "published": "2025-11-09T23:44:19",
      "content": "President greeted with jeers by many fans at gameTrump has appeared at several sports events this yearDonald Trump became the first sitting US president in nearly 50 years to attend a regular-season NFL game when he dropped in on the Detroit Lions’ win over the Washington Commanders on Sunday.There were boos from large sections of fans, as well as scattered cheers, at the Commanders’ Northwest Stadium when Trump was shown on the screens late in the first half – and again when the president was introduced by the stadium announcer at halftime. The Washington DC area has strong Democratic support, while Trump’s cuts to the government have affected many workers in the vicinity of the Commanders’ stadium. Sunday was not the first time Trump has received a hostile reception from a Washington sports crowd: he was greeted with ‘lock him up’ chants at the Washington Nationals’ home stadium during the 2019 World Series. Continue reading...",
      "content_length": 943,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Trump shares false claim Obama earned $40m in ‘royalties’ from Obamacare",
      "link": "https://www.theguardian.com/us-news/2025/nov/09/trump-obama-obamacare-royalties-claim",
      "published": "2025-11-09T22:09:27",
      "content": "US president promoted fictional claim from satirical website that has been debunked repeatedly since 2017Donald Trump promoted the false claim that Barack Obama has earned $40m in “royalties linked to Obamacare” in a post to his 11 million followers on Truth Social on Sunday.The fictional claim that the former US president receives royalty payments for the use of his name to refer to the Affordable Care Act, which he signed into law in 2010, has been repeatedly debunked since at least 2017, when it was featured on America’s Last Line of Defense, a satirical website that produces fake news reports designed to generate engagement from outraged conservatives. Continue reading...",
      "content_length": 684,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Trump weighs giving Americans $2,000 from tariff revenues in bid for support",
      "link": "https://www.theguardian.com/us-news/2025/nov/09/trump-tariffs-refund",
      "published": "2025-11-09T19:50:15",
      "content": "Congressional approval would likely be required for plan to take effect, an idea Trump has floated beforeDonald Trump on Sunday mused about giving most Americans $2,000 funded by tariff revenues collected by the president’s administration – an evident bid to rally public support on the issue.“A dividend of at least $2000 a person (not including high income people!) will be paid to everyone,” Trump wrote on his Truth Social platform on Sunday. Continue reading...",
      "content_length": 466,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Paris court to hear Sarkozy’s request to be freed from jail pending appeal",
      "link": "https://www.france24.com/en/france/20251110-paris-court-hear-sarkozy-request-be-freed-jail-pending-appeal",
      "published": "2025-11-10T06:25:53",
      "content": "Former French president Nicolas Sarkozy's request to be released from prison pending appeal will be heard by a Paris court Monday less than five weeks after the ex-head of state began serving a five-year prison sentence for conspiring to raise campaign funds from former Libyan dictator Muammar Gaddafi.",
      "content_length": 303,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "France's Fontainebleau forest serves as ‘laboratory' for climate change adaptation",
      "link": "https://www.france24.com/en/france/20251110-france-fontainebleau-forest-serves-as-laboratory-for-climate-change-adaptation",
      "published": "2025-11-10T06:21:55",
      "content": "France’s Fontainebleau forest – one of the world's first nature reserves – has felt the impacts of the climate crisis for many years. Now the beloved forest, situated just 60 kilometres southeast of Paris, has become a “laboratory” for the rest of the country’s forests in how to adapt to a warming world.",
      "content_length": 305,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Ligue 1: PSG gets narrow win over Lyon to go back up to 1st in standings",
      "link": "https://www.france24.com/en/tv-shows/sports/20251110-ligue-1-psg-gets-narrow-win-over-lyon-to-go-back-up-to-1st-in-standings",
      "published": "2025-11-10T06:14:53",
      "content": "Paris Saint-Germain won (3-2) away at Olympique Lyonnais. PSG are back at the top of the table, while OL are 7th.",
      "content_length": 113,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "US senators reach deal aimed at ending longest government shutdown in history",
      "link": "https://www.france24.com/en/americas/20251110-us-senators-government-shutdown",
      "published": "2025-11-10T03:15:59",
      "content": "The US Senate on Sunday advanced a bill to end the government shutdown after moderate Democrats agreed to drop demands for an immediate extension of health care subsidies, angering progressives. Lawmakers voted 60-40 in a procedural step toward passing compromise funding legislation, with final approval expected in coming days.",
      "content_length": 329,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Ecuador prison riot turns deadly as 27 inmates found asphyxiated, four shot dead",
      "link": "https://www.france24.com/en/americas/20251110-ecuador-prison-riot-asphyxiated",
      "published": "2025-11-10T02:59:21",
      "content": "At least 27 inmates were found dead from asphyxiation Sunday at Ecuador’s Machala prison in El Oro province, hours after an armed riot killed four others and injured dozens, authorities said.",
      "content_length": 191,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Lebanon vows crackdown on illicit finance after US sanctions Hezbollah members",
      "link": "https://www.france24.com/en/middle-east/20251109-lebanon-terror-financing-president-us",
      "published": "2025-11-09T23:47:29",
      "content": "Lebanese President Joseph Aoun told visiting US officials Sunday that Beirut was combating money laundering and terrorism financing, days after Washington sanctioned three Hezbollah members. The US delegation visited as Washington moves to curb funding for Iran-backed Hezbollah and push for its disarmament.",
      "content_length": 308,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "BBC director resigns after row over Trump documentary edit",
      "link": "https://www.france24.com/en/europe/20251109-bbc-boss-tim-davie-resigns-after-criticism-over-trump-documentary-edit",
      "published": "2025-11-09T18:55:31",
      "content": "The director general of Britain's BBC, Tim Davie, and the chief executive of news, Deborah Turness, have stepped down following criticism over bias at the corporation, including in the way it edited a speech by US President Donald Trump.",
      "content_length": 237,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Debate over Carlson’s interview highlights internal conservative tensions regarding nationalism",
      "link": "https://www.france24.com/en/video/20251109-debate-over-carlson-s-interview-highlights-internal-conservative-tensions-regarding-nationalism",
      "published": "2025-11-09T17:29:23",
      "content": "The Heritage Foundation, an influential conservative think tank, is in turmoil after its leader defended former Fox News host Tucker Carlson, who interviewed white nationalist and Holocaust denier Nick Fuentes on his popular online show. France24 International Affairs Editor Kethevane Gorjestani joins for more.",
      "content_length": 312,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Iran: Dams almost empty in Mashhad, home to 4 million people",
      "link": "https://www.france24.com/en/video/20251109-iran-dams-almost-empty-in-mashhad-home-to-4-million-people",
      "published": "2025-11-09T16:23:39",
      "content": "Water levels at the dam reservoirs supplying Iran’s north-eastern city of Mashhad have plunged below 3%, according to reports, as the country suffers from severe water shortages. Director of the United Nations University for Water, Environment and Health, Kaveh Madani, gives his insights on this critical drought in Iran.",
      "content_length": 322,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "US shutdown hits 40th day, senators seeking breakthrough work through weekend",
      "link": "https://www.france24.com/en/americas/20251109-us-shutdown-hits-40th-day-senators-seeking-breakthrough-work-through-weekend",
      "published": "2025-11-09T14:50:08",
      "content": "The US government shutdown entered its 40th day Sunday with senators still deadlocked over a plan to reopen federal agencies. Disputes over health care subsidies stalled efforts to end a standoff that has halted paychecks, snarled air travel, and threatened food aid for millions.",
      "content_length": 280,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Iraq: Early parliament polls begin with security forces and displaced people able to vote today",
      "link": "https://www.france24.com/en/video/20251109-iraq-early-parliament-polls-begin-with-security-forces-and-displaced-people-able-to-vote-today",
      "published": "2025-11-09T14:23:12",
      "content": "Members of Iraq’s security forces, along with internally displaced citizens, began voting in the parliamentary elections on Sunday - the sixth since the 2003 US-led invasion that toppled Saddam Hussein. Polls opened at 7 am for 1.3 million security personnel across 809 polling centers and will close at 6 pm before they are deployed to provide security on the main election day on Tuesday. France24 correspondent Lina Malers reports the latest from Baghdad, Iraq.",
      "content_length": 464,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "France: Paris court to rule on Sarkozy's release",
      "link": "https://www.france24.com/en/video/20251109-france-paris-court-to-rule-on-sarkozy-s-release",
      "published": "2025-11-09T14:21:49",
      "content": "Former French President Nicolas Sarkozy is set to learn the outcome of his appeal for release. Tomorrow,  Monday, starting at 9:30 am, the Paris Court of Appeal will review the request submitted by his lawyers. What criteria will the court take into account, and in what form could his release be granted? Daniel Quinlan reports.",
      "content_length": 329,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Syrian president al-Sharaa arrives in US for landmark White House visit",
      "link": "https://www.france24.com/en/video/20251109-syrian-president-al-sharaa-arrives-in-us-for-landmark-white-house-visit",
      "published": "2025-11-09T12:45:23",
      "content": "Syrian President Ahmed al-Sharaa arrived in the US on Ssturday where he is due to meet with President Donald Trump at the White House – the first such visit by a Syrian president since the country's independence in 1946. Ahead of al-Sharaa's visit the leader was removed from the US terrorism blacklist. Shirli Sitbon has this story.",
      "content_length": 333,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Ukraine scrambles for energy as Russian attacks put power generation at 'zero'",
      "link": "https://www.france24.com/en/video/20251109-ukraine-scrambles-for-energy-as-russian-attacks-put-power-generation-at-zero",
      "published": "2025-11-09T12:44:01",
      "content": "Ukraine faced power cuts of up to 16 hours across most regions on Sunday operators said, as the country scrambles to make repairs after massive Russian attacks targeted its energy infrastructure. The national energy provider said the attacks had put its generating capacity down to \"zero\", adding to the risk of heating outages in the coming months. France24 correspondent Emmanuelle Chaze reports from Kharkiv.",
      "content_length": 411,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Israeli army says Red Cross has received remains of hostage from Hamas in Gaza",
      "link": "https://www.france24.com/en/middle-east/20251109-hamas-says-it-will-hand-over-body-of-israeli-soldier-hadar-goldin",
      "published": "2025-11-09T12:38:43",
      "content": "",
      "content_length": 0,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "UK to send defence equipment to help Belgium combat drone disruptions",
      "link": "https://www.france24.com/en/europe/20251109-uk-to-send-defence-equipment-to-help-belgium-combat-drone-disruptions",
      "published": "2025-11-09T11:02:04",
      "content": "The UK will send defence experts and equipment to Belgium to help it respond to drone sightings over military bases and airports, the head of the armed fores said on Sunday. Moscow has denied any connection to the incidents as European defence leaders have said the drones could be a form of Russian \"hybrid warfare\".",
      "content_length": 317,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Mali faces worsening jihadist violence amid fears of regional spillover",
      "link": "https://www.france24.com/en/video/20251109-mali-faces-worsening-jihadist-violence-amid-fears-of-regional-spillover",
      "published": "2025-11-09T10:41:31",
      "content": "Mali’s fuel shortage shows no signs of easing, leaving residents of the capital, Bamako, struggling to secure petrol for everyday needs. The crisis stems from a blockade of imports by the al-Qaeda-linked jihadist group JNIM, which aims to cripple the economy and pressure the government into change. Senior researcher at University of Beyrouth, Dr. Adam Sandor, gives his insights.",
      "content_length": 381,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "The week in pictures: New York elects Mayor Mamdani, Shein arrives in Paris and a baby hippo",
      "link": "https://www.france24.com/en/culture/20251109-the-week-in-pictures-new-york-mayor-mamdani-shein-arrives-in-paris-and-a-baby-hippo",
      "published": "2025-11-09T10:28:40",
      "content": "New York elected democratic socialist Zohran Mamdani its new mayor, Chinese e-commerce giant Shein faced suspension in France as it opened its first-ever physical store in Paris and a baby hippo made her debut appearance at Berlin zoo. FRANCE 24 takes a look back at the week's most striking images.",
      "content_length": 299,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Italy: Hundreds of heritage sites at risk amid funding shortages",
      "link": "https://www.france24.com/en/video/20251109-italy-hundreds-of-heritage-sites-at-risk-amid-funding-shortages",
      "published": "2025-11-09T10:27:10",
      "content": "Heritage preservation groups in Italy are raising the alarm — nearly 450 historic sites are reportedly at risk due to age and insufficient maintenance funding. Just days ago, a 13th-century tower collapsed in central Rome, killing one person and seriously injuring three others. The tragedy has renewed calls for support from the private sector and the European Union. This report from our sister channel France 2 is narrated by Nick Rushworth.",
      "content_length": 444,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Zohran Mamdani makes history as New York City’s first South Asian mayor",
      "link": "https://www.france24.com/en/video/20251109-zohran-mamdani-makes-history-as-new-york-city-s-first-south-asian-mayor",
      "published": "2025-11-09T10:23:14",
      "content": "Zohran Mamdani’s election as New York City’s next mayor marks a historic first for South Asians in the United States. His campaign - drawing on his family’s roots in India - emphasized returning power to the people, tackling socio-economic inequality, and honoring the city’s multi-faith identity. Some have even compared the young politician’s rhetoric to that of Indian independence leader Jawaharlal Nehru. Olivia Salazar-Winspear reports.",
      "content_length": 442,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Denmark leads the way with first large-scale e-methanol production",
      "link": "https://www.france24.com/en/video/20251109-denmark-leads-the-way-with-first-large-scale-e-methanol-production",
      "published": "2025-11-09T10:16:21",
      "content": "With COP30 kicking off on Monday, world leaders are set to discuss new strategies to reduce greenhouse gas emissions - with a particular focus on the shipping industry. One potential solution is e-methanol, now being produced on a large scale for the first time in Denmark. Gabrielle Nadler has the story.",
      "content_length": 305,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Gaza's streets overwhelmed by waste causing a growing public heath crisis",
      "link": "https://www.france24.com/en/video/20251109-gaza-s-streets-overwhelmed-by-waste-causing-a-growing-public-heath-crisis",
      "published": "2025-11-09T10:14:21",
      "content": "The October Peace Plan allowed those who had survived displacement from cities in Gaza to return home. In the heavily bombarded areas of Khan Younis and Gaza City, however, they now face a new challenge: a growing public health crisis caused by the collapse of waste disposal infrastructure. As garbage accumulates, so too do communicable diseases. Simon Moritz reports.",
      "content_length": 370,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Ukraine: Women are taking on roles that were done by men before the war",
      "link": "https://www.france24.com/en/video/20251109-ukraine-women-are-taking-on-roles-that-were-done-by-men-before-the-war",
      "published": "2025-11-09T10:11:04",
      "content": "As Ukraine is forced to send more and more soldiers to the frontline, women are taking on roles that were traditionally done by men. Daniel Quinlan reports.",
      "content_length": 156,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "US Government shutdown hits 39th day",
      "link": "https://www.france24.com/en/video/20251109-us-government-shutdown-hits-39th-day",
      "published": "2025-11-09T10:02:45",
      "content": "Over 1,400 US flights were canceled Saturday after airlines cut traffic due to the federal government shutdown. Nearly 6,000 more were delayed, down from 7,000 on Friday, FlightAware reports. The FAA is reducing capacity at 40 busy airports as unpaid, fatigued air traffic controllers work. Lawmakers remain deadlocked over ending the shutdown, now in its second week. France24 correspondent Fraser Jackson reports the latest.",
      "content_length": 426,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Here’s how orbital dynamics wizardry helped save NASA’s next Mars mission",
      "link": "https://arstechnica.com/space/2025/11/heres-how-orbital-dynamics-wizardry-helped-save-nasas-next-mars-mission/",
      "published": "2025-11-09T15:34:52",
      "content": "Blue Origin scrubbed Sunday’s launch attempt due to poor weather, a cruise ship in restricted waters near the launch site, and ground system issues. The company says the next available launch opportunity is Wednesday, November 12, with a window opening at 2:50 pm EST (19:50 UTC).\nCAPE CANAVERAL, Florida—The field of astrodynamics isn’t a magical discipline, but sometimes it seems trajectory analysts can pull a solution out of a hat.\nThat’s what it took to save NASA’s ESCAPADE mission from a lengthy delay, and possible cancellation, after its rocket wasn’t ready to send it toward Mars during its appointed launch window last year. ESCAPADE, short for Escape and Plasma Acceleration and Dynamics Explorers, consists of two identical spacecraft setting off for the red planet as soon as Sunday with a launch aboard Blue Origin’s massive New Glenn rocket.Read full article\nComments",
      "content_length": 884,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Blue Origin will ‘move heaven and Earth’ to help NASA reach the Moon faster, CEO says",
      "link": "https://arstechnica.com/space/2025/11/blue-origin-will-move-heaven-and-earth-to-help-nasa-reach-the-moon-faster-ceo-says/",
      "published": "2025-11-08T21:27:42",
      "content": "Blue Origin stands ready to help NASA achieve its goals with regard to landing humans on the Moon as soon as possible, the company’s chief executive said Saturday in an interview with Ars.\n“We just want to help the US get to the Moon,” said Dave Limp, CEO of the space company founded by Jeff Bezos. “If NASA wants to go quicker, we would move heaven and Earth, pun intended, to try to get to the Moon sooner. And I think we have some good ideas.”\nLimp spoke on Saturday, about 24 hours ahead of the company’s second launch of the large New Glenn rocket. Carrying the ESCAPADE spacecraft for NASA, the mission has a launch window that opens at 2:45 pm ET (19:45 UTC) at Cape Canaveral Space Force Station in Florida, and runs for a little more than two hours.Read full article\nComments",
      "content_length": 785,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "James Watson, who helped unravel DNA’s double-helix, has died",
      "link": "https://arstechnica.com/health/2025/11/james-watson-who-helped-unravel-dnas-double-helix-has-died/",
      "published": "2025-11-07T23:30:51",
      "content": "James Dewey Watson, who helped reveal DNA’s double-helix structure, kicked off the Human Genome Project, and became infamous for his racist, sexist, and otherwise offensive statements, has died. He was 97.\nHis death was confirmed to The New York Times by his son Duncan, who said Watson died on Thursday in a hospice in East Northport, New York, on Long Island. He had previously been hospitalized with an infection. Cold Spring Harbor Laboratory also confirmed his passing.\nWatson was born in Chicago in 1928 and attained scientific fame in 1953 at 25 years old for solving the molecular structure of DNA—the genetic blueprints for life—with his colleague Francis Crick at England’s Cavendish laboratory. Their discovery heavily relied on the work of chemist and crystallographer Rosalind Franklin at King’s College in London, whose X-ray images of DNA provided critical clues to the molecule’s twisted-ladderlike architecture. One image in particular from Franklin’s lab, Photo 51, made Watson and Crick’s discovery possible. But, she was not fully credited for her contribution. The image was given to Watson and Crick without Franklin’s knowledge or consent by Maurice Wilkins, a biophysicist and colleague of Franklin.Read full article\nComments",
      "content_length": 1249,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Researchers surprised that with AI, toxicity is harder to fake than intelligence",
      "link": "https://arstechnica.com/information-technology/2025/11/being-too-nice-online-is-a-dead-giveaway-for-ai-bots-study-suggests/",
      "published": "2025-11-07T20:15:33",
      "content": "The next time you encounter an unusually polite reply on social media, you might want to check twice. It could be an AI model trying (and failing) to blend in with the crowd.\nOn Wednesday, researchers from the University of Zurich, University of Amsterdam, Duke University, and New York University released a study revealing that AI models remain easily distinguishable from humans in social media conversations, with overly friendly emotional tone serving as the most persistent giveaway. The research, which tested nine open-weight models across Twitter/X, Bluesky, and Reddit, found that classifiers developed by the researchers detected AI-generated replies with 70 to 80 percent accuracy.\nThe study introduces what the authors call a “computational Turing test” to assess how closely AI models approximate human language. Instead of relying on subjective human judgment about whether text sounds authentic, the framework uses automated classifiers and linguistic analysis to identify specific features that distinguish machine-generated from human-authored content.Read full article\nComments",
      "content_length": 1096,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Commercial spyware “Landfall” ran rampant on Samsung phones for almost a year",
      "link": "https://arstechnica.com/gadgets/2025/11/commercial-spyware-landfall-ran-rampant-on-samsung-phones-for-almost-a-year/",
      "published": "2025-11-07T19:33:20",
      "content": "Another day, another malware attack on smartphones. Researchers at Unit 42, the threat intelligence arm of Palo Alto Networks, have revealed a sophisticated spyware known as “Landfall” targeting Samsung Galaxy phones. The researchers say this campaign leveraged a zero-day exploit in Samsung Android software to steal a raft of personal data, and it was active for almost a year. Thankfully, the underlying vulnerability has now been patched, and the attacks were most likely targeted at specific groups.\nUnit 42 says that Landfall first appeared in July 2024, relying on a software flaw now catalogued as CVE-2025-21042. Samsung issued a patch for its phones in April 2025, but details of the attack have only been revealed now.\nEven if you were out there poking around the darker corners of the Internet in 2024 and early 2025 with a Samsung Galaxy device, it’s unlikely you’d be infected. The team believes Landfall was used in the Middle East to target individuals for surveillance. It is currently unclear who was behind the attacks.Read full article\nComments",
      "content_length": 1064,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "The government shutdown is starting to have cosmic consequences",
      "link": "https://arstechnica.com/space/2025/11/faa-says-commercial-rockets-must-launch-at-night-citing-government-shutdown/",
      "published": "2025-11-07T19:16:16",
      "content": "The federal government shutdown, now in its 38th day, prompted the Federal Aviation Administration to issue a temporary emergency order Thursday prohibiting commercial rocket launches from occurring during “peak hours” of air traffic.\nThe FAA also directed commercial airlines to reduce domestic flights from 40 “high impact airports” across the country in a phased approach beginning Friday. The agency said the order from the FAA’s administrator, Bryan Bedford, is aimed at addressing “safety risks and delays presented by air traffic controller staffing constraints caused by the continued lapse in appropriations.”\nThe government considers air traffic controllers essential workers, so they remain on the job without pay until Congress passes a federal budget and President Donald Trump signs it into law. The shutdown’s effects, which affected federal workers most severely at first, are now rippling across the broader economy.Read full article\nComments",
      "content_length": 959,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Higher prices, simpler streaming expected if HBO Max folds into Paramount+",
      "link": "https://arstechnica.com/gadgets/2025/11/higher-prices-simpler-streaming-expected-if-hbo-max-folds-into-paramount/",
      "published": "2025-11-07T18:54:38",
      "content": "Warner Bros. Discovery (WBD) has a ‘for sale’ sign up. And that could mean big changes for subscribers to the company’s most popular streaming service, HBO Max.\nAfter receiving unsolicited acquisition offers, WBD recently declared itself open to “strategic alternatives to maximize shareholder value.” WBD drew new attention by being open to selling its streaming business (WBD is also still open to moving forward with previously shared plans to split into a cable company and a streaming and movie studios company next year).\nNaturally, mergers and acquisitions talk has heated up since then, with Paramount as one of the most eager suitors. Paramount, which merged with Skydance in August, is reportedly planning to keep “much of Warner Bros. Discovery Inc. intact” if a deal happens, per a Bloomberg report that cited unnamed people familiar with the plans of David Ellison, Paramount’s CEO.Read full article\nComments",
      "content_length": 921,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "FBI orders domain registrar to reveal who runs mysterious Archive.is site",
      "link": "https://arstechnica.com/tech-policy/2025/11/fbi-subpoena-tries-to-unmask-mysterious-founder-of-archive-today/",
      "published": "2025-11-07T18:28:23",
      "content": "The Federal Bureau of Investigation is trying to unmask the operator of Archive.is, also known as Archive.today, a website that saves snapshots of webpages and is commonly used to bypass news paywalls.\nThe FBI sent a subpoena to domain registrar Tucows, seeking “subscriber information on [the] customer behind archive.today” in connection with “a federal criminal investigation being conducted by the FBI.” The subpoena tells Tucows that “your company is required to furnish this information.”\nThe subpoena is supposed to be secret, but the Archive.today X account posted the document on October 30, the same day the subpoena was issued. The X post contained a link to the PDF and the word “canary.”Read full article\nComments",
      "content_length": 726,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Questions swirl after Trump’s GLP-1 pricing deal announcement",
      "link": "https://arstechnica.com/health/2025/11/questions-swirl-after-trumps-glp-1-pricing-deal-announcement/",
      "published": "2025-11-07T18:18:07",
      "content": "At a White House event Thursday, President Trump announced deals with drugmakers Novo Nordisk and Eli Lilly to offer their popular GLP-1 obesity and diabetes drugs at lower prices for some Americans, namely some on Medicare and Medicaid plans. But questions linger about the significance of the deal.\nAccording to the announcement, Medicare and state Medicaid programs will be able to purchase a month’s supply of Ozempic, Wegovy, Mounjaro, and Zepbound at $245 each for eligible patients. Eligible people on Medicare will have a $50 co-pay.\nThe negotiated price is a significant cut from the drugs’ list prices: The list price for Ozempic is $997, Wegovy is $1,350, Mounjaro is $1,080, and Zepbound is $1,086. But, of course, purchasers rarely pay drug list prices. It’s unclear how much Medicare and Medicaid would have paid for the drugs without this deal and what the savings will be.Read full article\nComments",
      "content_length": 914,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Oddest ChatGPT leaks yet: Cringey chat logs found in Google analytics tool",
      "link": "https://arstechnica.com/tech-policy/2025/11/oddest-chatgpt-leaks-yet-cringey-chat-logs-found-in-google-analytics-tool/",
      "published": "2025-11-07T16:49:53",
      "content": "For months, extremely personal and sensitive ChatGPT conversations have been leaking into an unexpected destination: Google Search Console (GSC), a tool that developers typically use to monitor search traffic, not lurk private chats.\nNormally, when site managers access GSC performance reports, they see queries based on keywords or short phrases that Internet users type into Google to find relevant content. But starting this September, odd queries, sometimes more than 300 characters long, could also be found in GSC. Showing only user inputs, the chats appeared to be from unwitting people prompting a chatbot to help solve relationship or business problems, who likely expected those conversations would remain private.\nJason Packer, owner of an analytics consulting firm called Quantable, was among the first to flag the issue in a detailed blog last month.Read full article\nComments",
      "content_length": 889,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "With Skigill, the classic RPG skill tree becomes a crowded battlefield",
      "link": "https://arstechnica.com/gaming/2025/11/with-skigill-the-classic-rpg-skill-tree-becomes-a-crowded-battlefield/",
      "published": "2025-11-07T16:19:43",
      "content": "If you’ve played any number of RPGs, you probably know the skill tree as a break from the game’s core action. It’s a place to pause, take a breather, and scroll through a massive visual menu of upgrade options, considering which path of stat and ability tweaks best fits your character and your play style.\nWith Skigill, indie developer Achromi has taken that break-time menu and transformed it into the playing field for an intriguing Vampire Survivors-style roguelike. And while the Early Access game currently lacks the kind of deep content that will keep players coming back for a long time, it’s still a clever and engaging take on the genre that I haven’t been able to put down for long.\nClear the way, I need +5 armor!\nLike Vampire Survivors and its many imitators, Skigill is all about navigating through waves of enemies that converge somewhat mindlessly on your position. The game automatically aims and deploys weapons to carve some safe space through what can be screens full of hazardous enemies, which leave behind coins as they explode in puffs of yellow smoke.Read full article\nComments",
      "content_length": 1102,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Ford says “no exact date” to restart F-150 Lightning production",
      "link": "https://arstechnica.com/cars/2025/11/ford-says-no-exact-date-to-restart-f-150-lightning-production/",
      "published": "2025-11-07T15:23:03",
      "content": "When Ford electrified its bestselling pickup truck, it pulled out all the stops. The F-150 Lightning may look virtually identical to other versions of the pickup, but it’s smoother, faster, and obviously far, far more efficient than the ones that run on gas, diesel, or hybrid power. But the future of the country’s bestselling electric truck may be in doubt.\nThat’s according to a report in The Wall Street Journal, which claims that Ford’s management is “in active discussions about scrapping” the Lightning. Production had already been suspended a few weeks ago due to an aluminum shortage following a destructive fire at a supplier’s factory in New York, which Ford estimates may result in as much as $2 billion in losses to the company.\nWhile Ford told Ars it doesn’t comment on speculation on its future product plans, the automaker said that “F-150 Lightning is the best-selling electric pickup truck in the US—despite new competition from CyberTruck, Chevy, GMC, Hummer and Rivian—and delivered record sales in Q3.”Read full article\nComments",
      "content_length": 1049,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "10,000 generations of hominins used the same stone tools to weather a changing world",
      "link": "https://arstechnica.com/science/2025/11/10000-generations-of-hominins-used-the-same-stone-tools-to-weather-a-changing-world/",
      "published": "2025-11-07T15:13:25",
      "content": "At a site in Kenya, archaeologists recently unearthed layer upon layer of stone stools from deposits that span 300,000 years, and include a period of intense environmental upheaval. The oldest tools at the site date back to 2.75 million years ago. According to a recent study, the finds suggest that for hundreds of millennia, ancient hominins relied on the same stone tool technology as an anchor while the world changed around them.\n\n      Oldowan choppers dated to 1.7 million years ago, from Melka Kunture, Ethiopia.\n        Credit:\n          By Didier Descouens - Own work, CC BY-SA 4.0, https://commons.wikimedia.org/w/index.php?curid=11291046\n      \n“An extraordinary story of cultural continuity”\nGeorge Washington University archaeologist David Braun and his colleagues recently unearthed stone tools from a 2.75 million-year-old layer of Kenyan sediment at a site called Nomorotukunan. They’re classic examples of a type of tools archaeologists call Oldowan: the earliest types of sharp-edged stone tools made by hominins. The tools unearthed at Nomorotukunan are some of the oldest Olduwan tools ever found; only three other Oldowan sites in Africa date back any further than 2.6 million years ago.\nThese hand-sized chunks of river rock, with flakes chipped off one or two sides to make sharp edges, were cutting-edge technology (not sorry) from 2.9 million years ago until about 1.7 million years ago. In technical terms, that’s what’s called a long flipping time, enough to span several hominin species and more than one genus. The last hominins to use Oldowan tools looked very different, and probably lived and behaved very differently, from the first; over this huge span of time, the stone tool technology itself changed less than the beings using it.Read full article\nComments",
      "content_length": 1794,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Mark Zuckerberg’s illegal school drove his neighbors crazy",
      "link": "https://arstechnica.com/tech-policy/2025/11/mark-zuckerbergs-illegal-school-drove-his-neighbors-crazy/",
      "published": "2025-11-07T14:29:51",
      "content": "The Crescent Park neighborhood of Palo Alto, California, has some of the best real estate in the country, with a charming hodgepodge of homes ranging in style from Tudor revival to modern farmhouse and contemporary Mediterranean. It also has a gigantic compound that is home to Mark Zuckerberg, his wife Priscilla Chan, and their daughters Maxima, August, and Aurelia. Their land has expanded to include 11 previously separate properties, five of which are connected by at least one property line.\nThe Zuckerberg compound’s expansion first became a concern for Crescent Park neighbors as early as 2016, due to fears that his purchases were driving up the market. Then, about five years later, neighbors noticed that a school appeared to be operating out of the Zuckerberg compound. This would be illegal under the area’s residential zoning code without a permit. They began a crusade to shut it down that did not end until summer 2025.\nWIRED obtained 1,665 pages of documents about the neighborhood dispute—including 311 records, legal filings, construction plans, and emails—through a public record request filed to the Palo Alto Department of Planning and Development Services. (Mentions of “Zuckerberg” or “the Zuckerbergs” appear to have been redacted. However, neighbors and separate public records confirm that the property in question belongs to the family. The names of the neighbors who were in touch with the city were also redacted.)Read full article\nComments",
      "content_length": 1470,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Rocket Report: Canada invests in sovereign launch; India flexes rocket muscles",
      "link": "https://arstechnica.com/space/2025/11/rocket-report-canada-invests-in-sovereign-launch-india-flexes-rocket-muscles/",
      "published": "2025-11-07T13:51:40",
      "content": "Welcome to Edition 8.18 of the Rocket Report! NASA is getting a heck of a deal from Blue Origin for launching the agency’s ESCAPADE mission to Mars. Blue Origin is charging NASA about $20 million for the launch on the company’s heavy-lift New Glenn rocket. A dedicated ride on any other rocket capable of the job would undoubtedly cost more.\nBut there are trade-offs. First, there’s the question of risk. The New Glenn rocket is only making its second flight, and it hasn’t been certified by NASA or the US Space Force. Second, the schedule for ESCAPADE’s launch has been at the whim of Blue Origin, which has delayed the mission several times due to issues developing New Glenn. NASA’s interplanetary missions typically have a fixed launch period, and the agency pays providers like SpaceX and United Launch Alliance a premium to ensure the launch happens when it needs to happen.\nNew Glenn is ready, the satellites are ready, and Blue Origin has set a launch date for Sunday, November 9. The mission will depart Earth outside of the usual interplanetary launch window, so orbital dynamics wizards came up with a unique trajectory that will get the satellites to Mars in 2027.Read full article\nComments",
      "content_length": 1203,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "How to trade your $214,000 cybersecurity job for a jail cell",
      "link": "https://arstechnica.com/security/2025/11/fbi-arrests-ransomware-clean-up-experts-for-planting-ransomware/",
      "published": "2025-11-07T12:30:44",
      "content": "Helping companies pay ransoms to digital extortionists is kind of an odd business.\nOn the one hand, you “negotiate” with cybercriminals and in so doing may drive down the costs of recovering from a particular ransomware incident. On the other hand, you’re helping criminals get paid, funding their operations and making further attacks more likely.\nAnd there’s always a temptation built into this kind of work. Seeing lucrative sums being whisked away through cryptocurrency exchanges and “mixing services”… Realizing from up close just how vulnerable companies are… Learning that modern ransomware can operate as a service where you essentially “rent” the code from its developers in return for a cut of the profits…Read full article\nComments",
      "content_length": 743,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Next-generation black hole imaging may help us understand gravity better",
      "link": "https://arstechnica.com/science/2025/11/imaging-black-holes-may-help-us-rule-out-some-models-of-gravity/",
      "published": "2025-11-06T22:36:26",
      "content": "The Event Horizon Telescope only recently gave us the first images of the environment immediately surrounding a black hole. Since then, it has been boosting the resolution and filling in the details of an environment dominated by the most extreme gravity in the Universe.\nBut which gravity are we talking about? Because of its incompatibility with quantum mechanics and our current inability to explain dark matter, people have proposed all sorts of variants of gravity that go beyond general relativity and clean up some of the physics’ awkwardness. It’s possible that the extreme environment near a black hole amplifies the differences among at least some of these hypotheses. So, a group of physicists decided to see whether any of those differences might be large enough that the next generation of telescopes might be able to rule out some potential replacements for relativity.\nSearching for subtlety\nAny replacement for general relativity faces an awkward challenge: General relativity does pretty well at explaining everything from the large-scale structure of the Universe to phenomena we can measure right here on Earth. So, any alternative theories would have to differ from relativity in very subtle ways that might be extremely difficult to detect.Read full article\nComments",
      "content_length": 1287,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Wipers from Russia’s most cut-throat hackers rain destruction on Ukraine",
      "link": "https://arstechnica.com/security/2025/11/wipers-from-russias-most-cut-throat-hackers-rain-destruction-on-ukraine/",
      "published": "2025-11-06T22:17:21",
      "content": "One of the world’s most ruthless and advanced hacking groups, the Russian state-controlled Sandworm, launched a series of destructive cyberattacks in the country’s ongoing war against neighboring Ukraine, researchers reported Thursday.\nIn April, the group targeted a Ukrainian university with two wipers, a form of malware that aims to permanently destroy sensitive data and often the infrastructure storing it. One wiper, tracked under the name Sting, targeted fleets of Windows computers by scheduling a task named DavaniGulyashaSdeshka, a phrase derived from Russian slang that loosely translates to “eat some goulash,” researchers from ESET said. The other wiper is tracked as Zerlot.\nA not-so-common target\nThen, in June and September, Sandworm unleashed multiple wiper variants against a host of Ukrainian critical infrastructure targets, including organizations active in government, energy, and logistics. The targets have long been in the crosshairs of Russian hackers. There was, however, a fourth, less common target—organizations in Ukraine’s grain industry.Read full article\nComments",
      "content_length": 1096,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Elon Musk wins $1 trillion Tesla pay vote despite “part-time CEO” criticism",
      "link": "https://arstechnica.com/tech-policy/2025/11/elon-musk-wins-tesla-pay-vote-that-could-make-him-a-1-trillion-man/",
      "published": "2025-11-06T22:05:55",
      "content": "Tesla shareholders today voted to approve a compensation plan that would pay Elon Musk more than $1 trillion over the next decade if he hits all of the plan’s goals. Musk won over 75 percent of the vote, according to the announcement at today’s shareholder meeting.\nThe pay plan would give Musk 423,743,904 shares, awarded in 12 tranches of 35,311,992 shares each if Tesla achieves various operational goals and market value milestones. Goals include delivering 20 million vehicles, obtaining 10 million Full Self-Driving subscriptions, delivering 1 million “AI robots,” putting 1 million robotaxis in operation, and achieving a $400 billion adjusted EBITDA (earnings before interest, taxes, depreciation, and amortization).\nMusk has threatened to leave if he doesn’t get a larger share of Tesla. He told investors last month, “It’s not like I’m going to go spend the money. It’s just, if we build this robot army, do I have at least a strong influence over that robot army? Not control, but a strong influence. That’s what it comes down to in a nutshell. I don’t feel comfortable building that robot army if I don’t have at least a strong influence.”Read full article\nComments",
      "content_length": 1177,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Gemini Deep Research comes to Google Finance, backed by prediction market data",
      "link": "https://arstechnica.com/google/2025/11/gemini-deep-research-comes-to-google-finance-backed-by-prediction-market-data/",
      "published": "2025-11-06T20:39:15",
      "content": "Google has announced new features in the popular Google Finance platform, and it leans heavily on Google’s tried-and-true strategy of more AI in more places. This builds on Google’s last Finance update, which added a Gemini-based chatbot. Now, Google is adding Gemini Deep Research to the site, which will allow users to ask much more complex questions. You can also ask questions about the future, backed by new betting market data sources.\nThe update, which is rolling out over the next several weeks, will add a Deep Research option to the Finance chatbot. The company claims that with the more powerful AI, users will be able to generate “fully cited” research reports on a given topic in just a few minutes. So you can expect an experience similar to Deep Research in the Gemini app—you give it a prompt, and then you come back later to see the result.\nYou probably won’t want to bother with Deep Research on simple queries—there are faster, easier ways to get that done. Google suggests using Deep Research on more complex things, like the doozy below.Read full article\nComments",
      "content_length": 1084,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Cleveland Guardians&#8217; pitchers indicted for rigging online bets",
      "link": "https://www.theverge.com/news/817425/cleveland-guardians-pitchers-indicted-for-rigging-online-bets",
      "published": "2025-11-09T23:22:44",
      "content": "\n\n\n\t\n\t\t\n\nCleveland Guardians pitchers Emmanuel Clase and Luis Ortiz were indicted in Brooklyn on charges that they conspired to illegally rig bets on pitches thrown during games. The two were charged with wire fraud conspiracy, conspiracy to influence sporting contests by bribery, and money laundering conspiracy, among other things. \n\nAccording to the indictment:\n\n\nThe defendants agreed in advance with their co-conspirators to throw specific types and speeds of pitches, and their co-conspirators used that inside information to place wagers on those pitches. In some instances, the defendants received bribes and kickback payments-funneled through third parties-in exchange for rigging pitches.\n\n\nThe scheme involved unnamed third-party bettors who allegedly earned over $400,000 on bets involving Clase and Ortiz. The pitchers, for their part, received kickbacks according to the indictment. In some instances, Clase and Ortiz even provided their coconspirators with money to fund the bets. \n\nTo organize the scheme, the two used their cellphones during games, which is prohibited by the MLB except under extenuating circumstances. The two are also facing a potential lifetime ban from the sport for violating the league&#8217;s rules against betting on their own games. \n\nHowever, if convicted, it’s unlikely they’d be released from prison while still young enough to compete anyway. Clase and Ortiz are facing a possible sentence of up to 65 years.",
      "content_length": 1456,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "You need to listen to this compilation of ‘80s Spanish ambient and electronic music",
      "link": "https://www.theverge.com/column/817417/la-ola-interior-compilation-80s-spanish-ambient-and-electronic-music",
      "published": "2025-11-09T21:30:00",
      "content": "\n\n\n\t\n\t\t\n\nMuch of La Ola Interior (Spanish Ambient &amp; Acid Exoticism 1983-1990) sounds shockingly contemporary for a collection of tracks recorded in the mid to late '80s. Ambient as a genre was already relatively well established by the time many of the artists on this compilation recorded their songs. But as we neared the end of the century,  much of the scene in the US and Japan was beginning to push into New Age territory. These artists from the Spanish peninsula were trafficking in something much more experimental.\nLa Ola Interior covers a lot of stylistic ground. There's despondent drones, classic analog synths excursions, detached chants, field …\nRead the full story at The Verge.",
      "content_length": 697,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "YouTube TV, ESPN, and Disney: the latest on the blackout",
      "link": "https://www.theverge.com/news/817403/youtube-tv-disney-espn-blackout-updates",
      "published": "2025-11-09T19:31:59",
      "content": "\n\n\n\t\n\t\t\n\nOn October 31st, ESPN, ABC, Nat Geo, and over 20 other Disney-owned channels went dark on YouTube TV. As the two sides disagree about terms for a new content distribution contract, Google has accused Disney of trying to raise prices for its customers in an effort to boost its own Hulu + Live TV and Fubo offerings. \n\nMeanwhile, Disney claims that Google is being unreasonable and seeking preferential treatment and below-market rates, and streamed College GameDay for free during the dispute. It’s quite different from their 2021 carriage blackout, which was resolved within a couple of days.\n\nThe two don&#8217;t seem any closer to an agreement at this point, as the war of words continues, and now Google is even giving YouTube TV customers a $20 credit for the inconvenience.\n\nRead on below for all of the news and updates about Google and Disney&#8217;s ongoing battle.\n\n\t\t\t\t\t\n\t\t\t\tGoogle is issuing a $20 credit to YouTube TV subscribers.\n\t\t\t\n\t\t\t\t\t\n\t\t\t\tFilms from YouTube and Google Play are no longer available on Movies Anywhere\n\t\t\t\n\t\t\t\t\t\n\t\t\t\tNo Monday Night Football, no Election Night ABC News for YouTube TV.\n\t\t\t\n\t\t\t\t\t\n\t\t\t\tESPN, ABC, and other Disney channels go dark on YouTube TV\n\t\t\t\n\t\t\t\t\t\n\t\t\t\tDisney is suing YouTube for poaching a key media and sports executive\n\t\t\t\n\t\t\t",
      "content_length": 1292,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Arturia&#8217;s KeyStep mk2 MIDI controller is a shortcut to flow state",
      "link": "https://www.theverge.com/tech/817387/arturia-keystep-mk2-midi-controller-generative-sequencing-writers-block",
      "published": "2025-11-09T18:30:00",
      "content": "\n\n\n\t\n\tDon’t mind my desk toys.\t\n\nArturia's KeyStep is one of the most popular MIDI controllers ever made, especially with modular synth users and the DAWless crowd. It's small, cheap, has an easy-to-use sequencer, and offers decent connectivity. But it was also released way back in January of 2016. The world of music gear moves more slowly than, say, smartphones, but Arturia has several controllers released after the KeyStep that are already on their third generation. The $139 KeyStep mk2 takes this classic and updates it with a host of new sequencing and composition features developed by Arturia over the years.\nCompared to the original, the KeyStep mk2 has double the numb …\nRead the full story at The Verge.",
      "content_length": 717,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "The tale of the Fire Phone, Amazon’s very strange smartphone",
      "link": "https://www.theverge.com/podcast/816739/amazon-fire-phone-version-history",
      "published": "2025-11-09T15:20:24",
      "content": "\n\n\n\t\n\t\t\n\nWhen Jeff Bezos decided Amazon needed to get in the smartphone game, he went all in. And the resulting device, the Fire Phone, wound up more densely packed with big ideas than just about any gadget you'll find anywhere. There was just one tiny problem: they were mostly bad ideas.\nThe Fire Phone shipped in 2014 with a feature list a mile long. The screen had a 3D effect! There were, like, 400 cameras! There was a whole home screen filled with something called \"delighters!\" But the Fire Phone was, above all, a way to buy things on Amazon. That was what Bezos wanted, after all. It's just not what users wanted.\n\n\nVerge subscribers, don't fo …\nRead the full story at The Verge.",
      "content_length": 689,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Deck out your tree with ornaments of retro consoles, movie moments, and more",
      "link": "https://www.theverge.com/tech/811614/best-christmas-ornaments-2025",
      "published": "2025-11-09T15:00:00",
      "content": "\n\n\n\t\n\t\t\n\nDo the ornaments you adorn your Christmas tree with reflect you or your family’s interests? If not, maybe you should rectify that. We recently went hands on with Hallmark’s realistic Xbox 360 replica ornament, which plays a snippet of audio from Halo 3. As it turns out, there are many other ornaments available that are specifically designed to evoke nostalgia and make us open our wallets (surprise, surprise). In fact, did you know that the company also makes a CRT monitor with The Oregon Trail displayed on it? It’s rad.\n\nEven if video games aren’t your jam, Hallmark has a stranglehold on the intersection of ornaments and entertainment, with numerous options covering your favorite TV shows, movies, or favorite brands (maybe your household is the type that’d proudly display a mac and cheese ornament, maybe not). We’ve included some of our favorites below, and even if you aren’t necessarily the target audience, they’d make for a great gift. We even threw in some non-Hallmark options, because why not?\n\nRetro Tech Glass Holiday Ornament &#8211; VHS Tape\nYou can almost smell the mustiness of your local video store — that is, assuming you still have one.\n\nWhere to Buy: $24 at MoMA Store $24 at Love and Victory\n\nNintendo Entertainment System Console Ornament\nNintendo’s first home gaming console in the US, immortalized as a replica ornament.\n\nWhere to Buy: $24.99 at Hallmark $24.99 at Amazon\n\nXbox 360 Console Ornament\nA replica that gets all of the details right, except for portraying the Xbox Red Ring of Death.\n\nWhere to Buy: $28.99 at Amazon $28.99 at Hallmark\n\nRecord Crate Ornament\nA throwback to the record-filled milk crates you once had, or perhaps the collection you’re just now building.\n\nWhere to Buy: $24 at Love and Victory\n\nSuper Mario Super Star Topper\nWhether you’re into gaming or not, the Super Star topper is a cute alternative for the star you have.\n\nWhere to Buy: $92.99 at Hallmark $92.99 at Amazon\n\nTerminator 2: Judgment Day &#8211; T1000 Ornament\nThe shape-shifting T1000 android is an ornament I didn’t know I’d want this year.\n\nWhere to Buy: $28.99 at Hallmark $28.99 at Amazon\n\nStar Wars: The Empire Strikes Back Into the Carbon-Freezing Chamber\nThis elaborate ornament depicts the scene from The Empire Strikes Back when Han Solo is frozen in carbonite. Just don’t forget the power cord.\n\nWhere to Buy: $80.99 at Hallmark $80.99 at Amazon\n\nThe Legend of Zelda: Tears of the Kingdom Decayed Master Sword\nThe almighty Master Sword from The Legend of Zelda took a beating in Tears of the Kingdom, as you can see here.\n\nWhere to Buy: $31.99 at Amazon $31.99 at Hallmark\n\nThe Oregon Trail Ornament\nThis year, add “You have died of dysentery” to your holiday tree.\n\nWhere to Buy: $24.99 at Amazon $24.99 at Hallmark\n\nDungeons &amp; Dragons Themberchaud Ornament\nThe Chungus dragon from the 2023 Honor Among Thieves film re-created as an ornament.\n\nWhere to Buy: $11.49 at Amazon $11.49 at Hallmark\n\nStar Wars: A New Hope “Let the Wookiee Win” Ornament\nGet cozy with C-3PO, R2-D2, Han Solo, and Chewie as they play Dejarik, complete with video and audio (requires a power cord).\n\nWhere to Buy: $99.99 at Hallmark $99.99 at Amazon\n\nStar Trek: The Next Generation Beware The Borg! Tabletop Decoration\nBehold this impressive interactive ornament that Star Trek fans will love.\n\nWhere to Buy: $124.99 at Amazon $124.99 at Hallmark\n\nSega Dreamcast Ornament\nSega’s final (and best) console gets the ornament replica treatment, complete with tunes from Sonic Adventure.\n\nWhere to Buy: $19.95 at Walmart\n\nStar Wars: Andor Cassian Andor Ornament\nDiego Luna as Cassian Andor, one of Star Wars’ most chaotic / best heroes. \n\nWhere to Buy: $31.99 at Amazon $31.99 at Hallmark\n\nThe Lord of the Rings One Ring Ornament\nWhile there’s only one true One Ring, there are many One Ring ornaments, such as this one.\n\nWhere to Buy: $17.48 at Amazon $18.9 at BoxLunch\n\nSega Genesis Console Ornament\nWhether you were on team SNES or Genesis, we can all agree that this Sega Genesis replica rules.\n\nWhere to Buy: $28.99 at Hallmark $28.99 $24.95 at Walmart\n\nThe Legend of Zelda Game Cartridge Metal Ornament\nThe actual 1987 special edition cartridge of The Legend of Zelda might set you back hundreds. This replica ornament won’t.\n\nWhere to Buy: $24.99 at Hallmark $24.99 at Amazon\n\nSuper Mario Question Block ornament\nSure, nothing happens when you hit this Question Block, but it’s still a fun addition to your tree.\n\nWhere to Buy: $11.49 at Hallmark $11.49 $11.21 at Amazon $11.49 $11.21 at Walmart",
      "content_length": 4524,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "65daysofstatic’s new No Man’s Sky album searches for humanity in an AI-filled world",
      "link": "https://www.theverge.com/report/816427/no-mans-sky-album-journeys-65daysofstatic",
      "published": "2025-11-09T14:00:00",
      "content": "\n\n\n\t\n\t\t\n\nIt's not often that a band returns to soundtrack the same game nine years after its release - then again, most games aren't No Man's Sky. Once demoed on The Tonight Show with Jimmy Fallon and at splashy E3 press conferences, in 2016, No Man's Sky was heralded as gaming's future. And it was all made possible by the procedural generation that spawned its vast, sci-fi universe.\nNearly a decade later, as post-rock band 65daysofstatic returns to re-score the ever-evolving game, generated content is no longer the exciting futurism it once seemed. With AI slop flooding social media and AI-generated bands sneaking their way onto Spotify, the tech t …\nRead the full story at The Verge.",
      "content_length": 693,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "The algorithm failed music",
      "link": "https://www.theverge.com/column/815744/music-recommendation-algorithms",
      "published": "2025-11-09T13:00:00",
      "content": "\n\n\n\t\n\t\t\n\nThis is The Stepback, a weekly newsletter breaking down one essential story from the tech world. For more on how to break free of the algorithm and discover things you love, follow Terrence O'Brien. The Stepback arrives in our subscribers' inboxes at 8AM ET. Opt in for The Stepback here.\nHow it started\nI used to have this ritual. Every Tuesday, I would get off the train at 8th Street on my way home from work. I would pop into Other Music, buy a new CD (or three…) and then walk the rest of the way to the Staten Island Ferry listening to my new CD. Even if there wasn't a new record out that week that I was looking forward to, I would buy som …\nRead the full story at The Verge.",
      "content_length": 692,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Ikea just took over your smart home",
      "link": "https://www.theverge.com/tech/816650/ikea-just-took-over-your-smart-home",
      "published": "2025-11-09T13:00:00",
      "content": "\n\n\n\t\n\t\t\n\nHi, friends! Welcome to Installer No. 105, your guide to the best and Verge-iest stuff in the world. (If you're new here, welcome, hope you've recovered from the clocks falling back, and also you can read all the old editions at the Installer homepage.) \nThis week, I've been reading about David Ellison and Common Crawl and Stephen Colbert, catching up on It's Always Sunny in Philadelphia and The Great British Baking Show, letting TikTok turn me on to a new Olivia Dean song and a new Broadway musical, testing the Boox Palma 2 Pro, spending way too many hours trying to design my new home office / podcast studio, and packing every single thing …\nRead the full story at The Verge.",
      "content_length": 693,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "The best earbuds we’ve tested for 2025",
      "link": "https://www.theverge.com/21309820/best-wireless-earbuds",
      "published": "2025-11-08T17:00:00",
      "content": "\n\n\n\t\n\t\t\n\nIt’s hard to buy a bad pair of wireless earbuds these days, and with constant discounts and deals wherever you look, now is as good a time as any to splurge on the pair you’ve been eyeing. The market has come a long way since the early era of true wireless earbuds when we had to deal with mediocre sound quality and unreliable performance, all for the sake of ditching cables. Things are much different now. After several product generations of learned lessons, companies like Sony, Apple, Samsung, and others are releasing their most impressive earbuds to date.&nbsp;\n\nYou can get phenomenal noise cancellation and sound quality in the premium tier of earbuds if you’re willing to spend big. But those aren’t always the most important criteria for everyone: maybe you’re looking for the perfect fitness earbuds or for a set that works just as well for Zoom calls as for playing your favorite playlists and podcasts.\n\nTech companies are increasingly making their earbuds work best with their own products through exclusive features and functionality, so that’s another thing to consider as you shop around. If you want a perk like head-tracking spatial audio, you’ll need to use AirPods with an iPhone, Samsung buds with a Samsung phone, and so on.\n\n\n\n\n\n\n\n\nThe best overall wireless earbudsThe best budget earbuds under $100The best noise-canceling earbudsThe best earbuds for sports and working outThe best earbuds for iPhone ownersThe best earbuds for Samsung Galaxy phone ownersThe best earbuds for Google Pixel phone ownersThe best earbuds if you own both Apple and Android devicesThe best earbuds for sound qualityThe best earbuds for voice calls on iPhoneThe best earbuds for voice calls on Android\n\n\n\n\nThe best overall wireless earbuds\nSony WF-1000XM5\nSony&#8217;s flagship wireless earbuds offer the company&#8217;s best noise cancellation, powerful and lively sound, and a comfortable fit. Read our review.\n\nScore: 8ProsConsSmaller, more comfortable designUpgrades to ANC and sound qualityMuch clearer voice call performanceGlossy texture can make them harder to remove from caseSony’s bonus features aren’t as seamless as those of its competitorsPotential battery longevity concerns\nWhere to Buy: $329.99 $228 at Amazon $329.99 $228 at Best Buy $329.99 $229.99 at Target\nNoise cancellation: Yes / Battery life: 8 hours (ANC on) / Water resistance: IPX4 / Bluetooth codecs: LDAC, AAC, SBC&nbsp;/ Multipoint: Yes / Works best with: Android, iOS, Windows, macOS / Ear tips: Foam (XS, S, M, L)\n\nJust like their predecessors, Sony’s WF-1000XM5 earbuds have again topped our recommendations for the overall best noise-canceling earbuds. Thanks to their larger drivers, the audio quality is more detailed and dynamic than before while still retaining the warmth and clarity that made the WF-1000XM4 so enjoyable. Sony has also further improved its ANC and is nearing the same territory as Bose’s QC Earbuds II. These earbuds do a terrific job of eliminating background noise. Battery life can stretch to eight hours of continuous listening with noise cancellation turned on.\n\nSome people found the XM4 to be bulky and uncomfortable, so this time around, Sony has managed to shrink the XM5 by 25 percent. Like before, the company includes foam-style tips that expand in your ears to create an excellent seal — and now there’s a fourth (extra small) set of tips in the box.\n\nOn Android phones, the 1000XM5 support Sony’s LDAC codec for higher-quality music playback. And they’re capable of dynamic head tracking spatial audio through supported video apps like Netflix. But even if you’re not using LDAC (or have an iPhone), these are up there with the very best audio-focused premium earbuds — including Sennheiser’s Momentum True Wireless 4, only with substantially better noise cancellation. They’re also capable of multipoint Bluetooth connectivity, so you can pair them with two devices at the same time.\n\nIt’s worth noting that there were many reports of battery issues with the 1000XM4 over time as those earbuds aged, but Sony claims to have rectified that problem with the new model by tweaking the charging algorithm.\n\nRead our&nbsp;full WF-1000XM5 review.\n\nThe best budget earbuds under $100\nNothing Ear (a)\nNothing’s Ear (a) earbuds have the same stylish, semi-transparent design as the company’s other earbuds — but these come in a snazzy yellow. They combine decent ANC, enjoyable sound, and other features like multipoint for under $100.\n\nProsConsStandout color and designVery compact carrying caseGreat performer for the priceLimited retail availabilityPlastic case can show scuffs\nWhere to Buy: $99 $89 at Nothing $109 $89 at Amazon\nNoise cancellation: Yes / Battery life: 5.5 hours (ANC on) / Water resistance: IP54 / Bluetooth codecs: LDAC, AAC, SBC&nbsp;/ Multipoint: Yes / Works best with: Android, iOS, Windows, macOS / Ear tips: Silicone (S, M, L)\n\nWhen looking at Nothing’s Ear (a) earbuds, it’s easy to focus all your attention on the catchy yellow color or their fun, super compact carrying case. But at their $99 price, the company’s entry-level earbuds provide a ton of features, including active noise cancellation, a low-latency mode for gaming, multipoint Bluetooth pairing, and a decent IP54 dust and water resistance rating.&nbsp;\n\nAnd the sound quality you get outperforms my usual expectations for this price point. They’re not quite on par with Nothing’s higher-end Ears, but you do get expressive, very enjoyable audio — and you can customize the EQ further in Nothing’s mobile app.\n\nRead my Nothing Ear (a) hands-on impressions.\n\nThe best noise-canceling earbuds\nBose QuietComfort Ultra Earbuds (2nd Gen)\nThe second generation of the Bose Ultra Earbuds carry over the chunky design from the previous gen, with improved ANC and call quality.\n\nScore: 8ProsConsExceptional ANCSecure fitWireless charging caseBulky designMerely average battery life\nWhere to Buy: $299 at Amazon $299 at Bose $299 at Best Buy\nNoise cancellation: Yes / Battery life: 6 hours (ANC on) / Water resistance: IPX4 / Bluetooth codecs: AAC, SBC, aptX Adaptive&nbsp;/ Multipoint: Yes / Works best with: Android, iOS, Windows, macOS / Ear tips: Silicone (S, M, L)\n\nThe name Bose has been synonymous with noise cancellation for decades, and it’s again proven why with the QuietComfort Ultra Earbuds (Gen 2). They offer the best noise-canceling performance available in a set of earbuds, delivering the peace and isolation many of us crave throughout the day. The second-gen earbuds bring some much-needed improvements to call quality, too, and while they don’t match the performance of our best call quality picks, the AirPods 4 or Samsung Galaxy Buds, the Bose handle noisy environments far better and allow you to sound like you in conversations.\n\nAlthough Bose added wireless charging and there’s now a little screen in the ear tips to keep earwax out of the earbuds, there’s no visual upgrade to speak of. The second-gen earbuds maintain a chunky look that’s identical to the first-gen QC Ultra Earbuds, which were already extremely similar to 2022’s QC Earbuds II. They come with three ear tips and three stabilizer sizes, providing a variety of combinations and a secure fit for different ear shapes.\n\nAs with the design, the QC Ultra Earbuds (Gen 2) sound nearly identical to their first-gen counterpart. The bass and treble are boosted, providing more bass than competitors and a lively high-end — although it can get to be a bit much on some tracks. Bose continues to stick with its three-band EQ in the app, which doesn’t allow much meaningful adjustment, but most people will appreciate the stock sound. Bose also continues to offer Immersive Audio, first introduced with the Ultra Earbuds, which is similar to Apple’s spatial audio.\n\nRead our full QC Ultra Earbuds (Gen 2) review.\n\nThe best earbuds for sports and working out\nBeats Powerbeats Pro 2\n\nScore: 8ProsConsHuzzah! Wireless charging!Adds ANC, transparency modes, spatial audioSlimmer ear hook, smaller caseAdds heart rateGreat soundNo price hikeCase is still a chonkerHeart rate is not that useful for iOS users\nWhere to Buy: $249 at Amazon $249 at Walmart $249.99 at Best Buy\nNoise cancellation: Yes / Battery life: 8 hours (ANC on) / Water resistance: IPX4 / Bluetooth codecs: AAC, SBC&nbsp;/ Multipoint: No / Works best with: Android, iOS, Windows, macOS / Ear tips: Silicone (XS, S, M, L, XL)\n\nAfter a long wait, Beats finally introduced the Powerbeats Pro 2 in early 2025. They carry forward the signature ear hook design of past Powerbeats earbuds, but improve upon the original Powerbeats Pro in several key ways. Beats added active noise cancellation and a natural-sounding transparency mode to the Pro 2; the first-gen pair lacked both. The earbuds themselves are lighter, too, and the charging case is noticeably smaller.\n\nThe Powerbeats Pro 2 also feature heart rate monitoring thanks to built-in sensors on each earbud. You might already have a fitness tracker, chest strap, or smartwatch for this purpose, but if not, you can use these with compatible apps like Nike Run Club, Runna, Ladder, Slopes, Open, Peloton, and YaoYao. The downside is that they can’t simultaneously play music and broadcast heart rate to gym equipment when paired to an iOS device, rendering the Pro 2 a better heart rate monitoring alternative for Android users than iPhone users.\n\nThe Powerbeats Pro 2 remain rated IPX4 for water resistance. While that’s not as robust as some other fitness-focused buds, it should be sufficient to survive sweat and outdoor runs in various conditions. The earbuds still offer easy-to-use physical buttons and a dedicated volume rocker, so it’s easy to control them in the middle of a workout.\n\nIf you’re an iPhone owner, the Powerbeats Pro 2 earbuds include Apple-only features like dynamic head tracking for spatial audio, auto device switching, Find My integration, and more. For Android users, Beats has an app that packs in a smaller subset of these functions.&nbsp;\n\nRead our full&nbsp;Powerbeats Pro 2 review.\n\nThe best earbuds for iPhone owners\nAirPods Pro 3\n\nScore: 9ProsConsImproved ANC and soundLonger batteryStandalone workout trackingLive translationSame priceIP57Better fitCamera remote control is handy!If you’re hoping for traditional foam ear tips, this isn’t that\nWhere to Buy: $249 at Amazon $249 at Walmart $249.99 at Best Buy\nNoise cancellation: Yes / Battery life: 8 hours (ANC on) / Water resistance: IP57 / Bluetooth codecs: AAC, SBC&nbsp;/ Multipoint: No / Works best with: iOS, macOS / Ear tips: Silicone (XXS, XS, S, M, L)\n\nApple continually adds to the features of the AirPods Pro line — either with a new product like the&nbsp;second-gen AirPods Pro,&nbsp;or with a software update, such as the one that introduced the hearing health features last year. The AirPods Pro 3 continue the trend, with (yet again) improved noise-canceling performance, heart rate sensing, newly designed ear tips with an extra XXS size, and more battery life. The splashiest update is Live Translation, which, unlike the other improvements, still needs some time to develop into a more streamlined experience.\n\nThe new foam-infused earbuds improve passive isolation and, in combination with better ANC performance, give the AirPods Pro 3 the best overall noise canceling from a pair of Apple earbuds yet. ANC performance is incredibly close to that of the Bose QC Ultra Earbuds (Gen 2), but the AirPods have a slight high-end hiss (although some people might not even notice it). A redesign of the acoustic architecture gives the AirPods Pro 3 improved bass performance over the second-gen model, and its spatial audio delivers a wider, richer listening experience.\n\nBut what’s important for many Apple users is how well the AirPods Pro 3 fit into the Apple ecosystem. A new heart sensor, which we first saw with the Powerbeats Pro 2 last winter, enables heart rate tracking for 50 different types of workouts directly from the iOS Fitness app. And unlike the Powerbeats Pro 2, the AirPods can work in conjunction with the Apple Watch, providing a secondary heart rate stream to ensure you always have the most accurate data.&nbsp;\n\nRead our full AirPods Pro 3 review.\n\nThe best earbuds for Samsung Galaxy phone owners\nSamsung Galaxy Buds 3 Pro\nThe Galaxy Buds 3 Pro are Samsung’s best-sounding wireless earbuds yet. They have a stemmed design similar to the AirPods Pro, but even if their design is a little bland, the Buds 3 Pro make up for it with great call quality, useful voice commands, and more.\n\nScore: 8ProsConsTerrific sound qualityCrisp, natural transparency / passthrough modeVoice commands are simple and so usefulGood voice callsUninspired designMidtier noise cancellation performanceNo true multipoint\nWhere to Buy: $249.99 $179.99 at Amazon $249.99 $199.99 at Samsung $249.99 $179.99 at 9Best Buy\nNoise cancellation: Yes / Battery life: 6 hours (ANC on) / Water resistance: IP57 / Bluetooth codecs: Samsung seamless, AAC, SBC&nbsp;/ Multipoint: No / Works best with: Android, Windows, macOS / Ear tips: Silicone (S, M, L)\n\nSamsung’s Galaxy Buds 3 Pro ditch the company’s more discreet designs of the past for a stemmed style that’s similar to AirPods and any number of other wireless earbuds. Boring? Maybe, but thanks to that change, we’ve found them to be more comfortable and provide better stability than the Buds 2 Pro. The sound quality is even better than before — and it was already excellent. These are right up there with Sennheiser and Technics from an audio fidelity standpoint.\n\nThe Buds 3 Pro are also a standout performer when it comes to call quality. And our favorite thing about these earbuds are the hands-free voice commands that don’t require you to say any specific wake phrase beforehand. You can just say “volume up” and / or “next song,” and it happens.\n\nBut they’re not perfect: the Buds 3 Pro lack multipoint connectivity, so they can’t connect to two devices at the same time. Just like Apple, Samsung prefers to automatically hop between products within its own walled garden ecosystem. Some people might consider this a dealbreaker, but we’ve still enjoyed the earbuds plenty without it.\n\nRead our full Galaxy Buds 3 Pro review.\n\nThe best earbuds for Google Pixel phone owners\nGoogle Pixel Buds Pro 2\n\nScore: 9ProsConsSmaller and lighter design is supremely comfortableMore powerful noise cancellationCrystal-clear transparency modeVery pleasant and detailed sound qualityANC can’t quite match BoseGoogle still refuses to add higher-quality Bluetooth codecs, limiting overall fidelityGemini Live feels more feeble than futuristic\nWhere to Buy: $229 $169 at Amazon $229 $169 at Best Buy $229 $169 at Google Store\nNoise cancellation: Yes / Battery life: 8 hours (ANC on) / Water resistance: IP54 / Bluetooth codecs: AAC, SBC&nbsp;/ Multipoint: Yes / Works best with: Android, Windows, macOS / Ear tips: Silicone (XS, S, M, L)\n\nWith the Pixel Buds Pro 2, Google has addressed most of the downsides of the original pair. They’re far smaller and lighter than the chunky first-gen Pixel Buds Pro. And there’s a small nub on the buds to help lock them in place even during intensive activities like running or exercise.\n\nGoogle’s active noise cancellation still isn’t on the same tier as Bose, but the transparency mode on the Buds Pro 2 is among the very best you’ll find. It offers a crisp, natural passthrough for the outside world when needed. Multipoint support is included, and Google’s latest earbuds eke out impressive battery life that surpasses most competitors.\n\nGot a Pixel phone? With the Pixel Buds Pro 2, you can have lengthy conversations with Google’s Gemini AI while your phone stays in your pocket. Features like head-tracking spatial audio and Clear Calling are also exclusive to those within the Pixel ecosystem. If that’s you, the Pixel Buds Pro 2 are a big step up from the previous buds in a much smaller package.\n\nRead our full Pixel Buds Pro 2 review.\n\nThe best earbuds if you own both Apple and Android devices\nBeats Studio Buds Plus\n\nScore: 8ProsConsBetter sound, ANC, and battery life than Studio BudsStandout translucent case optionImproved voice call performanceANC and transparency fall short of second-gen AirPods ProDoesn’t offer all Apple ecosystem tricksNo wireless charging or in-ear detection\nWhere to Buy: $169.95 $149.95 at Amazon $169.95 $149.95 at Walmart $169.99 $149.99 at Best Buy\nNoise cancellation: Yes / Battery life: 6 hours (ANC on) / Water resistance: IPX4 / Bluetooth codecs: AAC, SBC&nbsp;/ Multipoint: No / Works best with: Android, iOS, Windows, macOS / Ear tips: Silicone (XS, S, M, L)\n\nBeats’ Studio Buds Plus are an upgraded, better-performing revision of the Studio Buds released in 2021. This time, the company has made the noise cancellation more powerful while also improving the quality of the transparency mode and extending battery life. If you’re going for style points, it doesn’t get much cooler than the translucent color option. These earbuds are very tiny and rank up with the best in terms of overall comfort.\n\nWhat’s interesting about the Studio Buds Plus is that they use a proprietary chip that allows them to support native software features on both iOS and Android. Plenty of earbuds offer companion apps on each platform, but in the case of the Beats, they work with both Apple’s Find My and Google’s Find My Device. You also get simple one-tap pairing, no matter which operating system you’re using.\n\nThe drawback to this dual-ecosystem life is that Apple customers don’t get all the usual bells and whistles that come with AirPods or even the Beats Powerbeats Pro 2; you lose out on audio sharing, head tracking spatial audio, and other tricks. Wireless charging and an ear detection sensor (for auto-pause when a bud is removed) are also MIA, which stings a bit considering the price.\n\nRead our full Beats Studio Buds Plus review.\n\nThe best earbuds for sound quality\nSennheiser Momentum True Wireless 4\n\nScore: 8ProsConsFantastic sound qualityImproved day-to-day reliabilityAuracast-enabledToo pricey for someNoise cancellation does the job, but isn’t anything specialLong-term durability remains to be seen\nWhere to Buy: $349.95 $299.95 at Amazon $349.95 $299.95 at B&amp;H Photo $349.95 $299.95 at Sennheiser\nNoise cancellation: Yes / Battery life: 7.5 hours (ANC on) / Water resistance: IP54 / Bluetooth codecs: AptX Adaptive, AptX, AAC, SBC&nbsp;/ Multipoint: Yes / Works best with: Android, iOS, Windows, macOS / Ear tips: Silicone (XS, S, M, L)\n\nSennheiser’s Momentum True Wireless earbuds have always sounded fantastic; that’s never been the issue. But previous models in the series have been tainted a bit by bugs, unsteady performance, and battery reliability problems. The fourth-gen pair finally gets that part right while continuing to offer tremendous, detailed sound quality that stands above nearly all competitors. They’re a joy to listen to. The active noise cancellation can’t compete with the likes of Apple, Sony, and Bose, but if you care more about lush, intricate sound, the MTW4 won’t disappoint in the slightest.\n\nThese earbuds come with optional wing tips to help keep them securely locked in your ears. That could prove helpful for running or when hitting the gym. Sennheiser allows for plenty of EQ customization using its mobile app, and the Momentum True Wireless 4 support a range of Bluetooth codecs, including AAC, SBC, AptX, and AptX Adaptive. Sennheiser has also promised that they’re LE Audio and Auracast-ready for when those features become more widespread.\n\nRead our&nbsp;full Momentum True Wireless 4 review.\n\nThe best earbuds for voice calls on iPhone\nApple AirPods 4\n\nScore: 7ProsConsUpgraded sound qualityVoice isolation can noticeably improve call clarityDeep Apple ecosystem integrationNo wireless chargingNo built-in speaker on the caseNo proper multipoint\nWhere to Buy: $129 $119 at Amazon $129 $119 at Walmart $129.99 at Best Buy\nNoise cancellation: Optional / Battery life: 5 hours / Water resistance: IP54 / Bluetooth codecs: AAC, SBC&nbsp;/ Multipoint: No / Works best with: iOS, Windows, macOS / Ear tips: None\n\nApple’s AirPods 4 come in two different versions, with a higher-priced option that includes active noise cancellation and wireless charging. But sound quality is identical on both sets, and equally as important in this case is that the same can be said of voice call clarity.\n\nOn the AirPods 4, there’s a new “voice isolation” feature — enabled by default — that uses machine learning both on the earbuds and your iPhone to eliminate distracting background noise on your end so that you come through clearly to whoever you’re speaking with.\n\nOverall call quality is excellent with the AirPods 4. And beyond that, compared to the third-gen model, you can expect upgraded audio quality (with richer bass), new ways of interacting with Siri through head movements, and yes&#8230; there’s a USB-C connector on the included charging case, as opposed to a Lightning port.\n\nThe AirPods still have a one-size-fits-most hard plastic form factor, so we recommend trying them before committing to a purchase. However, Apple says it used more than 50 million data points to further refine the contours and overall stability of its latest earbuds. So, if previous models worked well for you, these seem like a safe bet. The only question is whether you feel like spending a little more to gain ANC, a transparency mode, wireless charging, and a built-in speaker for Find My location tracking.\n\nRead our full AirPods 4 review.\n\nThe best earbuds for voice calls on Android\nSamsung Galaxy Buds 3 Pro\n\nScore: 8ProsConsTerrific sound qualityCrisp, natural transparency / passthrough modeVoice commands are simple and so usefulGood voice callsUninspired designMidtier noise cancellation performanceNo true multipoint\nWhere to Buy: $249.99 $179.99 at Amazon $249.99 $199.99 at Samsung $249.99 $179.99 at 9Best Buy\nNoise cancellation: Yes / Battery life: 6 hours (ANC on) / Water resistance: IP57 / Bluetooth codecs: Samsung seamless, AAC, SBC&nbsp;/ Multipoint: No / Works best with: Android, Windows, macOS / Ear tips: Silicone (S, M, L)\n\nSony’s unconventional LinkBuds were our longtime pick for the clearest voice calls on Android, but we haven’t had the chance to review their successors. For now, the aforementioned Galaxy Buds 3 Pro are an easy-to-recommend choice. The built-in “voice pickup unit” detects the movement of your mouth to help isolate your voice from background noise and keep conversations clear.\n\nThe Buds 3 Pro have proven dependable for us during video chats on Google Meet, and people have been able to hear us without issue, even when answering a quick call on the street.\n\nRead our&nbsp;full Galaxy Buds 3 Pro review.\n\nUpdate, November 7th: Updated to add the Bose QuietComfort Ultra Earbuds (Gen 2) and Apple AirPods Pro 3 as picks, and to reflect current pricing / availability.",
      "content_length": 22889,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Windows 11 26H1: Unterstützung für bestimmte Prozessoren",
      "link": "https://www.heise.de/news/Windows-11-26H1-Unterstuetzung-fuer-bestimmte-Prozessoren-11071382.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-08T12:11:00",
      "content": "Die Gerüchteküche brodelte, nun hat Microsoft eine Insider-Vorschau für Windows 11 26H1 herausgegeben. Sie unterstützt bestimmte CPUs.",
      "content_length": 134,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Steam-Spiele laufen auch auf Android (ja, wirklich)",
      "link": "https://www.heise.de/news/Steam-Spiele-laufen-auch-auf-Android-ja-wirklich-11070912.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-07T15:00:00",
      "content": "Fast ohne Frickelei: Emulations-Apps wie GameHub oder Winlator bringen Windows-Spiele auf Android zum Laufen.",
      "content_length": 109,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Ende der Krise? Die Niederlande würden Kontrolle über Nexperia wieder abgeben",
      "link": "https://www.heise.de/news/Ende-der-Krise-Die-Niederlande-wuerden-Kontrolle-ueber-Nexperia-wieder-abgeben-11069118.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-07T08:44:00",
      "content": "Wenn China den Export von Nexperia-Produkten wieder zulässt, würden die Niederlande die Kontrolle über das Unternehmen abgeben. Das berichtet Bloomberg.",
      "content_length": 152,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Cisco: Tausende Firewalls verwundbar, neue Angriffswege beobachtet",
      "link": "https://www.heise.de/news/Cisco-Tausende-Firewalls-verwundbar-neue-Angriffswege-beobachtet-11068989.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-07T07:32:00",
      "content": "Zum Missbrauch der seit Ende September bekannten Sicherheitslücken in Cisco-Firewalls haben Angreifer neue Wege gefunden. Tausende sind verwundbar.",
      "content_length": 147,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "\"GTA 6\": Nächster Teil der Open-World-Saga um weitere sechs Monate verschoben",
      "link": "https://www.heise.de/news/GTA-6-Naechster-Teil-der-Open-World-Saga-um-weitere-sechs-Monate-verschoben-11068955.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-07T06:02:00",
      "content": "\"Grand Theft Auto VI\" wird frühestens in einem Jahr erscheinen, das sind noch einmal sechs Monate später als bislang angekündigt. Das hat Rockstar mitgeteilt.",
      "content_length": 158,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Vorsicht Kunde: Strafen im Bahnverkehr",
      "link": "https://www.heise.de/news/Vorsicht-Kunde-Strafen-im-Bahnverkehr-11067893.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-07T05:00:00",
      "content": "Das Bahnticket in der App ist praktisch. Doch fällt die App bei einer Kontrolle aus, droht eine Strafe. Wir erklären die Rechtslage und geben Tipps.",
      "content_length": 148,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Bundestag: Polizei darf mit Staatstrojanern Geldautomatensprenger jagen",
      "link": "https://www.heise.de/news/Bundestag-Polizei-darf-mit-Staatstrojanern-Geldautomatensprenger-jagen-11068749.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-06T18:05:00",
      "content": "Die Abgeordneten haben ein Gesetz zu Explosionsgefährdungen beschlossen. Strafverfolger dürfen damit eine Quellen-TKÜ bei Geldautomatensprengungen durchführen.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Frankreich kontrolliert 200.000 Shein-Pakete am Flughafen",
      "link": "https://www.heise.de/news/Frankreich-kontrolliert-200-000-Shein-Pakete-am-Flughafen-11068739.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-06T17:42:00",
      "content": "Gefährliche Spielzeuge, gefälschte Kosmetik und verbotene Produkte: Frankreich nimmt 200.000 Shein-Pakete am Flughafen auseinander. Was dahinter steckt.",
      "content_length": 152,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Windows: Oktober-Sicherheitsupdates können Bitlocker-Wiederherstellung auslösen",
      "link": "https://www.heise.de/news/Windows-Oktober-Sicherheitsupdates-koennen-Bitlocker-Wiederherstellung-ausloesen-11068172.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-06T12:57:00",
      "content": "Die Sicherheitsupdates vom Oktober-Patchday für Windows können dazu führen, dass die Bitlocker-Wiederherstellung startet.",
      "content_length": 121,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Microsoft: Millionen-Rückzahlungen in Australien wegen teurer Office-Abos mit KI",
      "link": "https://www.heise.de/news/Microsoft-Millionen-Rueckzahlungen-in-Australien-wegen-teurer-Office-Abos-mit-KI-11068054.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-06T12:25:00",
      "content": "Nach Klageeinreichung von Australiens Verbraucherschutzbehörde wegen verteuerter Office-Abos mit KI bietet Microsoft Rückzahlungen an.",
      "content_length": 134,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Standardmodell der Kosmologie falsch? Expansion des Universums verlangsamt sich",
      "link": "https://www.heise.de/news/Standardmodell-der-Kosmologie-falsch-Expansion-des-Universums-verlangsamt-sich-11067763.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-06T11:13:00",
      "content": "Seit Jahrzehnten geht man davon aus, dass sich die Expansion des Universums beschleunigt – dafür gab es gar den Nobelpreis. Nun werden die Zweifel noch lauter.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Have I Been Pwned: Milliarden neuer Passwörter in Sammlung",
      "link": "https://www.heise.de/news/Have-I-Been-Pwned-Milliarden-neuer-Passwoerter-in-Sammlung-11067453.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-06T08:46:00",
      "content": "Aus Infostealer-Datensätzen konnte Have-I-Been-Pwned-Betreiber Troy Hunt 1,3 Milliarden einzigartige Passwörter extrahieren.",
      "content_length": 124,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Gnome wirft X11-Backend endgültig raus",
      "link": "https://www.heise.de/news/X11-in-Gnome-ist-Geschichte-Backend-entfernt-11066916.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-05T16:30:00",
      "content": "Angedeutet hatte es sich schon, nun haben die Entwickler durchgezogen: Sie haben den X11-Backend-Code aus Gnome entfernt.",
      "content_length": 121,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "\"Entlastungskabinett\": Mehr als nur das offizielle Aus für DE-Mail",
      "link": "https://www.heise.de/news/Entlastungskabinett-Mehr-als-nur-das-offizielle-Aus-fuer-DE-Mail-11066393.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-05T11:14:00",
      "content": "Die schwarz-rote Bundesregierung will den Alltag für Bürgerinnen und Bürger, aber auch für Unternehmen einfacher machen. Das soll Kosten und Aufwand sparen.",
      "content_length": 156,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Badcandy: Angreifer brechen tausendfach in alte Cisco-IOS-XE-Lücke ein",
      "link": "https://www.heise.de/news/Badcandy-Alte-Luecke-in-Cisco-IOS-XE-noch-tausendfach-missbraucht-11064981.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-05T11:11:00",
      "content": "Ein Update gegen die Cisco-IOS-XE-Lücke CVE-2023-20198 gibt es seit 2023. Die Shadowserver Foundation sieht 15.000 infizierte Geräte.",
      "content_length": 133,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "\"Operation Chargeback\": Umfangreicher Missbrauch mit Mini-Abbuchungen aufgedeckt",
      "link": "https://www.heise.de/news/Operation-Chargeback-Grossangelegter-Betrug-mit-Kreditkartendaten-aufgedeckt-11061633.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-05T10:37:00",
      "content": "Deutschen Strafverfolgungsbehörden ist nach eigenen Angaben ein großer Schlag gegen ein Betrugsnetzwerk gelungen. Das hat Zahlungsdienstleister kompromittiert.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Microsoft gibt Tipps für erweiterten Support für kommerzielles Windows 10",
      "link": "https://www.heise.de/news/Microsoft-gibt-Tipps-fuer-erweiterten-Support-fuer-kommerzielles-Windows-10-11057081.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-05T08:06:00",
      "content": "Windows 10 erhält seit dem 14. Oktober keinen Support mehr. Microsoft gibt Admins Tipps für kommerziellen, erweiterten Support.",
      "content_length": 127,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Paukenschlag: Google und Epic einigen sich auf weltweite Android-Änderungen",
      "link": "https://www.heise.de/news/Google-und-Epic-einigen-sich-auf-weltweite-Android-Aenderungen-11057051.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-05T07:25:00",
      "content": "Überraschend haben sich Google und Epic im Android-Gerichtsstreit auf einen gemeinsamen Vorschlag geeinigt. Die geplanten Änderungen sollen weltweit gelten. ",
      "content_length": 157,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "AirPods Pro und AirPods 4: Live-Übersetzung kommt nach Europa",
      "link": "https://www.heise.de/news/AirPods-Pro-und-AirPods-4-Live-Uebersetzung-kommt-nach-Europa-11055015.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-04T18:00:00",
      "content": "Die KI-Übersetzungsfunktion kommt im Dezember auf unterstützte iPhones und Apple-Hörer. Als Grund für die Verzögerung nennt Apple den Digital Markets Act.",
      "content_length": 154,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Telekom-Rechenzentrum mit 10.000 Nvidia-GPUs entsteht in München",
      "link": "https://www.heise.de/news/Telekom-Rechenzentrum-mit-10-000-Nvidia-GPUs-entsteht-in-Muenchen-11056756.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-04T16:21:00",
      "content": "In Partnerschaft mit Nvidia baut die Telekom ein KI-Rechenzentrum in München und will damit \"das Wasser testen\". Die Dienste laufen unter deutscher Flagge.",
      "content_length": 155,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Cyberkriminelle brechen in Logistikunternehmen ein und stehlen Fracht",
      "link": "https://www.heise.de/news/Cyberkriminelle-brechen-in-Logistikunternehmen-ein-und-stehlen-Fracht-11053409.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-04T13:49:00",
      "content": "IT-Forscher beobachten, wie Cyberkriminelle in die IT von Logistikunternehmen einbrechen und schließlich wertvolle Fracht stehlen.",
      "content_length": 130,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Astronomie: Interstellarer Komet 3I/ATLAS wieder von der Erde aus sichtbar",
      "link": "https://www.heise.de/news/Astronomie-Interstellarer-Komet-3I-ATLAS-wieder-von-der-Erde-aus-sichtbar-11040533.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-04T09:37:00",
      "content": "Ein Astronom aus den USA hat in den frühen Morgenstunden mehrere Aufnahmen des interstellaren Kometen 3I/ATLAS gemacht. Er war vorher nicht für uns sichtbar.",
      "content_length": 157,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Natrium-Ionen-Batterie: Fraunhofer ersetzt kritische Rohstoffe durch Holz",
      "link": "https://www.heise.de/news/Fraunhofer-forscht-an-kleinen-aufladbaren-Batterien-mit-Material-aus-Holzresten-11039553.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-04T09:11:00",
      "content": "Das Fraunhofer IKTS will die Batterieproduktion nachhaltiger gestalten und kritische Rohstoffe zunehmend ersetzen. Ein mögliches Material ist Holz. ",
      "content_length": 148,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Tansania: Internetblockade nach fünf Tagen beendet, WhatsApp & Co. noch gesperrt",
      "link": "https://www.heise.de/news/Tansania-Internetblockade-nach-fuenf-Tagen-beendet-WhatsApp-Co-noch-gesperrt-11038139.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-04T08:21:00",
      "content": "Fast eine Woche war Tansania komplett offline, jetzt geht das Internet wieder. Soziale Netzwerke und Messenger werden aber offenbar weiterhin blockiert.",
      "content_length": 152,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Microsoft führt Passkey-Synchronisation in Edge ein",
      "link": "https://www.heise.de/news/Microsoft-fuehrt-Passkey-Synchronisation-in-Edge-ein-11038464.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-04T08:09:00",
      "content": "Microsofts Passwort-Manager im Webbrowser Edge kann Passkeys jetzt speichern und über Windows-Geräte synchronisieren.",
      "content_length": 117,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Zero-Day-Lücke bei LNK-Anzeige in Windows gegen Diplomaten missbraucht",
      "link": "https://www.heise.de/news/Windows-Zero-Day-Luecke-bei-LNK-Anzeige-gegen-Diplomaten-missbraucht-10983101.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-03T13:39:00",
      "content": "Microsoft hält eine Lücke in der LNK-Anzeige für nicht behebenswert. Sie wurde inzwischen gegen europäische Diplomaten missbraucht.",
      "content_length": 131,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "KI-Musik: Nutzer-Frust nach Einigung zwischen Universal Music und Udio",
      "link": "https://www.heise.de/news/KI-Musik-Nutzer-Frust-nach-Einigung-zwischen-Universal-Music-und-Udio-10980796.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-03T12:55:00",
      "content": "Universal Music hat eine Einigung zum KI-Training mit der Udio-Plattform erzielt. Nutzer sind frustriert: Downloads gibt es nicht mehr.",
      "content_length": 135,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Windows bekommt gemeinsames Musikhören mit Bluetooth LE Shared Audio",
      "link": "https://www.heise.de/news/Windows-bekommt-gemeinsames-Musikhoeren-mit-Bluetooth-LE-Shared-Audio-10967210.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-03T09:56:00",
      "content": "Neue Windows-Insider-Vorschauen bringen \"Shared Audio\" für Bluetooth LE mit. Damit lässt sich der Klang auf zwei Geräten zugleich ausgeben.",
      "content_length": 139,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "100 Tage Handelsdeal: Wie Trump-Zölle die Wirtschaft treffen",
      "link": "https://www.heise.de/news/100-Tage-Handelsdeal-Wie-Trump-Zoelle-die-Wirtschaft-treffen-10969514.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-03T08:50:00",
      "content": "Ende Juli einigten sich Brüssel und Washington im Zollstreit. Mit dem Abkommen wurde das Schlimmste abgewendet, doch spürbare Folgen bleiben.",
      "content_length": 141,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Geschmolzenes Glas: Erstmals fahrendes Fahrzeug von einem Meteoriten getroffen?",
      "link": "https://www.heise.de/news/Australien-Moeglicherweise-erstmals-fahrendes-Fahrzeug-von-Meteorit-getroffen-10966995.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-03T08:41:00",
      "content": "In Australien untersucht ein Museumsexperte, ob einem brandneuen Tesla von einem Meteoriten die Windschutzscheibe zerschlagen wurde. Noch besteht Skepsis.",
      "content_length": 154,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Dänemark verabschiedet sich überraschend von Plänen für die Chatkontrolle",
      "link": "https://www.heise.de/news/Daenemark-verabschiedet-sich-ueberraschend-von-Plaenen-fuer-die-Chatkontrolle-10965218.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-30T17:36:00",
      "content": "Überraschende Wende: die Ratspräsidentschaft hat ihre Pläne begraben, WhatsApp & Co. zur Suche nach Missbrauchsdarstellungen zu verpflichten",
      "content_length": 140,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Internetpionier: Bending Spoons aus Italien übernimmt jetzt auch AOL",
      "link": "https://www.heise.de/news/Internetpionier-Bending-Spoons-aus-Italien-uebernimmt-jetzt-auch-AOL-10965148.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-30T16:56:00",
      "content": "Die Einkaufstour von Bending Spoons geht weiter, das italienische Unternehmen kauft jetzt auch AOL. Übernommen werden die Website und der Mail-Provider.",
      "content_length": 152,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Monitoring-Software Checkmk: Update stopft kritische Cross-Site-Scripting-Lücke",
      "link": "https://www.heise.de/news/Monitoring-Software-Checkmk-Update-stopft-kritische-Cross-Site-Scripting-Luecke-10964747.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-30T13:20:00",
      "content": "Aktuelle Versionen der Monitoring-Software Checkmk schließen eine als kritisches Risiko eingestufte Cross-Site-Scripting-Lücke.",
      "content_length": 127,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "China bestätigt Pause bei Kontrollen auf Seltene Erden, Forderung an die EU",
      "link": "https://www.heise.de/news/Nach-Trump-Treffen-China-bestaetigt-Pause-bei-Kontrollen-auf-Seltene-Erden-10964433.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-30T10:52:00",
      "content": "Nach dem Treffen von Xi und Trump bleiben Details zu den Einigungen der beiden Staatschefs zunächst vage. Bei einem wichtigen Thema legt Peking aber nach.",
      "content_length": 154,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "GIMP: Manipulierte Bilder können Schadcode einschmuggeln",
      "link": "https://www.heise.de/news/Bildbarbeitung-GIMP-Version-3-0-6-schliesst-Codeschmuggel-Lecks-10964002.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-30T09:10:00",
      "content": "Die GIMP-Version 3.0.6 schließt einige hochriskante Sicherheitslücken. Angreifer können mit präparierten Bildern Malware einschleusen.",
      "content_length": 134,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Internationaler Strafgerichtshof wirft Microsoft raus",
      "link": "https://www.heise.de/news/Internationaler-Strafgerichtshof-wirft-Microsoft-raus-10964080.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-30T08:32:00",
      "content": "Der Internationale Strafgerichtshof wirft laut Handelsblatt US-Dienstanbieter wie Microsoft raus. Und setzt auf deutsche Alternativen.",
      "content_length": 134,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Microsofts Cloud ist auf dem Weg der Besserung",
      "link": "https://www.heise.de/news/Microsofts-Cloud-ist-auf-dem-Weg-der-Besserung-10963824.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-29T20:58:00",
      "content": "Kurz nach Mitternacht MEZ soll Azure wieder weitgehend funktionieren. Konfigurationsänderungen sind vorerst nicht möglich, eventuell aber Umleitungen.",
      "content_length": 150,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Hightech-Agenda: Merz setzt auf \"Wertschöpfung und technologische Souveränität\"",
      "link": "https://www.heise.de/news/Hightech-Agenda-Merz-fordert-Schulterschluss-fuer-technologische-Souveraenitaet-10963752.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-29T18:40:00",
      "content": "Deutschland muss Innovationsführer werden, betont der Kanzler. Die Hightech-Agenda fokussiere auf Schlüsseltechnologien, um sie auf Wertschöpfung auszurichten.\n",
      "content_length": 160,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Störung bei Microsofts Cloud: Ausfälle bei Outlook und Co. gemeldet",
      "link": "https://www.heise.de/news/Stoerung-bei-Microsofts-Cloud-Ausfaelle-bei-Outlook-und-Co-gemeldet-10963686.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-29T16:49:00",
      "content": "Nutzer melden Ausfälle zahlreicher Dienste, unter anderem sind Office und Minecraft betroffen. Der Konzern untersucht einen Ausfall seines weltweiten CDNs. ",
      "content_length": 156,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Collins Aerospace: Mangelhafte Passwörter ermöglichten Nachrichten an Cockpits",
      "link": "https://www.heise.de/news/Collins-Aerospace-Mangelhafte-Passwoerter-ermoeglichten-Nachrichten-an-Cockpits-10963151.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-29T13:20:00",
      "content": "Durch mangelhaften Zugriffsschutz bei Collins Aerospace ließen sich Nachrichten an Flugzeug-Cockpits schicken.",
      "content_length": 110,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Drama zwischen zwei Weltkriegen: Arte kündigt VR-Adventure \"The Amusement\" an",
      "link": "https://www.heise.de/news/Drama-zwischen-zwei-Weltkriegen-Arte-kuendigt-VR-Adventure-The-Amusement-an-10961321.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-28T10:49:00",
      "content": "In Zusammenarbeit mit dem deutschen Studio Curvature Games hat der europäische Kultursender Arte das Virtual-Reality-Spiel \"The Amusement\" angekündigt. ",
      "content_length": 152,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "\"Keine realistische Alternative\": Signal-Chefin verteidigt Nutzung von AWS",
      "link": "https://www.heise.de/news/Keine-realistische-Alternative-Signal-Chefin-verteidigt-Nutzung-von-AWS-10961198.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-28T10:48:00",
      "content": "Als AWS vor einer Woche ausgefallen ist, hatte Signal eine Weile massive Probleme. Meredith Whittaker erklärt nun, warum der Messenger darauf angewiesen ist.",
      "content_length": 157,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Wikipedia-Alternative von Elon Musk: Grokipedia mit 885.000 Artikeln freigegeben",
      "link": "https://www.heise.de/news/Wikipedia-Alternative-von-Elon-Musk-Grokipedia-mit-885-000-Artikeln-freigegeben-10960496.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-28T06:04:00",
      "content": "Die Wikipedia ist Elon Musk ein Dorn im Auge, Anfang des Monats hat er eine KI-generierte Alternative angekündigt. Diese Grokipedia ist nun abrufbar.",
      "content_length": 149,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Preisschock bei Microsoft 365 mit Copilot: Australische Behörde reicht Klage ein",
      "link": "https://www.heise.de/news/Preisschock-bei-Microsoft-365-mit-Copilot-Australische-Behoerde-reicht-Klage-ein-10900222.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-27T06:11:00",
      "content": "Nachdem Microsoft die Preise für das Office-Abo nach der Integration der Copilot-KI deutlich angehoben und eine Alternative versteckt hat, gibt es eine Klage.",
      "content_length": 158,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "WSUS-Lücke: Bereits Attacken beobachtet",
      "link": "https://www.heise.de/news/WSUS-Luecke-Bereits-Attacken-beobachtet-10899799.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-25T06:57:00",
      "content": "Microsoft hat am Freitagmorgen Notfallupdates für eine WSUS-Sicherheitslücke veröffentlicht. Die wird nun im Internet angegriffen.",
      "content_length": 130,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "AWS-Ausfall: Amazon legt vollständigen Ursachenbericht vor",
      "link": "https://www.heise.de/news/AWS-Ausfall-Amazon-legt-vollstaendigen-Ursachenbericht-vor-10848208.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-24T11:41:00",
      "content": "Der AWS-Ausfall Anfang der Woche hat viele Internet-Dienste lahmgelegt. Amazon hat nun einen vollständigen Bericht veröffentlicht.",
      "content_length": 130,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Angreifer attackieren kritische Lücke in Adobe Commerce und Magento",
      "link": "https://www.heise.de/news/Angreifer-attackieren-kritische-Luecke-in-Adobe-Commerce-und-Magento-10845752.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-24T07:11:00",
      "content": "Im September hat Adobe Updates für Commerce und Magento veröffentlicht, die eine kritische Lücke schließen. Die wird nun angegriffen.",
      "content_length": 133,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Microsoft WSUS: Notfallupdate stopft kritische Codeschmuggel-Lücke",
      "link": "https://www.heise.de/news/Microsoft-WSUS-Notfallupdate-stopft-kritische-Codeschmuggel-Luecke-10845666.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-24T06:07:00",
      "content": "Am Freitagmorgen hat Microsoft ein Notfall-Update für eine kritische Sicherheitslücke in WSUS veröffentlicht. Ein Exploit wurde gesichtet.",
      "content_length": 138,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Vorsicht Kunde: Unsichere Packstation",
      "link": "https://www.heise.de/news/Vorsicht-Kunde-Unsichere-Packstation-10845620.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-24T04:25:00",
      "content": "Packstationen sind praktisch, der Paketempfang klappt meist reibungslos, doch beim Versand lauern Risiken und bei einem Sendungsverlust droht der Totalschaden.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Seekabel: EU warnt vor Abhängigkeit von US-Hyperscalern",
      "link": "https://www.heise.de/news/Seekabel-EU-warnt-vor-Abhaengigkeit-von-US-Hyperscalern-10824923.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-23T14:21:00",
      "content": "Ein EU-Bericht warnt vor Europas Abhängigkeit von US-Technologiekonzernen bei Unterseekabeln und kritischen Komponenten. Auch die Reparatur ist gefährdet.",
      "content_length": 154,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "LKA Niedersachsen warnt vor Guthabenkarten-Betrugsmasche",
      "link": "https://www.heise.de/news/LKA-Niedersachsen-warnt-vor-Guthabenkarten-Betrugsmasche-10819486.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-23T12:29:00",
      "content": "Das LKA Niedersachsen sieht eine Häufung von Betrugsversuchen, bei denen Täter sich als Bekannte ausgeben und Guthabenkarten wollen.",
      "content_length": 132,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Nexperia-Krise: Wirtschaftsministerium sieht \"erhebliche Betroffenheit\"",
      "link": "https://www.heise.de/news/Nexperia-Krise-Wirtschaftsministerium-sieht-erhebliche-Betroffenheit-10819376.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-23T11:35:00",
      "content": "Die Folgen der Auseinandersetzung um den Chiphersteller Nexperia sind weiter unklar. Das Bundeswirtschaftsministerium spricht von \"erheblicher Betroffenheit\".\n",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "KDE Plasma 6.5 kommt mit kurvigen Ecken",
      "link": "https://www.heise.de/news/KDE-Plasma-6-5-kommt-mit-kurvigen-Ecken-10813730.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-23T09:11:00",
      "content": "Die neue Version der Desktop-Umgebung KDE Plasma schleift die Fensterecken rund, verbessert die Zwischenablage und legt bei der Barrierefreiheit nach.",
      "content_length": 150,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Falschinformation durch KI: 45 Prozent der Antworten fehlerhaft",
      "link": "https://www.heise.de/news/Europaeische-Rundfunkunion-KI-Systeme-geben-Nachrichteninhalte-oft-falsch-wider-10796779.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-22T15:16:00",
      "content": "Im Rahmen einer Studie interpretierten ChatGPT & Co. in 45 Prozent der Fälle Nachrichteninhalte fehlerhaft – unabhängig von Sprache, Region oder Plattform.",
      "content_length": 155,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Windows: Netzwerkprobleme durch geklonte Installationen",
      "link": "https://www.heise.de/news/Windows-Anmeldeprobleme-im-Netz-mit-geklonten-SIDs-10794271.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-22T11:24:00",
      "content": "Seit den Update-Vorschauen aus dem August klemmt die Netzwerkanmeldung von geklonten Windows-Installationen mit identischen SIDs.",
      "content_length": 129,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Bahn zieht Reißleine: Cargo-Chefin Nikutta muss gehen",
      "link": "https://www.heise.de/news/Bahn-zieht-Reissleine-Cargo-Chefin-Nikutta-muss-gehen-10794333.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-22T10:03:00",
      "content": "Seit 2020 hat Sigrid Nikutta versucht, DB Cargo zu sanieren. Nach Kritik der Gewerkschaft und einem verheerenden Gutachten zieht der Konzern Konsequenzen.",
      "content_length": 154,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Have I Been Pwned: 183 Millionen Zugänge  aus Infostealer-Sammlung hinzugefügt",
      "link": "https://www.heise.de/news/Have-I-Been-Pwned-183-Millionen-von-Infostealern-erbeutete-Zugaenge-ergaenzt-10793974.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-22T07:44:00",
      "content": "\"Have I Been Pwned\" sammelt veröffentlichte Zugangsdaten. Nun kamen 183 Millionen von Infostealern geklaute Konten hinzu.",
      "content_length": 121,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Ein Browser für ChatGPT: OpenAI gibt Chrome-Konkurrenten Atlas für macOS frei",
      "link": "https://www.heise.de/news/Ein-Browser-fuer-ChatGPT-OpenAI-gibt-Chrome-Konkurrenten-Atlas-fuer-macOS-frei-10793833.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-22T05:12:00",
      "content": "Wer ChatGPT beim Surfen nutzt, muss bislang noch viel zwischen Tabs wechseln und Inhalte kopieren. Das soll mit Atlas der Vergangenheit angehören, sagt OpenAI.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Gefährlicher und unsichtbarer Wurm in Visual Studio Code Extensions gefunden",
      "link": "https://www.heise.de/news/Gefaehrlicher-und-unsichtbarer-Wurm-in-Visual-Studio-Code-Extensions-gefunden-10789320.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-21T08:14:00",
      "content": "Eine Schadsoftware, die Credentials und Kryptowährungen abgreift, nutzt Unicode für unsichtbaren Code und installiert einen Remote-Access-Trojaner.",
      "content_length": 147,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Abermals neuer NTFS-Treiber für Linux vorgestellt",
      "link": "https://www.heise.de/news/Abermals-neuer-NTFS-Treiber-fuer-Linux-vorgestellt-10789388.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-21T07:18:00",
      "content": "Ein erfahrener Kernel-Hacker hat den Dateisystem-Treiber \"ntfsplus\" vorgestellt, der Schwächen bisheriger Lösungen vermeidet, aber keinen Freifahrtschein hat.",
      "content_length": 158,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Developer Snapshots: Kleinere News der Woche",
      "link": "https://www.heise.de/news/Developer-Snapshots-Kleinere-News-der-Woche-11066369.html",
      "published": "2025-11-08T08:05:00",
      "content": "Die Übersicht enthält kleine, aber interessante Meldungen zu Jupyter, Android-Entwicklung, Vitess, GitLab, GitHub, Databricks, OpenTofu, Hermit und Parasoft.",
      "content_length": 157,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Google veröffentlicht Magika 1.0 zur KI-gestützten Dateityp-Erkennung",
      "link": "https://www.heise.de/news/Google-veroeffentlicht-Magika-1-0-zur-KI-gestuetzten-Dateityp-Erkennung-11069466.html",
      "published": "2025-11-07T12:30:00",
      "content": "Google hat die erste stabile Version seines KI-gestützten Dateityp-Erkennungssystems Magika veröffentlicht. Version 1.0 wurde in Rust neu entwickelt.",
      "content_length": 149,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "KI Navigator #14: Muss KI gläsern sein? Zwischen Regulierung und Realität",
      "link": "https://www.heise.de/hintergrund/KI-Navigator-14-Muss-KI-glaesern-sein-Zwischen-Regulierung-und-Realitaet-11067941.html",
      "published": "2025-11-07T09:25:00",
      "content": "Bei der Regulierung von KI ist wie in der Physik der Blick auf das Gesamtsystem sinnvoller als die Detailanalyse, meinen Benjamin Linnik und Alex Meistrenko.",
      "content_length": 157,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "AWS startet Planungstool für regionale Service-Verfügbarkeit",
      "link": "https://www.heise.de/news/AWS-startet-Planungstool-fuer-regionale-Service-Verfuegbarkeit-11069034.html",
      "published": "2025-11-07T08:50:00",
      "content": "Mit den neuen AWS Capabilities by Region können Unternehmen ab sofort Services, Features und APIs über verschiedene globale Regionen hinweg vergleichen.",
      "content_length": 152,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Eine API für alle – Mozilla beendet LLM-Chaos",
      "link": "https://www.heise.de/news/Eine-API-fuer-alle-Mozilla-beendet-LLM-Chaos-11069100.html",
      "published": "2025-11-07T08:42:00",
      "content": "Mozilla entlastet Developer: any-llm stellt eine zentrale API für viele LLMs im Hintergrund auf. Ein mandantenfähiges Gateway verwaltet Budgets und Keys.",
      "content_length": 153,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Aus Softwarefehlern lernen – Teil 7: Der Milliarden-Dollar-Fehler",
      "link": "https://www.heise.de/hintergrund/Aus-Softwarefehlern-lernen-Teil-7-Der-Milliarden-Dollar-Fehler-11067587.html",
      "published": "2025-11-07T07:47:00",
      "content": "Ein Fehler im Konzept moderner Programmiersprachen hat laut des Erfinders Tony Hoare Schäden von vielen Milliarden Dollar verursacht.",
      "content_length": 133,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Machtwort: Yukihiro \"Matz\" Matsumoto beendet Streit in der Ruby-Community",
      "link": "https://www.heise.de/news/Machtwort-Yukihiro-Matz-Matsumoto-beendet-Streit-in-der-Ruby-Community-11067871.html",
      "published": "2025-11-06T14:12:00",
      "content": "In der Ruby-Community kehrt Ruhe ein, nachdem sie ein heftiger Machtstreit um Open-Source erschüttert hat.",
      "content_length": 106,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "OOP-Konferenz 2026: Embrace Change – lasst uns Veränderungen willkommen heißen!",
      "link": "https://www.heise.de/news/OOP-Konferenz-2026-Embrace-Change-lasst-uns-Veraenderungen-willkommen-heissen-11067347.html",
      "published": "2025-11-06T11:03:00",
      "content": "Die OOP 2026 hat mit dem Motto &quot;Embrace Change&quot; die Veränderungen im Bereich der Softwareentwicklung im Fokus.",
      "content_length": 120,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "dstask 1.0: Git-basierter Task-Manager jetzt auch für Windows",
      "link": "https://www.heise.de/news/dstask-1-0-Git-basierter-Task-Manager-jetzt-auch-fuer-Windows-11067643.html",
      "published": "2025-11-06T10:34:00",
      "content": "Der terminalbasierte Task-Manager dstask hat Version 1.0 erreicht. Die wichtigste Neuerung: Entwickler können das Tool nun auch unter Windows nutzen.",
      "content_length": 149,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Gnome wirft X11-Backend endgültig raus",
      "link": "https://www.heise.de/news/X11-in-Gnome-ist-Geschichte-Backend-entfernt-11066916.html",
      "published": "2025-11-05T16:30:00",
      "content": "Angedeutet hatte es sich schon, nun haben die Entwickler durchgezogen: Sie haben den X11-Backend-Code aus Gnome entfernt.",
      "content_length": 121,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Arbeitslos wegen KI: Laut einer Studie holen Unternehmen ihre Mitarbeiter zurück",
      "link": "https://www.heise.de/news/Arbeitslos-wegen-KI-Laut-einer-Studie-holen-Unternehmen-ihre-Mitarbeiter-zurueck-11066882.html",
      "published": "2025-11-05T16:02:00",
      "content": "Studien zeigen: Bisher können KI-Modelle menschliche Mitarbeiter nicht ersetzen. Wer entlassen wird, könnte deshalb bald wieder am selben Schreibtisch sitzen.",
      "content_length": 158,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "software-architektur.tv: Teamwork – Müssen wir darüber sprechen?",
      "link": "https://www.heise.de/news/software-architektur-tv-Teamwork-Muessen-wir-darueber-sprechen-10986000.html",
      "published": "2025-11-05T11:00:00",
      "content": "In dieser Episode gehen Aino Vonge Corry und Lisa Maria Schäfer der Frage nach, ob man heute überhaupt noch über Teamwork diskutieren muss.",
      "content_length": 139,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Daily am Morgen vertreibt Kummer und Sorgen. Oder nicht?",
      "link": "https://www.heise.de/blog/Daily-am-Morgen-vertreibt-Kummer-und-Sorgen-Oder-nicht-10879776.html",
      "published": "2025-11-05T09:19:00",
      "content": "Ich glaube zwar nicht an &quot;Best&quot; Practices, aber trotzdem frage ich manchmal danach. So auch bei der Frage, wann der beste Zeitpunkt für ein Daily ist.",
      "content_length": 160,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Insomnia 12 bringt MCP-Unterstützung und neue KI-Funktionen",
      "link": "https://www.heise.de/news/Insomnia-12-Kong-erweitert-API-Tool-um-MCP-Unterstuetzung-und-KI-Hilfen-11057170.html",
      "published": "2025-11-05T08:50:00",
      "content": "Kong erweitert seinen API-Designer mit Version 12 um MCP-Unterstützung, KI-Funktionen und verbesserte Teamfeatures für API- und Agentenentwicklung.",
      "content_length": 147,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Coden mit KI verändert die Teamarbeit und den agilen Prozess",
      "link": "https://www.heise.de/news/Coden-mit-KI-veraendert-die-Teamarbeit-und-den-agilen-Prozess-11056350.html",
      "published": "2025-11-05T07:24:00",
      "content": "Developer-Teams ändern ihre Strukturen und Arbeitsweisen durch den Einsatz von KI. Sie müssen sich neu aufstellen, meint Facundo Giuliani.",
      "content_length": 138,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Grafana Mimir 3.0: Zeitreihendatenbank jetzt mit neuer Query-Engine",
      "link": "https://www.heise.de/news/Grafana-Mimir-3-0-Zeitreihendatenbank-jetzt-mit-neuer-Query-Engine-11055426.html",
      "published": "2025-11-05T07:04:00",
      "content": "Das Grafana-Tool Mimir bringt die neue Mimir Query Engine mit, die als schnellere Alternative zur PromQL Engine von Prometheus dienen soll.",
      "content_length": 139,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Keine Chance dem Token-Klau: Das Backend-for-Frontend-Pattern",
      "link": "https://www.heise.de/hintergrund/Keine-Chance-dem-Token-Klau-Das-Backend-for-Frontend-Pattern-10988224.html",
      "published": "2025-11-04T09:59:00",
      "content": "Das Backend-for-Frontend-Pattern behebt Sicherheitsprobleme in Single-Page Applications, indem es das Token-Management auf den Server zurückverlagert.",
      "content_length": 150,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Software Testing: Rechtliche Stolperfallen in Softwareverträgen",
      "link": "https://www.heise.de/blog/Software-Testing-Rechtliche-Stolperfallen-in-Softwarevertraegen-11039561.html",
      "published": "2025-11-04T08:35:00",
      "content": "In dieser Episode sprechen Richard Seidl und Sebastian Dietrich über Fallstricke bei Freelancer-Verträgen.",
      "content_length": 106,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Die Produktwerker: Wie viel Zeit darf das Erstellen von User Stories kosten?",
      "link": "https://www.heise.de/blog/Die-Produktwerker-Wie-viel-Zeit-darf-das-Erstellen-von-User-Stories-kosten-10984544.html",
      "published": "2025-11-03T14:16:00",
      "content": "Wie viel Aufwand lohnt sich für das Schreiben von User Stories? Entscheidend ist, dass Teams Zeit in gemeinsames Denken investieren, meinen die Produktwerker.",
      "content_length": 158,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "APT-Umstellung auf Rust: Debian setzt exotische Ports unter Druck",
      "link": "https://www.heise.de/news/Debian-APT-bekommt-ab-Mai-2026-harte-Rust-Abhaengigkeit-10968522.html",
      "published": "2025-11-03T11:15:00",
      "content": "Ab Mai 2026 wird Debian APT Rust zwingend voraussetzen. Ports ohne funktionierende Rust-Toolchain haben sechs Monate Zeit – oder werden eingestellt.",
      "content_length": 148,
      "source": "Heise Developer",
      "category": "Tech News"
    }
  ],
  "stats": {
    "by_category": {
      "German News": 129,
      "International News": 69,
      "Tech News": 110
    },
    "by_source": {
      "Tagesschau": 40,
      "Tagesschau Ausland": 64,
      "Deutschlandfunk": 25,
      "The Guardian World": 45,
      "France 24 English": 24,
      "Ars Technica": 20,
      "The Verge": 10,
      "Heise Top": 60,
      "Heise Developer": 20
    }
  }
}