{
  "date": "2025-10-27",
  "timestamp": "2025-10-27T07:14:24.976980",
  "total_articles": 305,
  "articles": [
    {
      "title": "Präsident Milei kann nach Zwischenwahl in Argentinien jubeln",
      "link": "https://www.tagesschau.de/ausland/amerika/argentinien-wahlen-milei-100.html",
      "published": "2025-10-27T07:09:54",
      "content": "   Mit so einem Triumph hatte kein Umfrageinstitut in Argentinien gerechnet: Die Partei des ultraliberalen Präsidenten Milei hat bei den Zwischenwahlen mehr als 40 Prozent geholt. Er sieht den Wendepunkt überschritten. Von Anne Herrberg.[mehr]",
      "content_length": 243,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Chinas Armee simuliert offenbar Angriff auf Taiwan",
      "link": "https://www.tagesschau.de/ausland/asien/china-taiwan-angriffsmanoever-100.html",
      "published": "2025-10-27T06:50:25",
      "content": "   Simulierte Gefechte wenige Tage vor dem Trump-Xi-Treffen: Aufnahmen in chinesischen Staatsmedien sollen zeigen, wie Soldaten einen Angriff auf Taiwan proben. Taipeh spricht von \"Einschüchterung\".[mehr]",
      "content_length": 204,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Marktbericht: Was den DAX in dieser Woche bewegt",
      "link": "https://www.tagesschau.de/wirtschaft/finanzen/marktberichte/marktbericht-boerse-dax-trump-notenbanken-apple-google-microsoft-100.html",
      "published": "2025-10-27T06:39:29",
      "content": "   Die Hoffnung auf ein US-Handelsabkommen mit China gibt den Börsen weiter Auftrieb. Der DAX dürfte mit Kursgewinnen in die neue Börsenwoche starten, die ansonsten ganz im Bann von Berichtssaison und Notenbanken steht. [mehr]",
      "content_length": 226,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Trump reist nach Japan: Beim Handel könnte es knirschen",
      "link": "https://www.tagesschau.de/ausland/asien/trump-japan-reise-100.html",
      "published": "2025-10-27T04:28:06",
      "content": "   Der US-Präsident setzt seine Asien-Reise fort. Nächster Halt: Japan. Die neue Regierungschefin Takaichi und Trump haben politisch viel gemeinsam - beim Thema Wirtschaft könnte es aber Probleme geben. Von Anna-Lou Beckmann.[mehr]",
      "content_length": 231,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Venezuela sieht US-Kriegsschiffe vor Trinidad und Tobago als \"Provokation\"",
      "link": "https://www.tagesschau.de/ausland/amerika/venezuela-usa-kriegsschiffe-100.html",
      "published": "2025-10-27T04:00:48",
      "content": "   Die USA haben ein weiteres Kriegsschiff in die Karibik beordert. Diesmal nach Trinidad und Tobago - direkt vor Venezuela. Geplant sei eine Militärübung. Die Regierung in Caracas wirft der USA hingegen vor, einen Krieg zu provozieren.[mehr]",
      "content_length": 242,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Argentinien: Partei von Präsident Milei gewinnt Zwischenwahlen",
      "link": "https://www.tagesschau.de/ausland/amerika/milei-zwischenwahlen-100.html",
      "published": "2025-10-27T02:27:16",
      "content": "   Zuletzt waren seine Zustimmungswerte in Argentinien gesunken, doch nun konnte die Partei von Präsident Milei die Zwischenwahlen für sich gewinnen. Nach Auszählung fast aller Stimmen erzielte sie mehr als 40 Prozent.[mehr]",
      "content_length": 224,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Münchner Bürger stimmen für Olympia-Bewerbung",
      "link": "https://www.tagesschau.de/inland/regional/bayern/olympia-entscheid-muenchen-100.html",
      "published": "2025-10-26T20:49:49",
      "content": "   Beim Bürgerentscheid über eine mögliche Olympia-Bewerbung Münchens haben sich die Befürworter durchgesetzt. Rund 1,1 Millionen Menschen konnten über Sommerspiele in den Jahren 2036, 2040 oder 2044 abstimmen.[mehr]",
      "content_length": 216,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Bericht aus Berlin: Spahn stärkt Merz in \"Stadtbild\"-Debatte",
      "link": "https://www.tagesschau.de/inland/bericht-aus-berlin-merz-stadtbild-spahn-100.html",
      "published": "2025-10-26T18:41:36",
      "content": "   Die \"Stadtbild\"-Äußerungen von Kanzler Merz sorgen weiter für Kontroversen - dabei denke die Mehrheit der Deutschen wie der Kanzler, sagt Unions-Fraktionschef Spahn. Den Koalitionspartner SPD griff er dabei direkt an.[mehr]",
      "content_length": 226,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Rekordbeteiligung bei Olympia-Bürgerentscheid in München",
      "link": "https://www.tagesschau.de/inland/regional/bayern/muenchen-buergerentscheid-olympia-100.html",
      "published": "2025-10-26T18:03:34",
      "content": "   Die Münchnerinnen und Münchner haben abgestimmt, ob ihre Stadt sich um Olympische und Paralympische Sommerspiele bewerben soll. Fest steht bereits: Das nötige Quorum des Bürgerentscheids wurde erreicht.[mehr]",
      "content_length": 211,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Pakistan meldet Verletzung der Waffenruhe an Grenze zu Afghanistan",
      "link": "https://www.tagesschau.de/ausland/asien/pakistan-afghanistan-kaempfe-104.html",
      "published": "2025-10-26T17:36:23",
      "content": "   Erst vor einer Woche hatten sich Pakistan und Afghanistan auf eine Waffenruhe verständigt. Während sie in Istanbul Gespräche über einen dauerhaften Frieden führen, hat es nun offenbar erneut Kämpfe mit Toten gegeben.[mehr]",
      "content_length": 225,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Beschädigung von Seekabeln - Sorge um Taiwans Lebensadern",
      "link": "https://www.tagesschau.de/ausland/asien/taiwan-bedrohung-volksrepublik-100.html",
      "published": "2025-10-26T17:20:11",
      "content": "   Fremde Schiffe schleifen ihre Anker hinter sich her: Rund um Taiwan häufen sich die Schadensfälle an Seekabeln. Aus Sicht von Sicherheitsexperten spricht viel für Absicht - und eine Verwicklung Chinas. Von U. Mendgen.[mehr]",
      "content_length": 226,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Dobrindt will Schüler auf Katastrophen- und Kriegsfall vorbereiten",
      "link": "https://www.tagesschau.de/inland/innenpolitik/dobrindt-schueler-unterricht-katastrophenschutz-100.html",
      "published": "2025-10-27T05:47:35",
      "content": "   Bundesinnenminister Dobrindt fordert, dass Krisenvorsorge und mögliche Kriegsgefahren in Schulen thematisiert werden. Die Reaktionen aus der Opposition sind gemischt: Während ihm einige Panikmache vorwerfen, gibt es von anderen Zuspruch. [mehr]",
      "content_length": 247,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Vogelgrippe breitet sich rasant aus - 400.000 Tiere gekeult",
      "link": "https://www.tagesschau.de/wirtschaft/vogelgrippe-tierhalter-100.html",
      "published": "2025-10-26T16:01:17",
      "content": "   Der Schaden für betroffene Geflügelhalter geht bereits in die Millionen: Die Vogelgrippe breitet sich in Deutschland rasant aus. Bislang haben mehr als 30 Betriebe ihre Tiere töten müssen - und weitere dürften folgen.[mehr]",
      "content_length": 226,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Vorläufige Einigung im Zollstreit zwischen USA und China",
      "link": "https://www.tagesschau.de/ausland/asien/usa-china-annaeherung-zollstreit-100.html",
      "published": "2025-10-26T15:48:25",
      "content": "   Können US-Präsident Trump und sein chinesischer Amtskollege Xi den Zollstreit beilegen? Kurz vor einem geplanten Treffen der beiden Staatschefs sind beide Seiten zumindest zu einer vorläufigen Einigung gelangt.[mehr]",
      "content_length": 219,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Ukraine-Liveblog: ++ Kiew: Russische Soldaten in Pokrowsk eingedrungen ++",
      "link": "https://www.tagesschau.de/newsticker/liveblog-ukraine-sonntag-604.html",
      "published": "2025-10-26T21:31:55",
      "content": "   Russischen Soldaten ist es nach Angaben aus Kiew gelungen, in die umkämpfte Stadt Pokrowsk einzudringen. Bei einem Drohnenangriff auf die Hauptstadt Kiew sind mindestens drei Menschen getötet und 29 verletzt worden.[mehr]",
      "content_length": 224,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Gaza: Israel will selbst über internationale Truppen bestimmen",
      "link": "https://www.tagesschau.de/ausland/asien/gaza-israel-friedenstruppen-suche-nach-geiseln-100.html",
      "published": "2025-10-26T14:57:34",
      "content": "   Zur Sicherung des Gazastreifens wird über den Einsatz von Friedenstruppen diskutiert. Israel will dabei über beteiligte Länder entscheiden. Unterdessen geht die Suche nach den verbliebenen Leichen von Geiseln weiter.[mehr]",
      "content_length": 225,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Putin gibt abschließenden Test der Atomrakete \"Burewestnik\" bekannt",
      "link": "https://www.tagesschau.de/ausland/asien/russland-putin-atomrakete-burewestnik-100.html",
      "published": "2025-10-26T12:10:24",
      "content": "   Russland hat nach den Worten von Präsident Putin einen neuartigen, atomgetriebenen Marschflugkörper getestet und will die Waffe nun stationieren. \"Burewestnik\" ist ihm zufolge unbesiegbar und kann 14.000 Kilometer zurücklegen.[mehr]",
      "content_length": 235,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Zwischenwahlen in Argentinien - Stresstest für Milei",
      "link": "https://www.tagesschau.de/ausland/amerika/argentinien-zwischenwahlen-100.html",
      "published": "2025-10-26T11:36:53",
      "content": "   Argentinien wählt Teile des Kongresses neu. Für Präsident Milei eine Art Stresstest, nachdem seine Zustimmungsraten zuletzt gesunken sind. Kann er seinen radikalen Kurs fortsetzen - und nutzt ihm Hilfe von Trump? Von A. Herrberg.[mehr]",
      "content_length": 238,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "\"Stadtbild\"-Debatte: Gewerkschaft der Polizei für mehr Beamte in Bahnhöfen",
      "link": "https://www.tagesschau.de/inland/innenpolitik/rosskopf-gewerkschaft-der-polizei-merz-100.html",
      "published": "2025-10-26T12:17:48",
      "content": "   Die größte deutsche Polizeigewerkschaft GdP hat größere Präsenz und Kontrollmöglichkeiten an Bahnhöfen gefordert. Damit ließen sich die Sicherheit erhöhen und die von Kanzler Merz beschriebenen \"Probleme im Stadtbild\" angehen.[mehr]",
      "content_length": 235,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Bankenaufsicht: Die Note 3 für Banken ist nicht gut genug",
      "link": "https://www.tagesschau.de/wirtschaft/finanzen/banken-regulierung-bankenaufsicht-100.html",
      "published": "2025-10-26T09:51:56",
      "content": "   Noch immer ist die Bankenaufsicht in Europa mit den Geldhäusern nicht zufrieden. 85 Prozent bekamen 2024 die Note 3, heißt es. Probleme sind etwa die Gehaltsstruktur und das Risikomanagement in den Banken. Von Ingo Nathusius.[mehr]",
      "content_length": 234,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "PKK kündigt Verlegung ihrer Kämpfer aus der Türkei in den Nordirak an",
      "link": "https://www.tagesschau.de/ausland/europa/tuerkei-pkk-abzug-truppen-100.html",
      "published": "2025-10-26T12:54:04",
      "content": "   Die PKK zieht nach eigenen Angaben ihre Kämpfer aus der Türkei ab - ein weiterer Schritt im Friedensprozess zwischen ihr und dem türkischen Staat. Die kurdische Arbeiterpartei ist in vielen Ländern als Terrororganisation eingestuft.[mehr]",
      "content_length": 241,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Zwei Verdächtige nach Diebstahl im Pariser Louvre festgenommen",
      "link": "https://www.tagesschau.de/ausland/europa/frankreich-louvre-raub-festnahmen-100.html",
      "published": "2025-10-26T11:44:08",
      "content": "   Die französische Polizei hat nach dem Diebstahl historischer Schmuckstücke aus dem Pariser Louvre zwei Verdächtige festgenommen. Einer der beiden Männer sei gestern Abend am Flughafen Charles de Gaulle in Gewahrsam genommen worden.[mehr]",
      "content_length": 240,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Thailand und Kambodscha besiegeln nach Grenzstreit Waffenstillstand",
      "link": "https://www.tagesschau.de/ausland/asien/thailand-kambodscha-116.html",
      "published": "2025-10-26T07:56:51",
      "content": "   Im Juli war ein Grenzkonflikt zwischen Thailand und Kambodscha eskaliert, fünf Tage lang gab es Kämpfe. Auf dem ASEAN-Gipfel haben sie nun ein Waffenstillstandsabkommen unterzeichnet. Der US-Präsident reklamiert den Deal für sich.[mehr]",
      "content_length": 239,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Trump nimmt zum Auftakt seiner Asien-Reise an ASEAN-Gipfel teil",
      "link": "https://www.tagesschau.de/ausland/asien/trump-asean-gipfel-100.html",
      "published": "2025-10-26T12:06:21",
      "content": "   US-Präsident Trump hat seine Asienreise begonnen. Zunächst nahm er auf dem ASEAN-Gipfel in Malaysia an der Unterzeichnung des Friedensabkommens zwischen Thailand und Kambodscha teil. In Südkorea will er Chinas Staatschef Xi treffen.[mehr]",
      "content_length": 241,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Wenn der Staat die Wohnung bezahlt und die Aktionäre kassieren",
      "link": "https://www.tagesschau.de/wirtschaft/verbraucher/wohnungskonzerne-gewinne-aktionaere-100.html",
      "published": "2025-10-26T04:49:13",
      "content": "   Wohnkonzerne wie Vonovia und LEG treiben die Mieten nach oben - zur Bereicherung der Aktionäre. Während Vermieter Milliarden ausschütten, sitzen die Menschen in maroden Wohnungen. Zu Lasten der Steuerzahler. Von E. Dietrich.[mehr]",
      "content_length": 233,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Olympia-Bewerbung: München startet mit Bürgerentscheid",
      "link": "https://www.tagesschau.de/inland/gesellschaft/olympia-bewerbung-muenchen-entscheid-100.html",
      "published": "2025-10-26T04:29:08",
      "content": "   München möchte sich neben Berlin, Hamburg und der Rhein-Ruhr-Region für die Olympischen und Paralympischen Spiele bewerben. Vorausgesetzt, die Bevölkerung will die Spiele auch haben. Von Sandra Demmelhuber.[mehr]",
      "content_length": 215,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Trump will nach Anti-Zoll-Werbespot Zölle gegen Kanada erhöhen",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-zoelle-kanada-112.html",
      "published": "2025-10-26T01:35:44",
      "content": "   Ein Werbespot bringt weiter Unruhe zwischen den USA und Kanada: Nachdem der US-Präsident deshalb bereits die Handelsgespräche abgebrochen hatte, will er nun die Zölle anheben. Seine Begründung: Der Clip wurde nicht sofort entfernt.[mehr]",
      "content_length": 240,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Zehntausende demonstrieren in Israel für Rückgabe der toten Geiseln",
      "link": "https://www.tagesschau.de/ausland/asien/israel-demo-geiseln-100.html",
      "published": "2025-10-25T23:49:50",
      "content": "   13 tote Geiseln sind noch immer im Gazastreifen. Für ihre Rückgabe haben wieder Zehntausende in Israel demonstriert. Auch US-Präsident Trump erhöht den Druck auf die Hamas, die Geiseln schnell zu übergeben.[mehr]",
      "content_length": 215,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Valencia: Zehntausende demonstrieren ein Jahr nach der Flut",
      "link": "https://www.tagesschau.de/ausland/europa/protest-flut-valencia-100.html",
      "published": "2025-10-25T22:56:56",
      "content": "   Vor fast einem Jahr starben bei der Flut in Valencia mehr als 230 Menschen. Erneut demonstrierten Zehntausende gegen die viel zu späte Warnung der Behörden. Ihre Wut richtet sich vor allem gegen Ministerpräsident Mazón. Von H.-G. Kellner.[mehr]",
      "content_length": 247,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Linksgerichtete Connolly gewinnt Präsidentschaftswahl in Irland",
      "link": "https://www.tagesschau.de/ausland/europa/praesidentschaftswahl-irland-connolly-100.html",
      "published": "2025-10-25T20:08:56",
      "content": "   Mit deutlicher Mehrheit hat die linksgerichtete Kandidatin Connolly die Präsidentschaftswahl in Irland gewonnen. Der Sieg der EU-Kritikerin gilt als Dämpfer für die Mitte-Rechts-Regierung. Überschattet wurde die Wahl von ungültigen Stimmen. [mehr]",
      "content_length": 250,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Israel bestätigt Angriff in Gaza - Palästinenser melden Verletzte",
      "link": "https://www.tagesschau.de/ausland/asien/gaza-angriff-israel-100.html",
      "published": "2025-10-25T19:25:45",
      "content": "   Die Gaza-Waffenruhe bleibt fragil: Nachdem aus palästinensischen Kreisen bereits über Verletzte berichtet worden war, hat Israel einen Angriff in Nuseirat bestätigt. Er habe Dschihadisten gegolten. Mediziner meldeten Verletzte in weiteren Orten.[mehr]",
      "content_length": 254,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Inhaftierte Straßenmusikerin wird in Russland zum Symbol des Widerstands",
      "link": "https://www.tagesschau.de/ausland/europa/russland-strassenmusikerin-verhaftet-100.html",
      "published": "2025-10-25T18:56:37",
      "content": "   Die russische Straßenmusikerin Naoko sitzt in Haft, weil sie in St. Petersburg Lieder von Musikern sang, die als \"ausländische Agenten\" gelten. Ihr Schicksal hat im Land eine Welle der Solidarität ausgelöst. Von Stefanie Markert.[mehr]",
      "content_length": 238,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Grünen-Chefin Brantner wirft Merz Führungsschwäche vor",
      "link": "https://www.tagesschau.de/inland/innenpolitik/brantner-kritik-merz-100.html",
      "published": "2025-10-25T17:58:52",
      "content": "   Grünen-Chefin Brantner wirft den Spitzen von CDU und SPD Führungsschwäche vor - und zieht mit Blick auf Kanzler Merz einen überraschenden Vergleich. Bei Themen wie Wehrdienst oder Ukraine-Hilfen sei er zu zögerlich.[mehr]",
      "content_length": 224,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Schwedens Angst: Wie bezahlen, wenn das Netz ausfällt?",
      "link": "https://www.tagesschau.de/ausland/europa/schweden-geld-gerechtigkeit-sicherheit-100.html",
      "published": "2025-10-25T16:51:47",
      "content": "   In Schweden wird fast alles digital bezahlt. Scheine und Münzen? Fast verschwunden. Das ist bequem, hat aber auch Nachteile - nicht nur, wenn das Netz gestört ist. Von Ann-Brit Bakkenbüll.[mehr]",
      "content_length": 197,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Gebäude- und Autoversicherungen werden deutlich teurer",
      "link": "https://www.tagesschau.de/wirtschaft/verbraucher/kfz-versicherungen-teurer-100.html",
      "published": "2025-10-25T15:40:58",
      "content": "   Um rund sieben Prozent könnten Kfz-Versicherungen im Schnitt im kommenden Jahr teurer werden. Aber auch Wohngebäude-Versicherungen ziehen an. Was Verbraucher außer einem Wechsel noch tun können. Von Klaus-Rainer Jackisch.[mehr]",
      "content_length": 230,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Demos gegen Merz' \"Stadtbild\"-Äußerung in zahlreichen Städten",
      "link": "https://www.tagesschau.de/inland/stadtbild-demo-merz-100.html",
      "published": "2025-10-25T15:21:36",
      "content": "   Auch am Wochenende ist der Protest gegen die \"Stadtbild\"-Äußerung von Kanzler Merz fortgesetzt worden. In zahlreichen Städten gab es kleinere Kundgebungen - in Hamburg demonstrierten mehr als 2.000 Menschen.[mehr]",
      "content_length": 216,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Familienpolitik auf dem Prüfstand - was kommt, was nicht?",
      "link": "https://www.tagesschau.de/inland/innenpolitik/familienpolitik-bundesregierung-eltern-100.html",
      "published": "2025-10-25T14:07:55",
      "content": "   Die Bundesregierung hat sich vorgenommen, Familien in den Mittelpunkt zu stellen. So steht es auch im Koalitionsvertrag. Von Mutterschutz bis Elterngeld: Vieles ist geplant - doch bislang wenig beschlossen. Von Sarah Beham.[mehr]",
      "content_length": 232,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Kühltürme des bayerischen Atomkraftwerks Gundremmingen gesprengt",
      "link": "https://www.tagesschau.de/inland/gesellschaft/gundremmingen-akw-kuehltuerme-100.html",
      "published": "2025-10-25T11:13:56",
      "content": "   Das Atomkraftwerk Gundremmingen produzierte einst ein Viertel des Stroms in Bayern. Knapp vier Jahre nach seiner Stilllegung sind jetzt die beiden Kühltürme planmäßig gesprengt worden. Bald soll dort ein Batteriespeicher entstehen.[mehr]",
      "content_length": 240,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Tracking-Apps: Wenn Eltern ihre Kinder überwachen",
      "link": "https://www.tagesschau.de/inland/gesellschaft/gps-tracker-eltern-kinder-100.html",
      "published": "2025-10-25T10:53:23",
      "content": "   Freunde oder Familie auf Schritt und Tritt verfolgen - das geht mit GPS-Tracking-Apps. Was macht die Funktion besonders bei Eltern so beliebt und welche Risiken gibt es? Von Katharina Spreier.[mehr]",
      "content_length": 201,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "60 Staaten unterzeichnen UN-Abkommen gegen Cyberkriminalität",
      "link": "https://www.tagesschau.de/ausland/asien/cyberkriminalitaet-vereinte-nationen-vietnam-100.html",
      "published": "2025-10-25T10:38:16",
      "content": "   Durch Cyberkriminalität entsteht der Weltwirtschaft nach Schätzungen ein Schaden in Billionenhöhe. Nun haben rund 60 Staaten ein Abkommen zur Bekämpfung von Verbrechen im Netz unterzeichnet. Doch es gibt Kritik.[mehr]",
      "content_length": 220,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Zwei Verdächtige nach Diebstahl im Pariser Louvre festgenommen",
      "link": "https://www.tagesschau.de/ausland/europa/frankreich-louvre-raub-festnahmen-100.html",
      "published": "2025-10-26T11:44:08",
      "content": "   Die französische Polizei hat nach dem Diebstahl historischer Schmuckstücke aus dem Pariser Louvre zwei Verdächtige festgenommen. Einer der beiden Männer sei gestern Abend am Flughafen Charles de Gaulle in Gewahrsam genommen worden.[mehr]",
      "content_length": 240,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Valencia: Zehntausende demonstrieren ein Jahr nach der Flut",
      "link": "https://www.tagesschau.de/ausland/europa/protest-flut-valencia-100.html",
      "published": "2025-10-25T22:56:56",
      "content": "   Vor fast einem Jahr starben bei der Flut in Valencia mehr als 230 Menschen. Erneut demonstrierten Zehntausende gegen die viel zu späte Warnung der Behörden. Ihre Wut richtet sich vor allem gegen Ministerpräsident Mazón. Von H.-G. Kellner.[mehr]",
      "content_length": 247,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Linksgerichtete Connolly gewinnt Präsidentschaftswahl in Irland",
      "link": "https://www.tagesschau.de/ausland/europa/praesidentschaftswahl-irland-connolly-100.html",
      "published": "2025-10-25T20:08:56",
      "content": "   Mit deutlicher Mehrheit hat die linksgerichtete Kandidatin Connolly die Präsidentschaftswahl in Irland gewonnen. Der Sieg der EU-Kritikerin gilt als Dämpfer für die Mitte-Rechts-Regierung. Überschattet wurde die Wahl von ungültigen Stimmen. [mehr]",
      "content_length": 250,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Schwedens Angst: Wie bezahlen, wenn das Netz ausfällt?",
      "link": "https://www.tagesschau.de/ausland/europa/schweden-geld-gerechtigkeit-sicherheit-100.html",
      "published": "2025-10-25T16:51:47",
      "content": "   In Schweden wird fast alles digital bezahlt. Scheine und Münzen? Fast verschwunden. Das ist bequem, hat aber auch Nachteile - nicht nur, wenn das Netz gestört ist. Von Ann-Brit Bakkenbüll.[mehr]",
      "content_length": 197,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Kroatien führt Wehrpflicht wieder ein - Auch Zivildienst möglich",
      "link": "https://www.tagesschau.de/ausland/europa/kroatien-militaer-wehrpflicht-100.html",
      "published": "2025-10-24T16:51:35",
      "content": "   In Deutschland wird heftig über den Wehrdienst diskutiert, Kroatien hat bereits gehandelt und führt die Wehrpflicht wieder ein. Begründet wird dies mit der \"veränderten Sicherheitslage\".[mehr]",
      "content_length": 195,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "EU-Staaten wollen eine Altersgrenze für soziale Netzwerke",
      "link": "https://www.tagesschau.de/ausland/europa/eu-fuer-mindestalter-in-sozialen-netzen-100.html",
      "published": "2025-10-24T08:48:44",
      "content": "   Die EU-Staaten haben sich auf ihrem Gipfel für ein Mindestalter bei der Nutzung sozialer Medien ausgesprochen. Bis aus der Absichtserklärung eine konkrete Altersgrenze wird, kann es noch dauern.[mehr]",
      "content_length": 203,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Wahlkampf-Auftakt in Ungarn: Zehntausende bei Demos in Budapest",
      "link": "https://www.tagesschau.de/ausland/europa/ungarn-proteste-132.html",
      "published": "2025-10-23T17:43:53",
      "content": "   Im Frühjahr wählt Ungarn ein neues Parlament. Mit Großkundgebungen von Regierung und Opposition hat nun der Wahlkampf begonnen. Sie standen im Zeichen gegensätzlicher Positionen zu Russland und zum Krieg gegen die Ukraine. [mehr]",
      "content_length": 232,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Litauen meldet Eindringen von russischen Flugzeugen",
      "link": "https://www.tagesschau.de/ausland/europa/litauen-luftraumverletzung-russland-100.html",
      "published": "2025-10-23T21:55:02",
      "content": "   Wieder eine Luftraumverletzung im Baltikum: Die litauische Armee hat das Eindringen russischer Flugzeuge in ihr Gebiet gemeldet. Als Reaktion stiegen Eurofighter der NATO-Luftraumüberwachung auf. Kanzler Merz sprach von einer weiteren Provokation Russlands.[mehr]",
      "content_length": 266,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Großbritannien und Deutschland wollen \"gemeinsam russische U-Boote jagen\"",
      "link": "https://www.tagesschau.de/ausland/europa/deutschland-grossbritannien-seegebiete-100.html",
      "published": "2025-10-23T17:30:26",
      "content": "   Großbritannien und Deutschland wollen gemeinsam Jagd auf russische U-Boote machen. Die Verteidigungsminister verkündeten eine engere Zusammenarbeit im Nordatlantik. Die Bundeswehr wird sich mit neuen Spezialflugzeugen beteiligen.[mehr]",
      "content_length": 238,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Festnahmen nach Krawallen vor Asylbewerberunterkunft bei Dublin",
      "link": "https://www.tagesschau.de/ausland/europa/irland-auschreitungen-unterkunft-asylbewerber-100.html",
      "published": "2025-10-23T10:13:02",
      "content": "   Die Ausschreitungen in Irland gegen Geflüchtete gehen weiter: Erneut rückte die Polizei mit einem Großaufgebot aus, um eine Unterkunft bei Dublin zu schützen. Demonstranten griffen Beamte mit Feuerwerk an.[mehr]",
      "content_length": 214,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "EU-Staaten beschließen weitere Russland-Sanktionen",
      "link": "https://www.tagesschau.de/ausland/europa/eu-sanktionen-russland-188.html",
      "published": "2025-10-23T08:48:32",
      "content": "   Zum 19. Mal hat die EU ein Sanktionspaket gegen Russland beschlossen und schränkt damit Energieimporte weiter ein. Doch beim Gipfel in Brüssel droht neuer Streit - dabei rücken von der EU eingefrorene russische Vermögen in den Fokus.[mehr]",
      "content_length": 242,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Präsident Milei kann nach Zwischenwahl in Argentinien jubeln",
      "link": "https://www.tagesschau.de/ausland/amerika/argentinien-wahlen-milei-100.html",
      "published": "2025-10-27T07:09:54",
      "content": "   Mit so einem Triumph hatte kein Umfrageinstitut in Argentinien gerechnet: Die Partei des ultraliberalen Präsidenten Milei hat bei den Zwischenwahlen mehr als 40 Prozent geholt. Er sieht den Wendepunkt überschritten. Von Anne Herrberg.[mehr]",
      "content_length": 243,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Venezuela sieht US-Kriegsschiffe vor Trinidad und Tobago als \"Provokation\"",
      "link": "https://www.tagesschau.de/ausland/amerika/venezuela-usa-kriegsschiffe-100.html",
      "published": "2025-10-27T04:00:48",
      "content": "   Die USA haben ein weiteres Kriegsschiff in die Karibik beordert. Diesmal nach Trinidad und Tobago - direkt vor Venezuela. Geplant sei eine Militärübung. Die Regierung in Caracas wirft der USA hingegen vor, einen Krieg zu provozieren.[mehr]",
      "content_length": 242,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Argentinien: Partei von Präsident Milei gewinnt Zwischenwahlen",
      "link": "https://www.tagesschau.de/ausland/amerika/milei-zwischenwahlen-100.html",
      "published": "2025-10-27T02:27:16",
      "content": "   Zuletzt waren seine Zustimmungswerte in Argentinien gesunken, doch nun konnte die Partei von Präsident Milei die Zwischenwahlen für sich gewinnen. Nach Auszählung fast aller Stimmen erzielte sie mehr als 40 Prozent.[mehr]",
      "content_length": 224,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Zwischenwahlen in Argentinien - Stresstest für Milei",
      "link": "https://www.tagesschau.de/ausland/amerika/argentinien-zwischenwahlen-100.html",
      "published": "2025-10-26T11:36:53",
      "content": "   Argentinien wählt Teile des Kongresses neu. Für Präsident Milei eine Art Stresstest, nachdem seine Zustimmungsraten zuletzt gesunken sind. Kann er seinen radikalen Kurs fortsetzen - und nutzt ihm Hilfe von Trump? Von A. Herrberg.[mehr]",
      "content_length": 238,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Trump will nach Anti-Zoll-Werbespot Zölle gegen Kanada erhöhen",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-zoelle-kanada-112.html",
      "published": "2025-10-26T01:35:44",
      "content": "   Ein Werbespot bringt weiter Unruhe zwischen den USA und Kanada: Nachdem der US-Präsident deshalb bereits die Handelsgespräche abgebrochen hatte, will er nun die Zölle anheben. Seine Begründung: Der Clip wurde nicht sofort entfernt.[mehr]",
      "content_length": 240,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "US-Militär vor Südamerika: Mit Flugzeugträgern gegen Drogenboote?",
      "link": "https://www.tagesschau.de/ausland/usa-venezuela-104.html",
      "published": "2025-10-25T08:23:52",
      "content": "   Präsident Trump behauptet, das US-Militär bekämpfe vor Südamerika Drogenschmuggler. Doch die Streitmacht, die er dafür zusammenzieht, lässt anderes vermuten. Plant er den Sturz von Venezuelas Diktator Maduro? Von Carsten Kühntopp.[mehr]",
      "content_length": 239,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Pentagon nimmt wegen des Shutdowns anonyme Millionenspende an",
      "link": "https://www.tagesschau.de/ausland/amerika/usa-millionenspende-haushaltsstreit-shutdown-100.html",
      "published": "2025-10-25T06:36:28",
      "content": "   Wegen der anhaltenden Haushaltssperre in den USA warten auch Soldaten auf ihr Gehalt. Das Pentagon hat nun bestätigt, dafür eine anonyme, private Spende von 130 Millionen Dollar angenommen zu haben.[mehr]",
      "content_length": 207,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Präsident der Elfenbeinküste tritt für vierte Amtszeit an",
      "link": "https://www.tagesschau.de/ausland/wahlen-elfenbeinkueste-100.html",
      "published": "2025-10-25T00:03:55",
      "content": "   Er will es wieder wissen: Der alte Präsident Ouattara will erneut Präsident werden - mit 83 Jahren. Vor allem junge Leute in der Elfenbeinküste fühlen sich nicht vertreten und fordern einen politischen Neustart. Von K. Bensch.[mehr]",
      "content_length": 235,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "USA setzen Kolumbiens Präsidenten Petro auf Sanktionsliste",
      "link": "https://www.tagesschau.de/ausland/amerika/usa-kolumbien-praesident-sanktionen-100.html",
      "published": "2025-10-24T23:44:47",
      "content": "   Das Verhältnis von US-Präsident Trump und Kolumbiens Staatschef Petro ist angespannt. Nun werfen die USA dem Regierungschef vor, zu wenig gegen Drogenkartelle zu tun - und setzen ihn auf die Sanktionsliste.[mehr]",
      "content_length": 215,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Großbritannien drängt auf Nutzung russischen Vermögens für die Ukraine",
      "link": "https://www.tagesschau.de/ausland/europa/starmer-ukraine-vermoegen-russland-100.html",
      "published": "2025-10-24T20:20:03",
      "content": "   Russisches Vermögen für die Ukraine? Großbritannien erhöht in der stockenden Debatte den Druck auf die EU - und sieht einen \"Schritt nach vorne\". Premier Starmer hofft auf eine schnelle Lösung.[mehr]",
      "content_length": 202,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Ministerin Reiche verspricht in der Ukraine Hilfe für Energieversorgung",
      "link": "https://www.tagesschau.de/ausland/europa/reiche-ukraine-102.html",
      "published": "2025-10-24T08:20:12",
      "content": "   Schon jetzt führen russische Angriffe zu massiven Ausfällen bei der Energieversorgung in der Ukraine. Bundeswirtschaftsministerin Reiche sichert zu Beginn ihres Besuchs in Kiew Unterstützung beim Aufbau zerstörter Infrastruktur zu.[mehr]",
      "content_length": 240,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Minimalkompromiss bei Verwendung von russischem Geld",
      "link": "https://www.tagesschau.de/ausland/europa/eu-gipfel-ukraine-128.html",
      "published": "2025-10-23T23:58:30",
      "content": "   Die EU hat eine Entscheidung darüber verschoben, eingefrorenes russisches Staatsvermögen für die Ukraine zu nutzen. Beim Herbstgipfel der Staats- und Regierungschefs wurde zunächst die EU-Kommission damit beauftragt, einen Vorschlag vorzulegen.[mehr]",
      "content_length": 253,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Bekommt die Ukraine bald russisches Vermögen als Darlehen?",
      "link": "https://www.tagesschau.de/ausland/europa/eu-gipfel-sanktionen-russland-104.html",
      "published": "2025-10-23T16:23:51",
      "content": "   Auf dem EU-Gipfel in Brüssel herrscht Zuversicht: Denn die Chancen stehen gut, dass die Staaten eingefrorene Gelder Russlands für die Ukraine freigeben. Doch noch gibt es Bedenken aus Belgien. Von Kathrin Schmid.[mehr]",
      "content_length": 221,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Warum die Ukraine Rüstungsgüter exportieren will",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-exporte-ruestungsgueter-100.html",
      "published": "2025-10-23T07:09:59",
      "content": "   Die Ukraine hat in den vergangenen Jahren Rüstungsgüter entwickelt, mit denen sie sich selbst verteidigt. Bisher darf sie diese Produkte nicht exportieren. Das soll sich nun ändern. Von Florian Kellermann.[mehr]",
      "content_length": 214,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Worüber auf dem EU-Gipfel debattiert wird",
      "link": "https://www.tagesschau.de/ausland/europa/eu-gipfel-themen-104.html",
      "published": "2025-10-23T01:11:59",
      "content": "   Es kann hilfreich sein, wenn Ungarns Ministerpräsident Orban bei einer EU-Abstimmungen vor die Tür geht - 2023 hat das schon einmal funktioniert. Zu Beginn des heutigen EU-Gipfels fehlt Orban wieder. Erleichtert das die Beratungen? Von S. Fritz.[mehr]",
      "content_length": 254,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "EU-Staaten einigen sich auf schärfere Sanktionen gegen Russland",
      "link": "https://www.tagesschau.de/ausland/europa/eu-sanktionen-russland-184.html",
      "published": "2025-10-22T22:27:08",
      "content": "   Die EU-Staaten haben sich auf verschärfte Sanktionen gegen Russland verständigt. Geplant sind etwa ein Importverbot von Flüssigerdgas ab dem Jahr 2027 und Maßnahmen gegen Banken. [mehr]",
      "content_length": 188,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Mindestens sechs Tote durch russische Luftangriffe auf die Ukraine",
      "link": "https://www.tagesschau.de/ausland/ukraine-angriffe-186.html",
      "published": "2025-10-22T13:11:16",
      "content": "   Auch ein Kindergarten wurde getroffen: Mit Drohnen und Raketen hat Russland erneut die Ukraine massiv angegriffen. Besonders im Visier war die Energieinfrastruktur. Sie soll vor dem Winter offenbar lahmgelegt werden.[mehr]",
      "content_length": 225,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Ukraine: Einfrieren der Front als Ausgangspunkt für Verhandlungen?",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-front-einfrieren-100.html",
      "published": "2025-10-21T14:32:10",
      "content": "   Den Frontverlauf in der Ukraine einfrieren und dann verhandeln: Mit diesem Vorstoß will US-Präsident Trump Bewegung in die Gespräche bringen. Zustimmung erhält er aus Europa. Der Kreml hingegen bleibt bei seinen Maximalforderungen.[mehr]",
      "content_length": 240,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Gaza: Israel will selbst über internationale Truppen bestimmen",
      "link": "https://www.tagesschau.de/ausland/asien/gaza-israel-friedenstruppen-suche-nach-geiseln-100.html",
      "published": "2025-10-26T14:57:34",
      "content": "   Zur Sicherung des Gazastreifens wird über den Einsatz von Friedenstruppen diskutiert. Israel will dabei über beteiligte Länder entscheiden. Unterdessen geht die Suche nach den verbliebenen Leichen von Geiseln weiter.[mehr]",
      "content_length": 225,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Zehntausende demonstrieren in Israel für Rückgabe der toten Geiseln",
      "link": "https://www.tagesschau.de/ausland/asien/israel-demo-geiseln-100.html",
      "published": "2025-10-25T23:49:50",
      "content": "   13 tote Geiseln sind noch immer im Gazastreifen. Für ihre Rückgabe haben wieder Zehntausende in Israel demonstriert. Auch US-Präsident Trump erhöht den Druck auf die Hamas, die Geiseln schnell zu übergeben.[mehr]",
      "content_length": 215,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Israel bestätigt Angriff in Gaza - Palästinenser melden Verletzte",
      "link": "https://www.tagesschau.de/ausland/asien/gaza-angriff-israel-100.html",
      "published": "2025-10-25T19:25:45",
      "content": "   Die Gaza-Waffenruhe bleibt fragil: Nachdem aus palästinensischen Kreisen bereits über Verletzte berichtet worden war, hat Israel einen Angriff in Nuseirat bestätigt. Er habe Dschihadisten gegolten. Mediziner meldeten Verletzte in weiteren Orten.[mehr]",
      "content_length": 254,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Mehrere Staaten kritisieren Israels Annexionspläne",
      "link": "https://www.tagesschau.de/ausland/asien/rubio-israel-annexion-westjordanland-100.html",
      "published": "2025-10-23T19:33:41",
      "content": "   Die USA haben Israel vor einer Annexion des Westjordanlands gewarnt. Bereits vor seiner Reise nach Israel übt Außenminister Rubio scharfe Kritik. Auch die internationale Kritik an den israelischen Plänen wächst.[mehr]",
      "content_length": 220,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Foltervorwürfe gegen Israel nach Übergabe von Leichen Gefangener",
      "link": "https://www.tagesschau.de/ausland/asien/palaestinensische-haeftlinge-foltervorwuerfe-100.html",
      "published": "2025-10-22T12:06:03",
      "content": "   Hat Israel Gefangene gefoltert? Nach der Überstellung von 150 palästinensischen Leichen in den Gazastreifen werden schwere Vorwürfe laut. Unabhängig überprüfen lassen sie sich nicht. Von Jan-Christoph Kitzler.[mehr]",
      "content_length": 218,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Datenanalyse: So sehr ist der Gazastreifen zerstört",
      "link": "https://www.tagesschau.de/ausland/asien/gazastreifen-zerstoerung-106.html",
      "published": "2025-10-21T10:22:27",
      "content": "   Wenn die Bewohner des Gazastreifens nun in ihre Heimatorte zurückkehren, finden sie oft nur noch Trümmer vor. Wie sehr die Region zerstört ist, zeigt eine Analyse des ARD-Studios Tel Aviv zusammen mit BR-Datenjournalisten.[mehr]",
      "content_length": 231,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Terrororganisation Hamas übergibt weitere tote Geisel an Israel",
      "link": "https://www.tagesschau.de/ausland/asien/hamas-uebergabe-leiche-israel-100.html",
      "published": "2025-10-21T08:13:19",
      "content": "   Die Hamas hat erneut eine tote Geisel an Israel übergeben - die 13. seit der Einigung auf eine Waffenruhe. Das Abkommen bleibt aber weiter brüchig, erneut fielen Schüsse. Israel ließ unterdessen wieder Hilfslieferungen in den Gazastreifen.[mehr]",
      "content_length": 248,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Israel will Gaza-Waffenruhe wieder einhalten",
      "link": "https://www.tagesschau.de/ausland/asien/israel-gaza-934.html",
      "published": "2025-10-19T19:27:53",
      "content": "   Israel und die Hamas haben sich am Sonntag gegenseitig vorgeworfen, die Waffenruhe gebrochen zu haben. Beide Seiten meldeten Angriffe und Tote. Am Abend teilte Israels Militär dann mit, die Waffenruhe werde wieder eingehalten.[mehr]",
      "content_length": 235,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Israel bestätigt Angriffe auf Gaza nach Vorwürfen gegen Hamas",
      "link": "https://www.tagesschau.de/ausland/asien/israel-gaza-angriff-100.html",
      "published": "2025-10-19T18:08:01",
      "content": "   Israel beschuldigt die Hamas, israelische Soldaten angegriffen zu haben. Das Militär habe daher Stellungen der Hamas im Süden des Gazastreifens angegriffen. Die Terrororganisation weist jede Verantwortung zurück.[mehr]",
      "content_length": 221,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Chinas Armee simuliert offenbar Angriff auf Taiwan",
      "link": "https://www.tagesschau.de/ausland/asien/china-taiwan-angriffsmanoever-100.html",
      "published": "2025-10-27T06:50:25",
      "content": "   Simulierte Gefechte wenige Tage vor dem Trump-Xi-Treffen: Aufnahmen in chinesischen Staatsmedien sollen zeigen, wie Soldaten einen Angriff auf Taiwan proben. Taipeh spricht von \"Einschüchterung\".[mehr]",
      "content_length": 204,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Trump reist nach Japan: Beim Handel könnte es knirschen",
      "link": "https://www.tagesschau.de/ausland/asien/trump-japan-reise-100.html",
      "published": "2025-10-27T04:28:06",
      "content": "   Der US-Präsident setzt seine Asien-Reise fort. Nächster Halt: Japan. Die neue Regierungschefin Takaichi und Trump haben politisch viel gemeinsam - beim Thema Wirtschaft könnte es aber Probleme geben. Von Anna-Lou Beckmann.[mehr]",
      "content_length": 231,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Pakistan meldet Verletzung der Waffenruhe an Grenze zu Afghanistan",
      "link": "https://www.tagesschau.de/ausland/asien/pakistan-afghanistan-kaempfe-104.html",
      "published": "2025-10-26T17:36:23",
      "content": "   Erst vor einer Woche hatten sich Pakistan und Afghanistan auf eine Waffenruhe verständigt. Während sie in Istanbul Gespräche über einen dauerhaften Frieden führen, hat es nun offenbar erneut Kämpfe mit Toten gegeben.[mehr]",
      "content_length": 225,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Vorläufige Einigung im Zollstreit zwischen USA und China",
      "link": "https://www.tagesschau.de/ausland/asien/usa-china-annaeherung-zollstreit-100.html",
      "published": "2025-10-26T15:48:25",
      "content": "   Können US-Präsident Trump und sein chinesischer Amtskollege Xi den Zollstreit beilegen? Kurz vor einem geplanten Treffen der beiden Staatschefs sind beide Seiten zumindest zu einer vorläufigen Einigung gelangt.[mehr]",
      "content_length": 219,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Thailand und Kambodscha besiegeln nach Grenzstreit Waffenstillstand",
      "link": "https://www.tagesschau.de/ausland/asien/thailand-kambodscha-116.html",
      "published": "2025-10-26T07:56:51",
      "content": "   Im Juli war ein Grenzkonflikt zwischen Thailand und Kambodscha eskaliert, fünf Tage lang gab es Kämpfe. Auf dem ASEAN-Gipfel haben sie nun ein Waffenstillstandsabkommen unterzeichnet. Der US-Präsident reklamiert den Deal für sich.[mehr]",
      "content_length": 239,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Trump nimmt zum Auftakt seiner Asien-Reise an ASEAN-Gipfel teil",
      "link": "https://www.tagesschau.de/ausland/asien/trump-asean-gipfel-100.html",
      "published": "2025-10-26T12:06:21",
      "content": "   US-Präsident Trump hat seine Asienreise begonnen. Zunächst nahm er auf dem ASEAN-Gipfel in Malaysia an der Unterzeichnung des Friedensabkommens zwischen Thailand und Kambodscha teil. In Südkorea will er Chinas Staatschef Xi treffen.[mehr]",
      "content_length": 241,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "ASEAN-Gipfel: Wie umgehen mit der \"Sandwich-Position\"?",
      "link": "https://www.tagesschau.de/ausland/asien/asean-gipfel-malaysia-trump-100.html",
      "published": "2025-10-25T05:51:43",
      "content": "   In Südostasien wachsen die Spannungen zwischen China und den USA. Das strahlt auch auf den ASEAN-Gipfel in Malaysia aus - zu dem US-Präsident Trump anreist. Wie positioniert sich der Staatenbund? Von A. Henkel.[mehr]",
      "content_length": 219,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Thailands einstige Königin Sirikit im Alter von 93 Jahren gestorben",
      "link": "https://www.tagesschau.de/ausland/asien/thailand-sirikit-100.html",
      "published": "2025-10-25T09:52:49",
      "content": "   Sie war ein Star des internationalen Adels und zierte weltweit die Titelblätter von Modemagazinen: Nun ist Thailands ehemalige Königin Sirikit im Alter von 93 Jahren gestorben. Der Königshof hat eine einjährige Trauerzeit ausgerufen.[mehr]",
      "content_length": 242,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Verlorene Posten: Machtkämpfe in Chinas Führung?",
      "link": "https://www.tagesschau.de/ausland/asien/china-umbesetzungen-partei-armee-100.html",
      "published": "2025-10-25T00:02:59",
      "content": "   Amtsinhaber verschwinden plötzlich, Positionen werden leise neu besetzt: Chinas kommunistische Führungsriege kann sich unter Staatschef Xi nicht sicher fühlen. Steckt tatsächlich nur Korruptionsbekämpfung dahinter? Von Jörg Endriss.[mehr]",
      "content_length": 241,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Medienbehörde: Äthiopien suspendiert Deutsche-Welle-Journalisten",
      "link": "https://www.tagesschau.de/ausland/afrika/aethiopien-deutsche-welle-korrespondenten-100.html",
      "published": "2025-10-24T17:37:10",
      "content": "   Die Deutsche Welle darf vorerst nicht mehr direkt aus Äthiopien berichten. Die Regierung hat angeordnet, dass neun Korrespondenten und Korrespondentinnen ihre Arbeit einstellen müssen. Der Sender protestiert gegen diesen Schritt.[mehr]",
      "content_length": 238,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "UN fordern sofortige Maßnahmen gegen humanitäre Krise im Sudan",
      "link": "https://www.tagesschau.de/ausland/afrika/humanitaerekrise-sudan-un-100.html",
      "published": "2025-10-23T12:53:47",
      "content": "   Oft ist die Rede von einem \"vergessenen Konflikt\" - dabei erleidet der Sudan die schwerste humanitäre Krise unserer Zeit. Mehr als 30 Millionen Menschen sind auf Hilfe angewiesen. Die UN fordern ein schnelles Handeln.[mehr]",
      "content_length": 226,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Flüchtlingsboot vor Küste Tunesiens gekentert - mindestens 40 Tote",
      "link": "https://www.tagesschau.de/ausland/afrika/bootsunglueck-tunesien-104.html",
      "published": "2025-10-22T18:42:55",
      "content": "   Vor der Küste Tunesiens ist ein Boot gekentert. Mindestens 40 Menschen sind dabei ertrunken, unter ihnen auch Kleinkinder. Es ist eine der schwersten Schiffskatastrophen in der Region in diesem Jahr.[mehr]",
      "content_length": 208,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Oberst nach Militärputsch als Präsident von Madagaskar vereidigt",
      "link": "https://www.tagesschau.de/ausland/afrika/madagaskar-militaerputsch-vereidigung-100.html",
      "published": "2025-10-17T13:09:32",
      "content": "   Die Armee in Madagaskar verkündete vor wenigen Tagen ihre Machtübernahme, der langjährige Präsident floh. Sein Amt übernimmt nun ein Oberst. Schnelle Neuwahlen, die das Verfassungsgericht fordert, lehnt er ab.[mehr]",
      "content_length": 218,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Kenia: Langjähriger Oppositionsführer Odinga gestorben",
      "link": "https://www.tagesschau.de/ausland/afrika/kenia-odinga-100.html",
      "published": "2025-10-15T11:52:58",
      "content": "   Er war viele Jahre das Gesicht der politischen Opposition in Kenia. Fünfmal kandidierte er vergeblich für das Präsidentenamt. Nun ist Raila Odinga im Alter von 80 Jahren gestorben. Von Karin Bensch.[mehr]",
      "content_length": 207,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Madagaskars Präsident Rajoelina \"an sicheren Ort\" geflüchtet",
      "link": "https://www.tagesschau.de/ausland/afrika/madagaskar-rajoelina-flucht-100.html",
      "published": "2025-10-14T01:06:11",
      "content": "   Wegen der massiven Proteste in seinem Land ist Madagaskars Präsident Rajoelina an einen \"sicheren Ort\" geflüchtet. Berichten zufolge ist er im Ausland. In einer Rede appelliert er an die Menschen in seinem Land.[mehr]",
      "content_length": 220,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Vermittlerstaaten unterzeichnen Vereinbarung zu Gaza",
      "link": "https://www.tagesschau.de/ausland/afrika/nahost-israel-hamas-aegypten-100.html",
      "published": "2025-10-13T19:35:32",
      "content": "   20 Geiseln sind zurück in Israel, fast 2.000 Palästinenser aus der Haft entlassen. Nun ist die Waffenruhe in Gaza auch formell besiegelt: Die Vermittlerstaaten unterzeichneten die Vereinbarung. Doch wichtige Punkte sind weiter offen.[mehr]",
      "content_length": 242,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Madagaskars Präsident offenbar ausgeflogen",
      "link": "https://www.tagesschau.de/ausland/afrika/praesident-rajoelina-verlaesst-madagaskar-100.html",
      "published": "2025-10-13T14:34:47",
      "content": "   Seit Wochen gehen vor allem junge Menschen in Madagaskar auf die Straße, um gegen die politische Führung zu protestieren. Jetzt hat Präsident Rajoelina das Land offenbar verlassen. Von Stephan Ueberbach.[mehr]",
      "content_length": 212,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Madagaskar: Präsident spricht von \"illegaler Machtübernahme\"",
      "link": "https://www.tagesschau.de/ausland/afrika/madagaskar-proteste-106.html",
      "published": "2025-10-12T13:38:47",
      "content": "   Seit rund zwei Wochen demonstrieren vor allem junge Menschen in Madagaskar gegen die Regierung. Gestern hatten sich Soldaten dem Protest angeschlossen. Präsident Rajoelina spricht von einem Versuch der \"illegalen Machtübernahme\".[mehr]",
      "content_length": 238,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Neuer Nationalpark in Australien soll Koalas schützen",
      "link": "https://www.tagesschau.de/ausland/ozeanien/koala-nationalpark-australien-100.html",
      "published": "2025-09-08T13:31:56",
      "content": "   Koalas sind vom Aussterben bedroht. Ein riesiger neuer Nationalpark in ihrer Heimat Australien soll nun Tausenden der Tiere Lebensraum und Schutz bieten. Der WWF spricht von einer echten Chance.[mehr]",
      "content_length": 203,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Australien macht den Iran für antisemitische Anschläge verantwortlich",
      "link": "https://www.tagesschau.de/ausland/ozeanien/australien-iran-ausweisung-botschafter-100.html",
      "published": "2025-08-26T06:07:33",
      "content": "   Australien weist den Botschafter des Iran aus - ein lange nicht da gewesener diplomatischer Schritt. Hintergrund sind antisemitische Anschläge in Australien. Laut Regierung ist erwiesen, dass Irans Führung den Auftrag dazu gegeben hat.[mehr]",
      "content_length": 244,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Korallenbleiche im Great Barrier Reef erreicht Rekordausmaß",
      "link": "https://www.tagesschau.de/ausland/ozeanien/australien-great-barrier-reef-korallenbleiche-100.html",
      "published": "2025-08-07T12:43:32",
      "content": "   Das 2.300 Kilometer lange Great Barrier Reef vor der Küste Australiens gehört zum UNESCO-Weltnaturerbe. Doch der Klimawandel setzt ihm immer mehr zu. Wissenschaftler blicken mit Sorge in die Zukunft. Von Udo Schmidt. [mehr]",
      "content_length": 226,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Australien will auch YouTube für Kinder unter 16 Jahren beschränken",
      "link": "https://www.tagesschau.de/ausland/ozeanien/australien-youtube-verbot-100.html",
      "published": "2025-07-30T11:17:25",
      "content": "   Erst Insta, TikTok &amp; Co - und jetzt auch YouTube. Australien will die Nutzung der Videoplattform für Minderjährige einschränken. Wer unter 16 Jahren ist, soll sich kein Konto mehr anlegen dürfen.[mehr]",
      "content_length": 208,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Giftige Algenblüte tötet massenhaft Meerestiere vor Südaustralien",
      "link": "https://www.tagesschau.de/ausland/ozeanien/algenbluete-suedaustralien-naturkatastrophe-100.html",
      "published": "2025-07-23T11:11:17",
      "content": "   An der Südküste Australiens kommt es derzeit zu einem massenhaften Sterben von Meerestieren. Grund ist eine Alge, die sich dort stark ausbreitet. Es herrscht Verzweiflung und Fassungslosigkeit. Von Udo Schmidt.[mehr]",
      "content_length": 219,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Anträge auf Klima-Asyl in Australien: Tausende wollen weg aus Tuvalu",
      "link": "https://www.tagesschau.de/ausland/ozeanien/tuvalu-australien-klimawandel-100.html",
      "published": "2025-07-21T12:28:47",
      "content": "   Malerisch liegt Tuvalu im Pazifik, doch der Inselstaat droht unterzugehen. Australien hat angeboten, die Bevölkerung aufzunehmen - Tausende haben sich beworben. Thorsten Iffland und Anna-Lou Beckmann über die Sorge der Inselbewohner.[mehr]",
      "content_length": 242,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Klimawandel: Warum Bewohner von Tuvalu nach Australien ziehen",
      "link": "https://www.tagesschau.de/ausland/ozeanien/tuvalu-bewohner-klimawandel-100.html",
      "published": "2025-07-21T09:42:52",
      "content": "   Etwa 10.000 Menschen leben in Tuvalu. Doch der Inselstaat im Südpazifik droht wegen des steigenden Meeresspiegels unterzugehen. Die Hälfte der Bevölkerung hat bereits ein Klimavisum beantragt - in Australien. [mehr]",
      "content_length": 218,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Berichterstattung weltweit: Die Korrespondentinnen und Korrespondenten der ARD",
      "link": "https://www.tagesschau.de/korrespondenten",
      "published": "2024-09-09T11:44:16",
      "content": "   Die rund 100 Auslands-Korrespondentinnen und Korrespondenten sind das Rückgrat der ARD-Nachrichtensendungen. Sie berichten aus 28 Studios weltweit - im Fernsehen, im Hörfunk und Online.[mehr]",
      "content_length": 194,
      "source": "Tagesschau Ausland",
      "category": "German News"
    },
    {
      "title": "Kurz vor Treffen Trumps mit Xi - China simuliert Angriff auf Taiwan",
      "link": "https://www.deutschlandfunk.de/china-simuliert-angriff-auf-taiwan-100.html",
      "published": "2025-10-27T07:10:26",
      "content": "China hat mit einem Militärmanöver nahe Taiwan einen Angriff auf die Insel simuliert. Laut staatlichen chinesischen Medien übten Einheiten des Militärs Luftblockaden und Präzisionsangriffe. Die Aktion wurde nur wenige Tage vor einem geplanten Treffen des chinesischen Präsidenten Xi Jinping und US-Präsident Trump in Südkorea bekannt gegeben.",
      "content_length": 342,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Verschobene China-Reise - Grünen-Politikerin Brugger: \"Gut, dass Außenminister Wadephul sich nicht vorführen lässt\"",
      "link": "https://www.deutschlandfunk.de/gruenen-politikerin-brugger-gut-dass-aussenminister-wadephul-sich-nicht-vorfuehren-laesst-100.html",
      "published": "2025-10-27T07:10:26",
      "content": "Die stellvertretende Fraktionschefin der Grünen im Bundestag, Brugger, hat die Verschiebung der China-Reise von Außenminister Wadephul begrüßt. Brugger sagte im Deutschlandfunk, es sei richtig, dass sich der Außenminister nicht von China vorführen lasse.",
      "content_length": 254,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Argentinien - Präsident Milei kündigt nach Wahlerfolg Intensivierung seiner Wirtschaftspolitik an",
      "link": "https://www.deutschlandfunk.de/praesident-milei-kuendigt-nach-wahlerfolg-intensivierung-seiner-wirtschaftspolitik-an-100.html",
      "published": "2025-10-27T07:10:26",
      "content": "Der argentinische Präsident Milei hat nach dem Sieg seiner Partei bei Zwischenwahlen eine Intensivierung seines wirtschaftspolitischen Kurses angekündigt. Milei sagte in Buenos Aires, die Argentinier hätten gezeigt, dass sie nicht zum Modell des Scheiterns zurückkehren wollten. Er rief die Gouverneure der Provinzen zur Zusammenarbeit auf.",
      "content_length": 340,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Umstrittene Merz-Äußerung - SPD-Abgeordnete fordern Stadtbild-Gipfel - und machen Verbesserungsvorschläge",
      "link": "https://www.deutschlandfunk.de/spd-abgeordnete-fordern-stadtbild-gipfel-und-machen-verbesserungsvorschlaege-102.html",
      "published": "2025-10-27T07:10:26",
      "content": "Mehrere Bundestagsabgeordnete der SPD haben Vorschläge zur Verbesserung des Stadtbilds vorgelegt. In einem Acht-Punkte-Plan, über den die \"Bild\"-Zeitung berichtet, fordern sie Maßnahmen wie bessere Beleuchtung, intensive Sozialarbeit, mehr Drogenkonsumräume sowie eine Überwindung von Obdachlosigkeit bis 2030.",
      "content_length": 310,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Olympische Spiele - DOSB-Vorstandschef Fricke: Positives Votum ist noch kein Vorentscheid für München",
      "link": "https://www.deutschlandfunk.de/dosb-vorstandschef-fricke-positives-votum-ist-noch-kein-vorentscheid-fuer-muenchen-102.html",
      "published": "2025-10-27T07:10:26",
      "content": "Der Vorstandsvorsitzende des Deutschen Olympischen Sportbundes, Fricke, hat den Bürgerentscheid für eine Olympia-Bewerbung der Stadt München begrüßt. Erstmals weltweit habe eine Bevölkerung in dieser Form ihre Unterstützung für Olympische Sommerspiele zum Ausdruck gebracht.",
      "content_length": 274,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Ukraine-Krieg - Ukraine fliegt wieder Gegenangriffe auf russisches Gebiet",
      "link": "https://www.deutschlandfunk.de/ukraine-fliegt-wieder-gegenangriffe-auf-russisches-gebiet-100.html",
      "published": "2025-10-27T07:10:26",
      "content": "Die ukrainische Armee hat in der Nacht wieder Ziele in Russland aus der Luft angegriffen.",
      "content_length": 89,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Sudan - Hunderttausende Zivilisten in Stadt Al-Faschir eingeschlossen - Gewalt und Hunger ausgesetzt",
      "link": "https://www.deutschlandfunk.de/hunderttausende-zivilisten-in-stadt-al-faschir-eingeschlossen-gewalt-und-hunger-ausgesetzt-100.html",
      "published": "2025-10-27T07:10:26",
      "content": "In der sudanesischen Stadt Al-Faschir sind nach UNO-Angaben hunderttausende Zivilisten eingeschlossen.",
      "content_length": 102,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "US-Armee - Amerikanischer Kampfjet und Helikopter stürzen im Südchinesischen Meer ab",
      "link": "https://www.deutschlandfunk.de/amerikanischer-kampfjet-und-helikopter-stuerzen-im-suedchinesischen-meer-ab-100.html",
      "published": "2025-10-27T07:10:26",
      "content": "Im Südchinesischen Meer sind ein Kampfflugzeug und ein Hubschrauber der US-Armee abgestürzt.",
      "content_length": 92,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "\"Bahnhof des Jahres\" - Jury zeichnet Hauptbahnhof von Magdeburg aus und lobt Sanierung",
      "link": "https://www.deutschlandfunk.de/jury-zeichnet-hauptbahnhof-von-magdeburg-aus-und-lobt-sanierung-100.html",
      "published": "2025-10-27T07:10:26",
      "content": "Der Magdeburger Hauptbahnhof ist zum \"Bahnhof des Jahres 2025\" gewählt worden.",
      "content_length": 78,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "ZDF-Interview - Chrupalla nennt Spionage-Vorwürfe gegen AfD \"bodenlose Frechheit\"",
      "link": "https://www.deutschlandfunk.de/chrupalla-nennt-spionage-vorwuerfe-gegen-afd-bodenlose-frechheit-108.html",
      "published": "2025-10-27T07:10:26",
      "content": "Der AfD-Vorsitzende Chrupalla hat die Spionage-Vorwürfe gegen seine Partei als \"bodenlose Frechheit\" bezeichnet.",
      "content_length": 112,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Jerusalem - Prien in Israel eingetroffen",
      "link": "https://www.deutschlandfunk.de/prien-in-israel-eingetroffen-100.html",
      "published": "2025-10-27T07:10:26",
      "content": "Bundesbildungsministerin Prien beginnt heute offiziell ihre Israel-Reise.",
      "content_length": 73,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Berlin - Festakt zum 75-jährigen Bestehen des Verfassungsschutzes",
      "link": "https://www.deutschlandfunk.de/festakt-zum-75-jaehrigen-bestehen-des-verfassungsschutzes-100.html",
      "published": "2025-10-27T07:10:26",
      "content": "In Berlin begeht das Bundesamt für Verfassungsschutz den 75. Jahrestag seiner Gründung.",
      "content_length": 87,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Niederlande - Zehntausende bei Klimaprotest vor Parlamentswahl",
      "link": "https://www.deutschlandfunk.de/zehntausende-bei-klimaprotest-vor-parlamentswahl-102.html",
      "published": "2025-10-27T07:10:26",
      "content": "Wenige Tage vor der vorgezogenen Parlamentswahl in den Niederlanden haben in Den Haag zehntausende Menschen für Klimaschutz demonstriert.",
      "content_length": 137,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Elfenbeinküste - Amtsinhaber Ouattara siegt offenbar bei Präsidentenwahl",
      "link": "https://www.deutschlandfunk.de/amtsinhaber-ouattara-siegt-offenbar-bei-praesidentenwahl-106.html",
      "published": "2025-10-27T07:10:26",
      "content": "Der Präsident der Republik Elfenbeinküste, Ouattara, steht vor seiner vierten Amtszeit.",
      "content_length": 87,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Ramallah - Palästinenser-Präsident Abbas legt Nachfolgeregelung fest",
      "link": "https://www.deutschlandfunk.de/palaestinenser-praesident-abbas-legt-nachfolgeregelung-fest-108.html",
      "published": "2025-10-27T07:10:26",
      "content": "Palästinenser-Präsident Abbas hat in einem Erlass festgelegt, wer ihm nachfolgt, sollte er amtsunfähig werden.",
      "content_length": 110,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Fahndungserfolg - Spanische Ermittler stellen 6,5 Tonnen Kokain auf Hochseefrachter sicher",
      "link": "https://www.deutschlandfunk.de/spanische-ermittler-stellen-6-5-tonnen-kokain-auf-hochseefrachter-sicher-104.html",
      "published": "2025-10-27T07:10:26",
      "content": "Vor der Küste der kanarischen Inseln hat die spanische Polizei auf einem Frachtschiff 6,5 Tonnen Kokain beschlagnahmt.",
      "content_length": 118,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Wissenschaft - Weltweit gibt es noch mindestens 196 unkontaktierte Völker",
      "link": "https://www.deutschlandfunk.de/weltweit-gibt-es-noch-mindestens-196-unkontaktierte-voelker-100.html",
      "published": "2025-10-27T07:10:26",
      "content": "Weltweit gibt es mindestens 196 Völker, die noch nie Kontakt zu Außenstehenden hatten.",
      "content_length": 86,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Bundesamt für Seeschifffahrt und Hydrographie - Erneut Sturmflut an Nordsee-Küste und im Hamburger Elbegebiet",
      "link": "https://www.deutschlandfunk.de/erneut-sturmflut-an-nordsee-kueste-und-im-hamburger-elbegebiet-104.html",
      "published": "2025-10-27T07:10:26",
      "content": "Die deutsche Nordsee-Küste und das Hamburger Elbegebiet sind von einer weiteren Sturmflut getroffen worden.",
      "content_length": 107,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "USA, Kanada und Mexiko - Bewerbung um Tickets für Fußball-WM 2026 beginnt",
      "link": "https://www.deutschlandfunk.de/bewerbung-um-tickets-fuer-fussball-wm-2026-beginnt-102.html",
      "published": "2025-10-27T07:10:26",
      "content": "Für Fußball-Fans startet heute die zweite Anmeldephase für Tickets zur Fußball-WM im kommenden Jahr. Interessierte haben zunächst bis Ende Oktober Zeit, sich auf der FIFA-Homepage für den Verkauf zu registrieren.",
      "content_length": 212,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Fußball-Bundesliga - Siege für Stuttgart und Leverkusen",
      "link": "https://www.deutschlandfunk.de/siege-fuer-stuttgart-und-leverkusen-110.html",
      "published": "2025-10-27T07:10:26",
      "content": "In der Fußball-Bundesliga hat der VfB Stuttgart die Gäste vom 1. FSV Mainz 05 mit 2:1 besiegt. Das Spiel wurde von einem medizinischen Notfall im Gästeblock überschattet. Beide Fan-Lager stellten für mehr als 20 Minuten ihre Unterstützung ein.",
      "content_length": 243,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Rückkehr an die Gesamtspitze - Brite Lando Norris gewinnt Formel-Eins-Rennen in Mexiko",
      "link": "https://www.deutschlandfunk.de/brite-lando-norris-gewinnt-formel-eins-rennen-in-mexiko-106.html",
      "published": "2025-10-27T07:10:26",
      "content": "Der britische Formel-Eins-Fahrer Lando Norris hat den Großen Preis von Mexiko gewonnen.",
      "content_length": 87,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Wetter - Regnerisch, 7 bis 13 Grad",
      "link": "https://www.deutschlandfunk.de/regnerisch-7-bis-13-grad-126.html",
      "published": "2025-10-27T07:10:26",
      "content": "Das Wetter: Verbreitet Niederschläge, teils auch Wolkenauflockerungen. Höchstwerte 7 bis 13 Grad. Am morgigen Dienstag im Norden stark bewölkt und von Westen nach Osten durchziehender Regen. Im Süden Auflockerungen und geringere Regenneigung. 9 bis 15 Grad.",
      "content_length": 257,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Turkey likely to be excluded from Gaza stabilisation force after Israeli objection",
      "link": "https://www.theguardian.com/world/2025/oct/25/turkey-gaza-stabilisation-force-israeli-objection",
      "published": "2025-10-25T04:00:24",
      "content": "Doubts over whether Ankara will be part of 5,000-strong force to be deployed to prevent postwar power vacuumTurkey will probably be excluded from the 5,000-strong stabilisation force that is to be set up inside Gaza after Israel made clear it did not want Turkish troops taking part.Marco Rubio, the US secretary of state, said it was a requirement that Israel is comfortable with the nationality of the multinational force, set up to prevent a security vacuum when the massive task of reconstruction in Gaza starts. Turkey has said it is willing to offer troops, but Israel has let it be known that it disapproves of Turkish troops taking part in the force. Continue reading...",
      "content_length": 678,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Two dead and dozens arrested amid Cameroon election crackdown",
      "link": "https://www.theguardian.com/world/2025/oct/24/deaths-arrests-amid-cameroon-election-crackdown",
      "published": "2025-10-24T09:00:54",
      "content": "Wave of unrest as polling suggests victory in presidential race for 92-year-old incumbent Paul BiyaAt least two people have been killed and dozens of protesters arrested in Cameroon as the government cracks down on dissent before the announcement of final results in this month’s presidential elections.Local media reports, citing preliminary data from the electoral commission (Elecam), suggest that victory for the 92-year-old incumbent, Paul Biya, is all but certain. That prospect has provoked anger and disbelief among his opponents, leading to unrest across several regions. Continue reading...",
      "content_length": 600,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "UK’s biggest weapons firm BAE grounds ‘lifeline’ aircraft delivering food aid",
      "link": "https://www.theguardian.com/global-development/2025/oct/24/bae-ends-support-atp-aircraft-caa-airworthiness-aid-deliveries-south-sudan-somalia-drc",
      "published": "2025-10-24T07:00:36",
      "content": "Exclusive: In the year they announced record profits, Britain’s arms maker has revoked licence to fly for planes taking supplies of food to starving people in South Sudan, Somalia and DRCBritain’s biggest weapons manufacturer, BAE Systems, has quietly scrapped support for a fleet of aircraft providing “life-saving” humanitarian aid to some of the world’s poorest countries.The decision further reduces the distribution of vital aid to countries facing serious humanitarian crises, including South Sudan, Somalia and the Democratic Republic of Congo (DRC). Continue reading...",
      "content_length": 577,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Cuban man deported from US to Eswatini goes on hunger strike in prison",
      "link": "https://www.theguardian.com/world/2025/oct/22/cuban-man-roberto-mosquera-del-peral-deported-from-us-to-eswatini-on-hunger-strike-in-prison",
      "published": "2025-10-22T11:46:30",
      "content": "Roberto Mosquera del Peral was sent to African country as part of Trump administration’s immigration crackdownA Cuban man deported by the Trump administration to the southern African country of Eswatini has started a hunger strike against his detention there, his lawyer said on Wednesday.Roberto Mosquera del Peral was among five third-country nationals deported from the US to Eswatini, formerly Swaziland, in July. Continue reading...",
      "content_length": 437,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Anti-malaria funding cuts could lead to ‘deadliest resurgence ever’, study warns",
      "link": "https://www.theguardian.com/global-development/2025/oct/21/global-health-infectious-disease-aid-cuts-malaria-funding-cost-deaths-gdp-africa",
      "published": "2025-10-20T23:01:26",
      "content": "Expected reduction in contributions by wealthy countries likely to cost millions of lives and billions in lost growthSlashed contributions from wealthy countries to an anti-malaria fund could allow a resurgence of the disease, costing millions of lives and billions of pounds by the end of the decade, according to a new analysis.The fight against malaria faces new threats, including extreme weather and humanitarian crises increasing the number of people exposed, and growing biological resistance to insecticides and drugs, the report warns. Continue reading...",
      "content_length": 564,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Hurricane Melissa strengthens to category 4 as evacuations ordered in Jamaica’s capital",
      "link": "https://www.theguardian.com/world/2025/oct/26/hurricane-melissa-strengthens-into-category-4-approaches-jamaica",
      "published": "2025-10-27T06:03:06",
      "content": "Storm could intensify further, threatening to cause catastrophic flooding in northern CaribbeanHurricane Melissa strengthened into a powerful category 4 hurricane on Sunday, threatening days of catastrophic winds and rain in the northern Caribbean, while Jamaica’s government ordered mandatory evacuations for vulnerable areas across the country including in the capital, Kingston.Jamaican officials had earlier urged those in low-lying and flood-prone areas to seek refuge as Melissa rapidly climbs up the Saffir-Simpson hurricane wind scale with the possibility of intensifying to a category 5 storm on Monday. Continue reading...",
      "content_length": 632,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Javier Milei hails ‘tipping point’ as his far-right party wins Argentina’s midterm elections",
      "link": "https://www.theguardian.com/world/2025/oct/27/javier-milei-president-far-right-party-wins-argentina-midterm-elections",
      "published": "2025-10-27T04:35:54",
      "content": "The result falls short of giving Milei a congressional majority but has been widely described as surprising by Argentinian analystsThe party of Argentina’s far-right president, Javier Milei, has won Sunday’s midterm elections after a campaign in which US president Donald Trump announced a $40bn bailout for the country and made continued aid conditional on the victory of his Argentinian counterpart.With more than 95% of ballots counted, Milei’s party, La Libertad Avanza, won 40.84% of the nationwide vote in an election widely seen as a de facto referendum on the self-styled anarcho-capitalist’s nearly two years in power. Continue reading...",
      "content_length": 647,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Do populists always crash the economy?",
      "link": "https://www.theguardian.com/news/ng-interactive/2025/oct/26/do-populists-always-crash-the-economy",
      "published": "2025-10-26T06:00:56",
      "content": "Argentina is counting the cost of its turn to Javier Milei. Politicians from Donald Trump to Giorgia Meloni and Nigel Farage will be closely watching what happens next“Cambio, cambio.” Under the blazing sun, dozens of money changers are hawking US dollars along Florida Street, a bustling pedestrian strip in Buenos Aires. Known as arbolitos (“little trees”), they are thriving ahead of the 26 October midterm elections in a country long used to saving in the greenback.“The best time to buy is now,” says one arbolito, declining to give her name. “[The dollar] went down a little but it is a fake-out – it’ll rise again.” Continue reading...",
      "content_length": 642,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Trump raises tariffs on Canada by 10% in retaliation for anti-tariff TV ad",
      "link": "https://www.theguardian.com/us-news/2025/oct/25/trump-tariffs-canada-ronald-reagan",
      "published": "2025-10-25T21:48:46",
      "content": "Move is response to ad sponsored by Ontario that referenced Ronald Reagan’s support for free tradeDonald Trump announced on Saturday that he will raise US tariffs on Canada by 10% in retaliation for an anti-tariff advertisement sponsored by the Ontario government, which has further strained one of the world’s largest trade partnerships.The statement, posted on the US president’s Truth Social account, came after several days of public disputes over the ad, which referenced Ronald Reagan’s support for free trade and provoked the US president’s anger. Continue reading...",
      "content_length": 574,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Argentina goes to polls amid economic crisis and Trump ‘interference’",
      "link": "https://www.theguardian.com/world/2025/oct/25/argentina-president-javier-milei-polls-economic-crisis-trump",
      "published": "2025-10-25T11:00:32",
      "content": "Poor showing in Sunday’s election would deal hammer blow to country’s radical libertarian president, Javier MileiArgentina’s radical libertarian leader, Javier Milei, is facing a pivotal moment in his presidency with voters set to deliver their verdict on his two-year-old administration on Sunday against a backdrop of political and economic crisis and accusations that his ally Donald Trump is meddling in the country’s affairs.A poor showing in Sunday’s midterm election would be a hammer blow to Milei, who took power in December 2023 pledging to kickstart “a new era of peace and prosperity” by slashing spending and inflation. Continue reading...",
      "content_length": 652,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Bear attack survival tips released in Japan as encounters surge",
      "link": "https://www.theguardian.com/world/2025/oct/27/bear-attack-survival-tips-released-in-japan-as-encounters-surge",
      "published": "2025-10-27T04:55:05",
      "content": "Governor of one prefecture says he is considering asking the military for help to tackle increasing attacks amid thousands-strong bear populationKnowing what to do in the event of a close encounter with a bear was once a concern only for hikers and foragers in Japan. Now, however, people in populated areas are being urged to learn how to protect themselves following a spate of attacks, as the animals leave their natural habitats in search of food.Bear encounters are generating almost daily headlines. In the past week in Akita prefecture, the animals attacked a jogger and a walker in built-up areas, while another terrorised four people before holing up inside a nearby house. None of the victims was seriously injured. Continue reading...",
      "content_length": 745,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "US and China agree ‘framework’ for trade deal ahead of Xi-Trump meeting",
      "link": "https://www.theguardian.com/us-news/2025/oct/27/us-china-framework-trade-deal-xi-trump-meeting",
      "published": "2025-10-27T00:18:52",
      "content": "US treasury secretary anticipates tariff truce with China will be extended, and that China will revive substantial purchases of US soybeansThe US and China have agreed a framework for a trade deal just days before Donald Trump and Chines president Xi Jinping are due to meet.Treasury secretary Scott Bessent said the agreement, forged on the sidelines of the Association of south-east Asian Nations (Asean) summit in Malaysia on Sunday, would remove the threat of the imposition of 100% tariffs on Chinese imports starting on 1 November and include “a final deal” on the sale of TikTok in the US. Continue reading...",
      "content_length": 616,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "US and China reach ‘final deal’ on TikTok sale, treasury secretary says",
      "link": "https://www.theguardian.com/technology/2025/oct/26/us-china-tiktok-deal-scott-bessent",
      "published": "2025-10-26T16:25:00",
      "content": "Scott Bessent said plan was part of framework for trade deal but did not share details on transferring app’s ownershipMurdoch, Ellison and China: what we know about the US’s TikTok dealUS treasury secretary Scott Bessent claimed on Sunday that the US and China have finalized the details of a deal transferring TikTok’s US version to new owners.“We reached a final deal on TikTok,” Bessent said on Sunday on CBS’s Face the Nation with Margaret Brennan. Alluding to Donald Trump and his Chinese counterpart, Xi Jinping, Bessent continued: “We reached [a deal] in Madrid, and I believe that as of today, all the details are ironed out, and that will be for the two leaders to consummate that transaction” during a meeting scheduled for Thursday in Korea. Continue reading...",
      "content_length": 772,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Trump oversees Thailand-Cambodia ceasefire signing as Asia tour gets under way",
      "link": "https://www.theguardian.com/us-news/2025/oct/26/trump-oversees-thailand-cambodia-ceasefire-signing-as-asia-tour-gets-under-way",
      "published": "2025-10-26T10:28:05",
      "content": "Trump has begun a five-day trip to Malaysia, Japan and South Korea, his first visit to the region since taking office in JanuaryDonald Trump has overseen the signing of a ceasefire agreement between Thailand and Cambodia on the first day of an Asia tour where he will seal new trade agreements and hold a crucial meeting with Xi Jinping.The US president arrived in Malaysia on Sunday before the Asean summit in the capital, Kuala Lumpur. At a ceasefire ceremony in front of a sign that read “Delivering Peace”, the Thai prime minister, Anutin Charnvirakul, and his Cambodian counterpart, Hun Manet, signed an expanded ceasefire deal related to a deadly five-day conflict in July. Continue reading...",
      "content_length": 699,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Trump says he is open to meeting Kim Jong-un as he embarks on whirlwind Asia tour",
      "link": "https://www.theguardian.com/us-news/2025/oct/25/trump-open-to-meeting-kim-jong-un-asia-tour-japan-korea-xi-jinping",
      "published": "2025-10-25T10:08:22",
      "content": "Trip will see him take part in high-stakes trade talks with Chinese leader Xi Jinping – but he also raised prospect of meeting North Korean leaderTrump in Asia: five key questions as US president prepares for diplomatic tourDonald Trump has set off for a tour of Asia where he is expected to take part in high-stakes trade talks with China’s leader, Xi Jinping – telling reporters he was also open to a meeting with the North Korean leader, Kim Jong-un.Trump, who left Washington on Friday night, is set for a five-day trip to Malaysia, Japan and South Korea, his first visit to the region since taking office in January. He is due to arrive in Malaysia on Sunday morning local time. Continue reading...",
      "content_length": 703,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Opposition wants ‘balanced outcome’ on environment protection reforms – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/27/epbc-environment-laws-ai-copyright-lobbying-transparency-federal-parliament-anthony-albanese-asean-sussan-ley-murray-watt-ntwnfb",
      "published": "2025-10-27T06:37:46",
      "content": "This blog is now closedCoalition and Greens scolded for opposing new nature laws by author of key environment reportGet our breaking news email, free app or daily news podcastThe environment minister, Murray Watt, claims Sussan Ley’s reluctance to support the EPBC laws is about her “desperately trying to shore up her leadership” as the Coalition once again ties itself in knots over net zero and climate policy.Speaking to reporters in Parliament House this morning, he says he’s open to making a deal with either the Greens or the Coalition, flatly rejecting Ley’s request to split up the environment bill into various chunks to be voted on separately.It’s because she’s desperately trying to shore up her leadership ahead of some very difficult net zero conversations with her party room. This week, Sussan Ley is in danger of putting her own leadership ahead of the environment and ahead of business.We can’t split the bill. We need to do both, and we need to get on with it.We have been consulting to death on these reforms, and both business and environment groups are crying out for reform to finally be delivered.I can’t make that any clearer. I’ve met the same number of times with the Coalition and the Greens. I’ve spoken as recently as yesterday with representatives from those parties. What we’re about is passing a bill that is good for the environment and good for business, and it’s up to the Coalition and the Greens to decide, are they prepared to do that, or are they going to go into their corners and fight for a bill that only delivers to the environment or only delivers to business? Continue reading...",
      "content_length": 1627,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Boy, 14, in hospital after crocodile attack while fishing at far north Queensland beach",
      "link": "https://www.theguardian.com/australia-news/2025/oct/27/crocodile-attack-myall-beach-queensland-boy-fishing-hospitalised",
      "published": "2025-10-27T06:27:55",
      "content": "Incident follows several crocodile sightings around Cape Tribulation as breeding season begins and risks of aggression increaseFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastA 14-year-old boy has been hospitalised after he was attacked by a crocodile while fishing at a beach in far north Queensland, authorities said.He sustained wounds to his leg and torso on Saturday afternoon at Myall beach, Cape Tribulation, a small coastal community 140km north of Cairns, a Queensland ambulance service spokesperson said. Continue reading...",
      "content_length": 599,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Hannah McGuire’s mother tells murderer she hopes he suffers ‘most intense pain imaginable’ for life",
      "link": "https://www.theguardian.com/australia-news/2025/oct/27/hannah-mcguire-mother-tells-murderer-lachlan-young-court-hope-he-suffers-most-intense-pain-ntwnfb",
      "published": "2025-10-27T06:08:29",
      "content": "Family members of young woman strangled to death by her former boyfriend in her own home have confronted killer Lachlan Young in courtFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastA mother has confronted her daughter’s killer in court, saying she will never forgive him for taking away her vibrant and courageous girl.Lachlan Young, 23, did not look at Hannah McGuire’s mother, Debbie McGuire, as she read her statement in the Victorian supreme court on Monday. Continue reading...",
      "content_length": 548,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Bruce Lehrmann’s lawyer claims ‘key words missing’ from alleged rape victim’s phone data",
      "link": "https://www.theguardian.com/australia-news/2025/oct/27/bruce-lehrmann-lawyer-claims-key-words-missing-alleged-rape-victim-phone-ntwnfb",
      "published": "2025-10-27T04:21:00",
      "content": "Lehrmann, who is on bail and yet to formally enter a plea, is accused of raping a woman twice in Queensland in 2021Follow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastFormer Liberal staffer Bruce Lehrmann has called for a forensic expert to examine the phone of a woman he is accused of raping due to claimed discrepancies in prosecution evidence.Lehrmann, 30, has been committed to face trial in Queensland district court on two counts of rape but has filed an application to permanently halt the matter. Continue reading...",
      "content_length": 586,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Thousands without power in Queensland as Victoria experiences ‘terrifying’ winds after year’s wettest day",
      "link": "https://www.theguardian.com/australia-news/2025/oct/27/queensland-victoria-qld-brisbane-hail-storms-power-outages-wild-weather",
      "published": "2025-10-27T03:50:16",
      "content": "Wires brought down across greater Brisbane and Werribee resident tells ABC Radio of partner ‘lifted and dropped’ by huge windFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastAbout 26,000 households were without power in south-east Queensland on Monday morning after a severe thunderstorm passed over the state, with wind gusts topping 109km/h. Residents reported giant hailstones of up to 7cm in some areas.More than 1,300 energy customers in Victoria also woke without power, after Melbourne recorded its wettest day in a year and a half. Many of those outages were resolved by early Monday afternoon. Continue reading...",
      "content_length": 686,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Björn Andrésen, Swedish actor who starred in Death in Venice, dies aged 70",
      "link": "https://www.theguardian.com/film/2025/oct/27/bjorn-andresen-swedish-actor-dies-aged-70",
      "published": "2025-10-27T04:55:47",
      "content": "Actor who also starred in Midsommar and became a musician was nicknamed ‘the most beautiful boy in the world’ – a title he struggled with all his lifeBjörn Andrésen, the Swedish actor best known for his breakout role in the 1971 film Death in Venice, has died aged 70.At 15, Andrésen was cast in Italian director Luchino Visconti’s Death in Venice, based on Thomas Mann’s novella, in which he played Tadzio, a beautiful boy with whom an older man, played by Dirk Bogarde, becomes obsessed. Continue reading...",
      "content_length": 509,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Boy thrown from Tate Modern’s 10th floor can now run and swim, says family",
      "link": "https://www.theguardian.com/artanddesign/2025/oct/26/boy-thrown-from-tate-moderns-10th-floor-now-able-to-run-and-swim-says-family",
      "published": "2025-10-26T17:14:08",
      "content": "French child, who was six years old at the time of the incident in 2019, suffered life-changing injuriesA boy who was thrown from the 10th floor of Tate Modern in London six years ago can now run and swim limited distances, his family has revealed.The unnamed French boy, who his parents call their “little knight”, suffered life-changing injuries in the attack in August 2019. Jonty Bravery is serving a minimum 15-year jail term for his attempt to murder the boy. Continue reading...",
      "content_length": 485,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "French police arrest two men over €88m Louvre jewel heist",
      "link": "https://www.theguardian.com/world/2025/oct/26/two-men-reportedly-arrested-after-louvre-jewel-heist",
      "published": "2025-10-26T15:32:10",
      "content": "One man arrested at Charles de Gaulle airport and another just outside Paris, officials confirm French police have arrested two suspects believed to have helped steal crown jewels worth an estimated €88m (£76m) from the Louvre museum in Paris, officials have said, a week after one of the country’s most spectacular heists in decades.The Paris public prosecutor confirmed media reports on Sunday that one man had been detained at about 10pm local time on Saturday at the capital’s Charles de Gaulle airport by officers from the armed robberies and serious burglaries squad. Continue reading...",
      "content_length": 593,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Trump sanctions have swift impact but will world stop buying Russian oil and gas?",
      "link": "https://www.theguardian.com/business/2025/oct/26/trump-sanctions-impact-russian-oil-gas",
      "published": "2025-10-26T12:00:02",
      "content": "Analysts say president’s war on Russia’s fossil fuel revenues is a chance to bring peace to Ukraine and profit to USDonald Trump’s stated mission to broker peace in Ukraine could come down to this simple question: can the US president convince the world to stop buying Russia’s fossil fuels?Last week, Trump imposed sanctions on Russia’s two largest oil companies, Rosneft and Lukoil, in an effort to damage Moscow’s ability to fund its war machine. Continue reading...",
      "content_length": 469,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Russia arrests Ukrainian biologist for backing curbs on Antarctic krill fishing",
      "link": "https://www.theguardian.com/environment/2025/oct/26/russia-ukrainian-biologist-leonid-pshenichnov-arrest-treason-antarctic-krill-overfishing",
      "published": "2025-10-26T10:00:01",
      "content": "‘Trumped-up’ charges spark diplomatic row as scientists express fears for health of 70-year-old Leonid PshenichnovAntarctic krill: how did a paperclip-sized crustacean cause a diplomatic row – and why are they so important?A diplomatic row has erupted over the “illegal” detention of one of Ukraine’s scientists, who has been accused by the Kremlin of undermining Russia’s industrial trawling for krill in Antarctica.Leonid Pshenichnov, 70, a Ukrainian biologist who is an expert on Antarctica, has a decades-long record of scientific research and contributions to conservation, including support for marine protected areas in the region. Continue reading...",
      "content_length": 658,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Radiohead’s Thom Yorke says he would ‘absolutely not’ play in Israel now",
      "link": "https://www.theguardian.com/music/2025/oct/27/radiohead-thom-yorke-would-not-play-israel",
      "published": "2025-10-27T00:55:49",
      "content": "Singer says he will not perform in Israel while Benjamin Netanyahu remains in power, eight years after Radiohead defied criticism to perform in Tel AvivRadiohead frontman Thom Yorke has said he would not now perform in Israel, eight years after the band defied pro-Palestinian activists to play a show in Tel Aviv.“Absolutely not. I wouldn’t want to be 5,000 miles anywhere near the Netanyahu regime,” he told the Sunday Times magazine, referring to prime minister Benjamin Netanyahu’s government. Continue reading...",
      "content_length": 517,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Fears Gaza ‘temporary’ ceasefire line could become permanent new border",
      "link": "https://www.theguardian.com/world/2025/oct/26/fears-gaza-temporary-ceasefire-line-could-become-permanent-new-border",
      "published": "2025-10-26T11:55:26",
      "content": "Yellow markers installed by IDF entrench divide that cuts strip in two, as hopes of moving to next phase of truce fadeA supposedly temporary yellow line marking Gaza’s ceasefire is taking an increasingly physical form as the precarious truce shows signs of stalling, with potentially dramatic consequences for Palestine’s future.Israel Defense Forces (IDF) troops have started installing yellow concrete markers every 200 metres to delineate the area remaining under Israeli control during the first phase of the ceasefire. Continue reading...",
      "content_length": 543,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Palestinian factions say they agree to let independent technocrat committee run Gaza",
      "link": "https://www.theguardian.com/world/2025/oct/24/palestinian-factions-say-they-agree-to-let-independent-technocrat-committee-run-gaza",
      "published": "2025-10-24T16:50:30",
      "content": "Administration will manage basic services ‘in cooperation with Arab brothers and international institutions’, says joint statementThe main Palestinian factions have said they have agreed that an independent committee of technocrats would take over the running of Gaza after Hamas said it had received “clear guarantees” from mediators that “the war has effectively ended”.A joint statement published on the Hamas website said the groups had agreed in a meeting in Cairo to hand “over the administration of the Gaza Strip to a temporary Palestinian committee composed of independent ‘technocrats’, which will manage the affairs of life and basic services in cooperation with Arab brothers and international institutions”. Continue reading...",
      "content_length": 740,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Scottish fire engine destined for West Bank may return after 15-month Israeli seizure",
      "link": "https://www.theguardian.com/uk-news/2025/oct/24/scottish-fire-engine-destined-for-west-bank-may-return-after-15-month-israeli-seizure",
      "published": "2025-10-24T16:47:04",
      "content": "Dundee firefighters request return of donated appliance to avoid Nablus officials having to pay £16,000 Ashdod holding feesA fully equipped fire engine donated by Dundee firefighters to their counterparts in the West Bank city of Nablus could be sent back to Scotland after being impounded for more than a year by Israeli authorities.Firefighters in Dundee, which is twinned with Nablus, have regularly donated kit, equipment and medical supplies to the West Bank over the past 15 years, as well as bringing Palestinian firefighters to Scotland for training. Continue reading...",
      "content_length": 578,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "US secretary of state Marco Rubio says ‘Hamas cannot be involved in governing Gaza’ – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/24/aid-gaza-israel-palestine-benjamin-netanyahu-hamas-ceasefire-west-bank-middle-east-live-news",
      "published": "2025-10-24T13:31:46",
      "content": "Rubio also said the UN agency for Palestinian refugees (Unrwa) cannot play a future role in Gaza, claiming it is a ‘subsidiary of Hamas’At least 14 migrants died when their inflatable dinghy capsized in the Aegean Sea off the Turkish resort of Bodrum, the governor’s office said on Friday, raising an earlier toll of seven dead.“The lifeless bodies of 14 irregular migrants were recovered,” the office of the Mugla governorate said on X, quoting one of the two survivors as saying that 18 people had been on board when the dinghy went down. The fate of the other two remained unclear, reports Agence France-Presse (AFP). Continue reading...",
      "content_length": 640,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Australia Women’s Cricket World Cup players ‘touched inappropriately’ in India",
      "link": "https://www.theguardian.com/sport/2025/oct/25/australia-womens-cricket-world-cup-players-allegedly-touched-inappropriately-in-india",
      "published": "2025-10-25T11:37:42",
      "content": "Two players were walking to a cafe from their Indore hotelA man has been arrested after being identified on CCTVA man has been arrested for approaching two of Australia’s women cricketers and allegedly touching them inappropriately in Indore, Indian police said on Saturday.The incident occurred on Thursday in Indore, a day off for the team after their six-wicket victory over England. Continue reading...",
      "content_length": 406,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "India trials Delhi cloud seeding to clean air in world’s most polluted city",
      "link": "https://www.theguardian.com/world/2025/oct/24/india-trial-delhi-cloud-seeding-clean-air-world-polluted-city-bharatiya-janata-party",
      "published": "2025-10-24T07:25:13",
      "content": "Bharatiya Janata party launches first test flight as brown haze blankets city after Diwali – but experts decry ‘gimmick’The Delhi regional government is trialling a cloud-seeding experiment to induce artificial rain, in an effort to clean the air in the world’s most polluted city.The Bharatiya Janata party (BJP) has been proposing the use of cloud seeding as a way to bring Delhi’s air pollution under control since it was elected to lead the regional government this year. Continue reading...",
      "content_length": 495,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Thailand to let Myanmar refugees work to counter aid cuts and labour shortages",
      "link": "https://www.theguardian.com/global-development/2025/oct/22/thailand-to-let-myanmar-refugees-work-aid-cuts-labour-shortages",
      "published": "2025-10-22T03:00:53",
      "content": "The move, welcomed by UN, will allow thousands of people living in camps to support themselves and their familiesThailand is setting a regional precedent this month by giving refugees permission to work in the country in an effort to tackle aid cuts and its own labour shortages.More than 87,000 refugees living in nine refugee camps along Thailand’s border with Myanmar have been totally reliant on handouts of food and foreign aid. Continue reading...",
      "content_length": 453,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Delhi awakes to a toxic haze after Diwali as pollution season begins",
      "link": "https://www.theguardian.com/world/2025/oct/21/delhi-awakes-toxic-haze-diwali-pollution-season-begins",
      "published": "2025-10-21T09:11:18",
      "content": "Air breathed by people in the city categorised as ‘severe’ in quality after fireworks contribute to thick smogDelhi awoke to a thick haze on Tuesday, a day after millions of people celebrated the Hindu festival of Diwali with fireworks, marking the beginning of the pollution season that has become an annual blight on India’s capital.Those in the most polluted city in the world once again found themselves breathing dangerously toxic air that fell into the “severe” category on Tuesday morning. Continue reading...",
      "content_length": 516,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Thousands detained as Myanmar military raids notorious KK park scam compound",
      "link": "https://www.theguardian.com/world/2025/oct/21/myanmar-kk-park-raid-scam-cybercrime-centre-compound",
      "published": "2025-10-21T01:16:06",
      "content": "Myanmar's military moved in to tackle a major online scam operation near the Thailand border, state media reportedMyanmar’s military has raided a major online scam operation near the border with Thailand, detaining more than 2,000 people and seizing dozens of Starlink satellite internet terminals, state media has reported.According to a report in Monday’s Myanma Alinn newspaper, Myanmar’s army raided KK Park, a well-documented cybercrime centre, as part of operations starting in early September to suppress online fraud, illegal gambling, and cross-border cybercrime. Continue reading...",
      "content_length": 592,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Archaeological dig to unearth wreckage of WW2 hero pilot crash under way",
      "link": "https://www.theguardian.com/world/2025/oct/27/archaeological-dig-to-unearth-wreckage-of-ww2-hero-pilot-crash-under-way",
      "published": "2025-10-27T05:00:22",
      "content": "Exclusive: Excavation, overseen by the US Department of Defense, will feature in More 4’s Hidden Wonders TV seriesOn 26 January 1944, a 23-year-old US pilot was flying a mighty P-47 Thunderbolt on a wartime training exercise when it crashed in Essex.Locals witnessed the horror of 2nd Lt Lester Lowry’s aircraft diving to the ground and bursting into flames. Lowry was not seen to bail out and he has remained missing in action (MIA) for more than 80 years. Ironically, his plane was named “Lucky Boy”. Continue reading...",
      "content_length": 522,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "NHS leaders warn of longer waiting times if demand for extra £3bn not met",
      "link": "https://www.theguardian.com/society/2025/oct/27/nhs-leaders-demand-extra-funding-waiting-times",
      "published": "2025-10-27T00:01:18",
      "content": "Key Labour pledge under threat as health service faces costs from redundancies, strikes and rising drug pricesNHS bosses are seeking an emergency injection of £3bn to cover unexpected costs and have warned ministers that without it patients will wait longer for treatment and hospitals will start rationing care.Their move presents a fresh problem for Rachel Reeves, the chancellor, as she tries to find ways to fill an estimated £30bn hole in the nation’s finances in her budget next month. Continue reading...",
      "content_length": 511,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Racist incidents against UK nurses surge by 55%",
      "link": "https://www.theguardian.com/society/2025/oct/27/racist-incidents-against-uk-nurses-surge",
      "published": "2025-10-27T00:01:18",
      "content": "Royal College of Nursing calls on government to stop using anti-migrant rhetoric, which it says emboldens racist behaviourThe number of reports by nurses of racist incidents at work has risen by 55% over three years, according to analysis by the nursing union.The Royal College of Nursing (RCN) expects to receive more than 1,000 calls this year from nurses seeking advice and support after racist incidents in the workplace, compared with almost 700 cases in 2022. Continue reading...",
      "content_length": 485,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Over 1,200 health leaders call for swift passage of UK tobacco and vapes bill",
      "link": "https://www.theguardian.com/society/2025/oct/27/uk-tobacco-and-vapes-bill-experts-letter",
      "published": "2025-10-27T00:01:18",
      "content": "Experts publish letter as peers prepare to scrutinise draft legislation six months after its second Commons readingMore than 1,200 public health leaders have called for the tobacco and vapes bill to be passed swiftly through parliament to “protect future generations”.They said in a cross-party letter that the “gamechanging” measures outlined were “far too important to let it slip off the agenda”. Continue reading...",
      "content_length": 419,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Private rent in Britain now swallows 44% of the average wage",
      "link": "https://www.theguardian.com/money/2025/oct/27/private-rent-britain-record-swallows-average-wage",
      "published": "2025-10-27T00:01:17",
      "content": "Monthly cost jumps to record £1,385 outside London, and £2,736 in the capital, with hotspots showing hefty rises Average private rents in Great Britain have climbed to record highs, with the amount tenants are being asked to pay in some hotspots rising more than 25% in a year, data shows.The typical advertised private rent outside London for properties coming on to the market rose to a record £1,385 a calendar month in the third quarter of this year, according to the property website Rightmove. Continue reading...",
      "content_length": 519,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Japan’s new PM will hope the Abe effect endears Trump to her at crucial talks",
      "link": "https://www.theguardian.com/world/2025/oct/27/japans-new-pm-will-hope-the-abe-effect-endears-trump-to-her-at-crucial-talks",
      "published": "2025-10-27T06:50:35",
      "content": "Sanae Takaichi leads a minority government and needs a successful meeting with the US president on Tuesday. Thankfully her mentor, Shinzo Abe, is one of Trump’s ‘favourites’Japan’s new prime minister, Sanae Takaichi, faces the first real test of her diplomatic and personal skills when she meets Donald Trump for talks in Tokyo that are expected to focus on trade and security.Takaichi, who this month became Japan’s first female leader after winning a vote to lead the ruling Liberal Democratic party (LDP), made her international debut at this weekend’s Asean summit. Continue reading...",
      "content_length": 589,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "US Boeing workers continue midwest strike after rejecting latest contract offer",
      "link": "https://www.theguardian.com/us-news/2025/oct/26/boeing-workers-strike-midwest-reject-contract",
      "published": "2025-10-26T22:54:48",
      "content": "Nearly three-month strike includes 3,200 machinists at plants where military aircraft and weapons are developedBoeing workers at three midwest plants where military aircraft and weapons are developed voted Sunday to reject the company’s latest contract offer and to continue a strike that started almost three months ago.The strike by about 3,200 machinists at the plants in Mascoutah, Illinois, and the Missouri cities of St Louis and St Charles is smaller in scale than a walkout last year by 33,000 Boeing workers who assemble commercial jetliners but threatens to complicate the aerospace company’s progress in regaining its financial footing. Continue reading...",
      "content_length": 667,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "US airports report over 20 air traffic controller shortage incidents in one day",
      "link": "https://www.theguardian.com/us-news/2025/oct/26/air-traffic-controller-shortages-shutdown",
      "published": "2025-10-26T19:42:15",
      "content": "Transportation secretary says figure is ‘one of the highest we’ve seen’ since 1 October as shutdown drags onUS airports have reported more than 20 incidents of air traffic controller shortages on Saturday, said Sean Duffy, transportation secretary, in the latest sign of the government shutdown’s impact.A ground stop was issued by the agency at Los Angeles international airport due to the air traffic controller staffing shortages at around 11.30am ET (15.30 GMT). The restriction covered most of the southern California region and delays are likely when flights resume. Continue reading...",
      "content_length": 592,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "One killed and six injured after shooting at Pennsylvania’s Lincoln University",
      "link": "https://www.theguardian.com/us-news/2025/oct/26/pennsylvania-lincoln-university-shooting",
      "published": "2025-10-26T18:11:52",
      "content": "One armed person detained as historically Black school shooting comes amid rising violence at homecoming eventsAt least one person was killed and six others wounded in a shooting at Lincoln University in Pennsylvania late on Saturday, as students and alumni celebrated homecoming at outdoor festivities at the historically Black university, authorities said.A person who had a firearm was detained, and officials are investigating the possibility that there was more than one shooter but don’t believe there is any active threat to the campus, Chester county’s district attorney, Christopher de Barrena-Sarobe, said during a brief news conference early on Sunday. Continue reading...",
      "content_length": 683,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Gavin Newsom confirms he is considering 2028 presidential run",
      "link": "https://www.theguardian.com/us-news/2025/oct/26/gavin-newsom-2028-presidential-race",
      "published": "2025-10-26T17:31:20",
      "content": "Democratic California governor and high-profile Trump critic plans to make decision after 2026 midtermsGavin Newsom, California’s Democratic governor, told CBS News Sunday Morning he plans to make a decision on whether to run for president in 2028 once the 2026 midterm elections are over.“Yeah, I’d be lying otherwise,” Newsom said in response to a question on whether he would give serious thought to a White House bid after the 2026 elections. “I’d just be lying. And I’m not – I can’t do that.” Continue reading...",
      "content_length": 518,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Brazil's Lula says trade deal with US could come ‘within days’",
      "link": "https://www.france24.com/en/americas/20251027-lula-trump-brazil-trade-deal",
      "published": "2025-10-27T04:47:35",
      "content": "Brazilian President Luiz Inacio Lula da Silva said on Monday that US President Donald Trump had “guaranteed” a trade deal between the two nations during their recent meeting. Speaking on the sidelines of the ASEAN summit in Malaysia, Lula said the agreement would come “faster than anyone thinks.”",
      "content_length": 297,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Ten on trial in Paris over sexist cyber-harassment of Brigitte Macron",
      "link": "https://www.france24.com/en/france/20251027-ten-face-trial-in-paris-over-sexist-cyber-harassment-of-brigitte-macron",
      "published": "2025-10-27T03:00:30",
      "content": "Ten people went on trial in Paris on Monday accused of sexist cyber-harassment against French first lady Brigitte Macron, over false claims she was assigned male at birth. The case follows a defamation suit she and President Emmanuel Macron filed in the United States in July over the same rumour.",
      "content_length": 297,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Cameroon protests turn deadly ahead of presidential election results",
      "link": "https://www.france24.com/en/africa/20251027-four-dead-cameroon-opposition-protests-douala",
      "published": "2025-10-27T01:02:58",
      "content": "Four people were killed on Sunday in clashes between security forces and opposition protesters in Cameroon’s largest city, Douala, the regional governor said. Supporters of opposition candidate Issa Tchiroma defied a protest ban in several cities ahead of Monday’s expected announcement of presidential election results.",
      "content_length": 320,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "US-backed Milei scores surprise midterm win, revives Argentina reform drive",
      "link": "https://www.france24.com/en/americas/20251026-milei-reforms-argentinal-midterm-vote",
      "published": "2025-10-26T23:05:26",
      "content": "Argentina’s libertarian President Javier Milei scored a surprise victory in Sunday’s midterm elections, bolstering his embattled reform drive. His La Libertad Avanza party won 40.84% of votes for Congress, far outpacing the opposition and marking a rebound for the US-backed right-winger after months of economic turmoil and political resistance.",
      "content_length": 346,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Caribbean braces for impact as Melissa surges into a Category 4 hurricane",
      "link": "https://www.france24.com/en/americas/20251026-caribbean-braces-for-impact-as-melissa-surges-into-a-category-4-hurricane",
      "published": "2025-10-26T20:28:09",
      "content": "Hurricane Melissa is expected to make landfall in Jamaica Monday night or Tuesday morning, with local officials warning of possibly catastrophic flooding. The storm, now strengthened into a Category 4 hurricane, has already killed at least four people as it grinds across the Caribbean.",
      "content_length": 286,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "US warship docks in Trinidad and Tobago as Trump steps up military pressure on Venezuela",
      "link": "https://www.france24.com/en/americas/20251026-us-warship-docks-in-trinidad-and-tobago-as-trump-steps-up-military-pressure-on-venezuela",
      "published": "2025-10-26T19:31:09",
      "content": "A US guided missile destroyer docked in the twin island nation of Trinidad and Tobago Sunday as the administration of US President Donald Trump continued its campaign of military pressure against Venezuela. The warship will remain in Trinidad until Thursday.",
      "content_length": 258,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Mbappé and Bellingham secure Real Madrid victory over Barcelona in tense El Clasico",
      "link": "https://www.france24.com/en/sport/20251026-mbapp%C3%A9-and-bellingham-secure-real-madrid-victory-over-barcelona-in-tense-el-clasico",
      "published": "2025-10-26T17:58:38",
      "content": "Jude Bellingham's goal, following an early scoring by Kylian Mbappé, helped Real Madrid beat Barcelona 2-1 to win a tense El Clasico and move five points clear of their bitter rivals at the top of La Liga on Sunday.",
      "content_length": 215,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Red Cross, Egyptian teams join search for dead hostages in Gaza",
      "link": "https://www.france24.com/en/middle-east/20251026-red-cross-egyptian-teams-join-search-for-dead-hostages-in-gaza",
      "published": "2025-10-26T17:36:16",
      "content": "Teams from the Red Cross and Egypt have joined the search for the remains of hostages still buried in the rubble of the devastated Gaza Strip, an Israeli spokesperson said Sunday. Hamas said it has widened its search for the dead hostages, whose return is fundamental to the US-brokered ceasefire.",
      "content_length": 297,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "French police arrest suspects linked to Louvre jewellery heist",
      "link": "https://www.france24.com/en/video/20251026-french-police-arrest-suspects-linked-to-louvre-jewellery-heist",
      "published": "2025-10-26T16:16:01",
      "content": "Suspects have been arrested in connection with the theft of crown jewels from Paris’ Louvre museum, the Paris prosecutor said on Sunday, a week after the heist that stunned the world. The prosecutor said that investigators made the arrests on Saturday evening, adding that one of the men taken into custody was preparing to leave the country from Paris Charles de Gaulle Airport.",
      "content_length": 379,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Nigerian regulator wants more control of TikTok: 'It eats our youth's time'",
      "link": "https://www.france24.com/en/tv-shows/tech-24/20251026-nigerian-regulator-wants-more-control-of-tiktok-it-eats-our-youth-s-time",
      "published": "2025-10-26T15:53:12",
      "content": "Nigeria’s technology regulator says the country must wield more power over TikTok, setting their own rules rather than relying on global content policies.",
      "content_length": 154,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Trump kicks off Asia tour with Xi meeting on the agenda",
      "link": "https://www.france24.com/en/video/20251026-trump-kicks-off-asia-tour-with-xi-meeting-on-the-agenda",
      "published": "2025-10-26T15:33:04",
      "content": "US President Donald Trump started his Asia tour in Malaysia Sunday by rewarding Cambodia and Thailand with trade deals after co-signing their ceasefire pact, and saying he was confident of a \"great\" trade deal at upcoming talks with China's Xi Jinping. Trump brimmed with confidence ahead of the meeting with Xi in South Korea, that seeks to end the bruising trade war between the world's two biggest economies.",
      "content_length": 411,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Argentinians vote in midterm elections seen as key test for Milei",
      "link": "https://www.france24.com/en/video/20251026-argentinians-vote-in-midterm-elections-seen-as-key-test-for-milei",
      "published": "2025-10-26T15:31:00",
      "content": "Polls opened Sunday in Argentina for legislative elections that would determine whether President Javier Milei can expand his party's hold on parliament in the second half of his term. Argentina's economic troubles abound despite unprecedented US aid, and the election outcome may determine whether Milei's budget-slashing cuts and attempts to deregulate the economy will survive. FRANCE 24 speaks to Juan Pablo Ferrero, senior lecturer in Latin American Politics at the University of Bath, to shed more light on the vote.",
      "content_length": 522,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Sudan's paramilitary Rapid Support Forces claim capture of key Darfur city",
      "link": "https://www.france24.com/en/africa/20251026-sudan-s-paramilitary-rapid-support-forces-claim-capture-of-key-darfur-city",
      "published": "2025-10-26T14:52:32",
      "content": "Sudan's paramilitary Rapid Support Forces (RSF) on Sunday said that it had taken control of the city of El-Fasher, the last major urban centre in western Darfur still outside its control. Local pro-army fighters accused the RSF of running a \"media disinformation campaign\" and insisted that residents were still fighting the paramilitary group.",
      "content_length": 344,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "US and China agree on trade framework for rare earths, soybeans",
      "link": "https://www.france24.com/en/americas/20251026-us-china-agree-trade-framework-rare-earths-soybeans",
      "published": "2025-10-26T14:15:24",
      "content": "US Treasury Secretary Scott Bessent on Sunday signalled that Washington and Beijing had reached a tentative trade framework that would see China delaying export curbs on rare earths and buying more US soybeans. If confirmed, the agreement would avert a threatened 100 percent hike on tariffs on Chinese exports.",
      "content_length": 311,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Transat Café-L’OR 2025: Former Ultim winners return to defend title",
      "link": "https://www.france24.com/en/video/20251026-transat-caf%C3%A9-l-or-2025-former-ultim-winners-return-to-defend-title",
      "published": "2025-10-26T13:58:11",
      "content": "Armel Le Cléac’h, skipper of the Maxi Banque Populaire XI, never leaves anything to chance as he and co-skipper Sébastien Josse prepare for the 2025 Transat Café-L’OR, formerly the Transat Jacques Vabre. Former winners of the Ultim division, the duo will face thousands of nautical miles of unpredictable Atlantic waters, where tactical decisions, extreme weather, and high-speed sailing make every move crucial. Cédric Ferreira reports with Simon Moritz.",
      "content_length": 455,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Vote counting underway in Ivory Coast presidential election",
      "link": "https://www.france24.com/en/video/20251026-vote-counting-underway-in-ivory-coast-presidential-election",
      "published": "2025-10-26T13:52:31",
      "content": "Votes were being counted late Saturday in Ivory Coast after citizens cast their ballots to elect a new leader. Longtime President Alassane Ouattara is seeking a fourth term while his key contenders were barred from the race.",
      "content_length": 224,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Trump discusses future of Gaza with Qatari leaders",
      "link": "https://www.france24.com/en/video/20251026-trump-discusses-future-of-gaza-with-qatari-leaders",
      "published": "2025-10-26T13:35:35",
      "content": "President Donald Trump met Qatar’s leaders on Sunday to discuss the future of the Gaza ceasefire he helped broker. Following the talks, he said a coalition of peacekeeping forces would soon be deployed. Meanwhile Israeli PM Netanyahu said Israel would decide which foreign troops it will allow as part of the plan.",
      "content_length": 314,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Easier to ‘break into museums than a jewellery shop’: Louvre heist highlights security gaps",
      "link": "https://www.france24.com/en/video/20251026-easier-to-break-into-museums-than-a-jewellery-shop-louvre-heist-highlights-security-gaps",
      "published": "2025-10-26T13:32:18",
      "content": "Suspects have been arrested over the brazen jewellery heist at the Louvre, just as one of them was about to fly out of France, the Paris prosecutor said on Sunday. On 19 October, four hooded thieves stole eight precious pieces worth an estimated $102 million from the museum’s collection, exposing security lapses at the world’s most-visited museum. Struggling to manage an ever-growing influx of tourists, the Louvre faces unique challenges. “All of these elements together have made it maybe much easier for thieves to break into museums than it would be to break into a jewellery shop,” FRANCE 24’s Philip Turle said in an analysis.",
      "content_length": 635,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "The week in pictures: Kermit the Frog in Paris, Sarkozy goes to prison and a White House demolition",
      "link": "https://www.france24.com/en/culture/20251026-the-week-in-pictures-kermit-the-frog-in-paris-sarkozy-goes-to-prison-and-a-white-house-demolition",
      "published": "2025-10-26T12:25:03",
      "content": "Kermit the Frog takes over Paris's Place Vendôme, former French president Nicolas Sarkozy goes to prison, a mysterious gentleman goes viral in the wake of the Louvre heist, and US President Donald Trump demolishes the East Wing of the White House to make way for a ballroom. FRANCE 24 takes a look back at the week's most striking images.",
      "content_length": 338,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "France's ex-president Sarkozy receives police protection in prison",
      "link": "https://www.france24.com/en/video/20251026-france-s-ex-president-sarkozy-receives-police-protection-in-prison",
      "published": "2025-10-26T11:45:09",
      "content": "Former French President Nicolas Sarkozy will have two police officers stationed in nearby cells while he is in prison to ensure he comes to no harm, France's interior minister said on Wednesday. Sarkozy on Tuesday began a five-year sentence after being convicted of conspiring to raise campaign funds from Libya, arriving at La Santé prison in Paris - a stunning downfall for a man who led the country between 2007 and 2012.",
      "content_length": 424,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Stolen Louvre jewels likely still ‘intact’ and in France, expert says",
      "link": "https://www.france24.com/en/video/20251026-stolen-louvre-jewels-likely-still-intact-and-in-france-expert-says",
      "published": "2025-10-26T11:35:53",
      "content": "The crown jewels stolen from the Louvre are most likely “still intact” and “still in France,” art crime detective Arthur Brand told FRANCE 24. Speaking in an interview, Brand noted that, as only a week has passed since the heist, it is unlikely the robbers have dismantled the jewels or smuggled them out of the country.",
      "content_length": 320,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Suspects arrested over Louvre museum jewellery heist",
      "link": "https://www.france24.com/en/video/20251026-louvre-heist-suspects-reportedly-arrested-in-northern-paris-suburb",
      "published": "2025-10-26T11:20:02",
      "content": "Investigators made arrests over the weekend in connection with the theft of crown jewels from the Louvre, said the Paris prosecutor, adding that one of the suspects taken into custody was preparing to leave the country from the Charles de Gaulle (CDG) international airport. FRANCE 24’s Ellen Gainsford notes that French authorities are being extremely guarded about releasing details about the detained suspects.",
      "content_length": 413,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Valencia flood anniversary: Protesters demand regional leader’s resignation",
      "link": "https://www.france24.com/en/video/20251026-valencia-flood-anniversary-protesters-demand-regional-leader-s-resignation",
      "published": "2025-10-26T10:58:16",
      "content": "Tens of thousands of people took to the streets of Spain's eastern city of Valencia on Saturday to mark the first anniversary of floods that killed 229 people, and to denounce the handling of the disaster. Demonstrators, many carrying photos of the victims, called on regional leader Carlos Mazon to resign over what they say was the slow response to one of Europe's deadliest natural disasters in decades.",
      "content_length": 406,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Lamine Yamal's controversial Real Madrid comments add to Clásico tension",
      "link": "https://www.france24.com/en/tv-shows/sports/20251026-lamine-yamal-s-controversial-real-madrid-comments-add-to-cl%C3%A1sico-tension",
      "published": "2025-10-26T10:41:26",
      "content": "Barcelona and Real Madrid are gearing up for the first Clásico clash of the season on Sunday, with the Catalans looking to clinch a fifth consecutive win against the league leaders. Lamine Yamal's midweek comments, claiming that Real Madrid \"steal and complain\", have upped the ante ahead of what was already a much-anticipated fixture.",
      "content_length": 336,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Whale and dolphin migrations are being disrupted by climate change",
      "link": "https://arstechnica.com/science/2025/10/whale-and-dolphin-migrations-are-being-disrupted-by-climate-change/",
      "published": "2025-10-25T11:00:09",
      "content": "For millennia, some of the world’s largest filter-feeding whales, including humpbacks, fin whales, and blue whales, have undertaken some of the longest migrations on earth to travel between their warm breeding grounds in the tropics to nutrient-rich feeding destinations in the poles each year.\n“Nature has finely tuned these journeys, guided by memory and environmental cues that tell whales when to move and where to go,” said Trisha Atwood, an ecologist and associate professor at Utah State University’s Quinney College of Agriculture and Natural Resources. But, she said, climate change is “scrambling these signals,” forcing the marine mammals to veer off course. And they’re not alone.\nEarlier this year, Atwood joined more than 70 other scientists to discuss the global impacts of climate change on migratory species in a workshop convened by the United Nations Convention on the Conservation of Migratory Species of Wild Animals. The organization monitors and protects more than 1,000 species that cross borders in search of food, mates, and favorable conditions to nurture their offspring.Read full article\nComments",
      "content_length": 1125,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Are you the asshole? Of course not!—quantifying LLMs’ sycophancy problem",
      "link": "https://arstechnica.com/ai/2025/10/are-you-the-asshole-of-course-not-quantifying-llms-sycophancy-problem/",
      "published": "2025-10-24T22:26:30",
      "content": "Researchers and users of LLMs have long been aware that AI models have a troubling tendency to tell people what they want to hear, even if that means being less accurate. But many reports of this phenomenon amount to mere anecdotes that don’t provide much visibility into how common this sycophantic behavior is across frontier LLMs.\nTwo recent research papers have come at this problem a bit more rigorously, though, taking different tacks in attempting to quantify exactly how likely an LLM is to listen when a user provides factually incorrect or socially inappropriate information in a prompt.\nSolve this flawed theorem for me\nIn one pre-print study published this month, researchers from Sofia University and ETH Zurich looked at how LLMs respond when false statements are presented as the basis for difficult mathematical proofs and problems. The BrokenMath benchmark that the researchers constructed starts with “a diverse set of challenging theorems from advanced mathematics competitions held in 2025.” Those problems are then “perturbed” into versions that are “demonstrably false but plausible” by an LLM that’s checked with expert review.Read full article\nComments",
      "content_length": 1176,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "A single point of failure triggered the Amazon outage affecting millions",
      "link": "https://arstechnica.com/gadgets/2025/10/a-single-point-of-failure-triggered-the-amazon-outage-affecting-millions/",
      "published": "2025-10-24T21:53:20",
      "content": "The outage that hit Amazon Web Services and took out vital services worldwide was the result of a single failure that cascaded from system to system within Amazon’s sprawling network, according to a post-mortem from company engineers.\nThe series of failures lasted for 15 hours and 32 minutes, Amazon said. Network intelligence company Ookla said its DownDetector service received more than 17 million reports of disrupted services offered by 3,500 organizations. The three biggest countries where reports originated were the US, the UK, and Germany. Snapchat, AWS, and Roblox were the most reported services affected. Ookla said the event was “among the largest internet outages on record for Downdetector.”\nIt’s always DNS\nAmazon said the root cause of the outage was a software bug in software running the DynamoDB DNS management system. The system monitors the stability of load balancers by, among other things, periodically creating new DNS configurations for endpoints within the AWS network. A race condition is an error that makes a process dependent on the timing or sequence events that are variable and outside the developers’ control. The result can be unexpected behavior and potentially harmful failures.Read full article\nComments",
      "content_length": 1245,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Man takes herbal pain quackery, nearly dies, spends months in hospital",
      "link": "https://arstechnica.com/health/2025/10/man-takes-herbal-pain-quackery-nearly-dies-spends-months-in-hospital/",
      "published": "2025-10-24T21:29:30",
      "content": "A 61-year-old man in California is lucky to be alive after a combination of herbal supplements he was taking for joint pain ended up utterly wrecking his body, landing him in intensive care and in a delirious state for months. His case is reported in the Annals of Internal Medicine: Clinical Cases.\nThe man turned up at a hospital in San Francisco in bad shape, but with nonspecific problems that had begun just two days earlier. His back hurt, he was feverish, nauseous, bloated, and he hadn’t been eating much. He was so weak he couldn’t walk or get out of bed without help. His heart rate and breathing rate were high. His blood pressure was low. There were multiple wounds on his lower body in various stages of healing.\nInitial exams and lab work revealed Staphylococcus aureus bacteria in his blood. There was also an abscess on his shoulder and an infection in and around his spine, which was worsening. Doctors wanted to perform a surgical procedure to relieve the pressure building up on his spinal cord and nerves, but his blood pressure was too low—and then he went into hemorrhagic shock from bleeding in his gastrointestinal tract. Doctors transferred him to the intensive care unit.Read full article\nComments",
      "content_length": 1223,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Clinical trial of a technique that could give everyone the best antibodies",
      "link": "https://arstechnica.com/science/2025/10/dna-and-jolts-of-electricity-get-people-to-make-optimal-antibodies/",
      "published": "2025-10-24T20:58:11",
      "content": "One of the things that emerging diseases, including the COVID and Zika pandemics, have taught us is that it’s tough to keep up with infectious diseases in the modern world. Things like air travel can allow a virus to spread faster than our ability to develop therapies. But that doesn’t mean biotech has stood still; companies have been developing technologies that could allow us to rapidly respond to future threats.\nThere are a lot of ideas out there. But this week saw some early clinical trial results of one technique that could be useful for a range of infectious diseases. We’ll go over the results as a way to illustrate the sort of thinking that’s going on, along with the technologies we have available to pursue the resulting ideas.\nThe best antibodies\nAny emerging disease leaves a mass of antibodies in its wake—those made by people in response to infections and vaccines, those made by lab animals we use to study the infectious agent, and so on. Some of these only have a weak affinity for the disease-causing agent, but some of them turn out to be what are called “broadly neutralizing.” These stick with high affinity not only to the original pathogen, but most or all of its variants, and possibly some related viruses.Read full article\nComments",
      "content_length": 1264,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "The Android-powered Boox Palma 2 Pro fits in your pocket, but it’s not a phone",
      "link": "https://arstechnica.com/gadgets/2025/10/the-android-powered-boox-palma-2-pro-fits-in-your-pocket-but-its-not-a-phone/",
      "published": "2025-10-24T20:07:30",
      "content": "Digital reading devices like the Kindle have existed for almost 20 years, and the standard eReader form factor has hardly changed at all. Amazon, Boox, and a few other companies have offered larger E Ink screens, but how about something smaller? Boox has unveiled its second-generation Palma e-reader, which still fits in your pocket but adds a color screen and mobile data connectivity.\nThe first-gen Palma launched last year, earning fans who saw it as a way to read and access some apps without the full spate of distracting smartphone experiences. Boox e-readers are essentially Android tablets with E Ink screens and a few software quirks that arise from their unofficial Google Play implementation. The second-gen Palma might offer more opportunities for distraction because it’s almost a smartphone.\nThe Palma 2 Pro upgrades the 6.1-inch monochrome display from the original to a 6.13-inch color E Ink Kaleido display. That’s the same technology used in Amazon’s Kindle Colorsoft. The Amazon reader is a bit larger with its 7-inch display and chunkier bezels. Of course, the Kindle isn’t trying to fit in your pocket like the Palma 2 Pro, which is roughly the size and shape of a phone.Read full article\nComments",
      "content_length": 1219,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Tech billionaires are now shaping the militarization of American cities",
      "link": "https://arstechnica.com/tech-policy/2025/10/troops-in-us-cities-tech-billionaires-are-shaping-that-too/",
      "published": "2025-10-24T18:55:47",
      "content": "Yesterday, Donald Trump announced on social media that he had been planning to “surge” troops into San Francisco this weekend—but was dissuaded from doing so by several tech billionaires.\n“Friends of mine who live in the area called last night to ask me not to go forward with the surge,” Trump wrote.\nWho are these “friends”? Trump named “great people like [Nvidia CEO] Jensen Huang, [Salesforce CEO] Marc Benioff, and others” who told him that “the future of San Francisco is great. They want to give it a ‘shot.’ Therefore, we will not surge San Francisco on Saturday. Stay tuned!”Read full article\nComments",
      "content_length": 610,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Tesla’s “Mad Max” mode is now under federal scrutiny",
      "link": "https://arstechnica.com/cars/2025/10/feds-probe-tesla-about-its-mad-max-mode/",
      "published": "2025-10-24T18:35:30",
      "content": "Earlier this month, Tesla rolled out a new firmware update that added a pair of new driving modes for the controversial full self-driving (FSD) feature. One, called “Sloth,” relaxes acceleration and stays in its lane. The other, called “Mad Max,” does the opposite: It speeds and swerves through traffic to get you to your destination faster. And after multiple reports of FSD Teslas doing just that, the National Highway Traffic Safety Administration wants to know more.\nIn fact, “Mad Max” mode is not entirely new—Tesla beta-tested the same feature in Autopilot in 2018, before deciding not to roll it out in a production release after widespread outcry.\nThese days, the company is evidently feeling less constrained; despite having just lost a federal wrongful death lawsuit that will cost it hundreds of millions of dollars, it described the new mode as being able to drive “through traffic at an incredible pace, all while still being super smooth. It drives your car like a sports car. If you are running late, this is the mode for you.”Read full article\nComments",
      "content_length": 1069,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "EU accuses Meta of violating content rules in move that could anger Trump",
      "link": "https://arstechnica.com/tech-policy/2025/10/trump-tariff-threats-havent-stopped-eu-from-cracking-down-on-meta/",
      "published": "2025-10-24T18:18:19",
      "content": "Meta violated the Digital Services Act (DSA) by failing to give Facebook and Instagram users simple mechanisms to report illegal content, the European Commission said in a preliminary decision announced yesterday. Meta also failed to give users an effective way to challenge content moderation decisions, the EC said.\n“When it comes to Meta, neither Facebook nor Instagram appear to provide a user-friendly and easily accessible ‘Notice and Action’ mechanism for users to flag illegal content, such as child sexual abuse material and terrorist content,” the EC press release said. The EC said that Meta mechanisms seem to “impose several unnecessary steps and additional demands on users. In addition, both Facebook and Instagram appear to use so-called ‘dark patterns,’ or deceptive interface designs, when it comes to the ‘Notice and Action’ mechanisms.”\nThe EC also found that the content moderation appeal mechanisms used by Facebook and Instagram do not “allow users to provide explanations or supporting evidence to substantiate their appeals. This makes it difficult for users in the EU to further explain why they disagree with Meta’s content decision, limiting the effectiveness of the appeals mechanism.”Read full article\nComments",
      "content_length": 1240,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Microsoft’s Mico heightens the risks of parasocial LLM relationships",
      "link": "https://arstechnica.com/ai/2025/10/microsofts-mico-heightens-the-risks-of-parasocial-llm-relationships/",
      "published": "2025-10-24T17:07:57",
      "content": "Microsoft is rolling out a new face for its AI, and its name is Mico. The company announced the new, animated blob-like avatar for Copilot’s voice mode yesterday as part of a “human-centered” rebranding of Microsoft’s Copilot AI efforts.\nMico is part of a Microsoft program dedicated to the idea that “technology should work in service of people,” Microsoft wrote. The company insists this effort is “not [about] chasing engagement or optimizing for screen time. We’re building AI that gets you back to your life. That deepens human connection.”\nMico has drawn instant and obvious comparisons to Clippy, the animated paperclip that popped up to offer help with Microsoft Office starting in the ’90s. Microsoft has leaned into this comparison with an Easter egg that can transform Mico into an animated Clippy.Read full article\nComments",
      "content_length": 835,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Rivian is settling $250 million lawsuit to focus on next year’s R2 EV",
      "link": "https://arstechnica.com/cars/2025/10/rivian-settles-shareholder-lawsuit-for-250-million-denies-allegations/",
      "published": "2025-10-24T16:30:12",
      "content": "Electric vehicle startup Rivian announced on Thursday that it has settled a lawsuit with some of its investors. The company continues to deny allegations of making “materially untrue” statements during its inial public offering but says it agreed to pay $250 million to clear itself of distractions as it focuses on building its next EV, the mass-market R2, which is due next year.\nRivian was first sued by a shareholder in 2022 over claims that the startup knew it would cost far more for it to build each R1T electric truck and R1S electric SUV than the advertised $67,500 and $70,000 prices, respectively. A big surprise price increase would tarnish the nascent automaker’s reputation, the lawsuit claimed, and could lead to many of the almost 56,000 pre-orders being canceled.\nJust a few months after its November 2021 IPO, the company had indeed issued a hefty price hike: $79,500 for the R1T and $84,500 for the R1S SUV. After an outcry, the company said it would honor the original price for its existing preorders. By that point, though, the damage was done, and more than a third of the company’s value was erased within a few days, the lawsuit alleged.Read full article\nComments",
      "content_length": 1188,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Bats eat the birds they pluck from the sky while on the wing",
      "link": "https://arstechnica.com/science/2025/10/tracking-bats-as-they-hunt-birds-in-the-skies-above-europe/",
      "published": "2025-10-24T16:16:55",
      "content": "There are three species of bats that eat birds. We know that because we have found feathers and other avian remains in their feces. What we didn’t know was how exactly they hunt birds, which are quite a bit heavier, faster, and stronger than the insects bats usually dine on.\nTo find out, Elena Tena, a biologist at Doñana Biological Station in Seville, Spain, and her colleagues attached ultra-light sensors to Nyctalus Iasiopterus, the largest bats in Europe. What they found was jaw-droppingly brutal.\nInconspicuous interceptors\nNyctalus Iasiopterus, otherwise known as greater noctule bats, have a wingspan of about 45 centimeters. They have reddish-brown or chestnut fur with a slightly paler underside, and usually weigh around 40 to 60 grams. Despite that minimal weight, they are the largest of the three bat species known to eat birds, so the key challenge in getting a glimpse into the way they hunt was finding sensors light enough to not impede the bats’ flight.Read full article\nComments",
      "content_length": 1000,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "DNA analysis reveals likely pathogens that killed Napoleon’s army",
      "link": "https://arstechnica.com/science/2025/10/dna-analysis-reveals-likely-pathogens-that-killed-napoleons-army/",
      "published": "2025-10-24T15:24:52",
      "content": "In 1812, Napoleon Bonaparte led a disastrous military campaign into Moscow. The death toll was devastating: Out of some 615,000 men, only about 110,000 survivors returned. (Napoleon abandoned his army in early December to return home on a sled.) Roughly 100,000 of the casualties died in battle, while as many as 300,000 perished from a combination of the bitter cold of Russia’s notoriously harsh winter, starvation, and disease.\nScholars have debated precisely what kinds of diseases ravaged Napoleon’s troops. New DNA analysis of some soldiers’ remains has revealed the presence of two pathogens in particular, according to a new paper published in the journal Current Biology. The first is Salmonella enterica, which causes paratyphoid fever; the second is Borrelia recurrentis, which is transmitted by body lice and causes relapsing fever. (A preprint of the paper appeared on bioaRxiv in July.)\n“It’s very exciting to use a technology we have today to detect and diagnose something that was buried for 200 years,” said co-author Nicolás Rascovan of the Institut Pasteur. “Accessing the genomic data of the pathogens that circulated in historical populations helps us to understand how infectious diseases evolved, spread, and disappeared over time and to identify the social or environmental contexts that played a part in these developments. This information provides us with valuable insights to better understand and tackle infectious diseases today.”Read full article\nComments",
      "content_length": 1486,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "This browser claims “perfect privacies protection,” but it acts like malware",
      "link": "https://arstechnica.com/security/2025/10/this-browser-claims-perfect-privacies-protection-but-it-acts-like-malware/",
      "published": "2025-10-24T14:37:03",
      "content": "The Universe Browser makes some big promises to its potential users. Its online advertisements claim it’s the “fastest browser,” that people using it will “avoid privacy leaks” and that the software will help “keep you away from danger.” However, everything likely isn’t as it seems.\nThe browser, which is linked to Chinese online gambling websites and is thought to have been downloaded millions of times, actually routes all Internet traffic through servers in China and “covertly installs several programs that run silently in the background,” according to new findings from network security company Infoblox. The researchers say the “hidden” elements include features similar to malware—including “key logging, surreptitious connections,” and changing a device’s network connections.\nPerhaps most significantly, the Infoblox researchers who collaborated with the United Nations Office on Drugs and Crime (UNODC) on the work, found links between the browser’s operation and Southeast Asia’s sprawling, multibillion-dollar cybercrime ecosystem, which has connections to money-laundering, illegal online gambling, human trafficking, and scam operations that use forced labor. The browser itself, the researchers says, is directly linked to a network around major online gambling company BBIN, which the researchers have labeled a threat group they call Vault Viper.Read full article\nComments",
      "content_length": 1392,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Satellite shows what’s really happening at the East Wing of the White House",
      "link": "https://arstechnica.com/space/2025/10/satellite-shows-whats-really-happening-at-the-east-wing-of-the-white-house/",
      "published": "2025-10-24T14:18:13",
      "content": "You need to go up—way up—to fully appreciate the changes underway at the White House this week.\nDemolition crews starting tearing down the East Wing of the presidential mansion Tuesday to clear room for the construction of a new $300 million, 90,000-square-foot ballroom, a recent priority of President Donald Trump. The teardown drew criticism and surprise from Democratic lawmakers, former White House staffers, and members of the public.\nIt was, after all, just three months ago that President Donald Trump defended his ballroom plan by saying it wouldn’t affect the existing structure at the White House. “It won’t interfere with the current building,” he said in July. “It’ll be near it but not touching it—and pays total respect to the existing building, which I’m the biggest fan of.”Read full article\nComments",
      "content_length": 817,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Rocket Report: China tests Falcon 9 lookalike; NASA’s Moon rocket fully stacked",
      "link": "https://arstechnica.com/space/2025/10/rocket-report-china-tests-falcon-9-lookalike-nasas-moon-rocket-fully-stacked/",
      "published": "2025-10-24T11:00:36",
      "content": "Welcome to Edition 8.16 of the Rocket Report! The 10th anniversary of SpaceX’s first Falcon 9 rocket landing is coming up at the end of this year. We’re still waiting for a second company to bring back an orbital-class booster from space for a propulsive landing. Two companies, Jeff Bezos’ Blue Origin and China’s LandSpace, could join SpaceX’s exclusive club as soon as next month. (Bezos might claim he’s already part of the club, but there’s a distinction to be made.) Each company is in the final stages of launch preparations—Blue Origin for its second New Glenn rocket, and LandSpace for the debut flight of its Zhuque-3 rocket. Blue Origin and LandSpace will both attempt to land their first stage boosters downrange from their launch sites. They’re not exactly in a race with one another, but it will be fascinating to see how New Glenn and Zhuque-3 perform during the uphill and downhill phases of flight, and whether one or both of the new rockets stick the landing.\nAs always, we welcome reader submissions. If you don’t want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets, as well as a quick look ahead at the next three launches on the calendar.\n\n    \n                        \n                  \n      \n\nThe race for space-based interceptors. The Trump administration’s announcement of the Golden Dome missile defense shield has set off a race among US companies to develop and test space weapons, some of them on their own dime, Ars reports. One of these companies is a 3-year-old startup named Apex, which announced plans to test a space-based interceptor as soon as next year. Apex’s concept will utilize one of the company’s low-cost satellite platforms outfitted with an “Orbital Magazine” containing multiple interceptors, which will be supplied by an undisclosed third-party partner. The demonstration in low-Earth orbit could launch as soon as June 2026 and will test-fire two interceptors from Apex’s Project Shadow spacecraft. The prototype interceptors could pave the way for operational space-based interceptors to shoot down ballistic missiles. (submitted by biokleen)Read full article\nComments",
      "content_length": 2273,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "With new acquisition, OpenAI signals plans to integrate deeper into the OS",
      "link": "https://arstechnica.com/ai/2025/10/openai-acquires-the-team-that-made-apples-shortcuts/",
      "published": "2025-10-23T22:08:40",
      "content": "OpenAI has acquired Software Applications Incorporated (SAI), perhaps best known for the core team that produced what became Shortcuts on Apple platforms. More recently, the team has been working on Sky, a context-aware AI interface layer on top of macOS. The financial terms of the acquisition have not been publicly disclosed.\n“AI progress isn’t only about advancing intelligence—it’s about unlocking it through interfaces that understand context, adapt to your intent, and work seamlessly,” an OpenAI rep wrote in the company’s blog post about the acquisition. The post goes on to specify that OpenAI plans to “bring Sky’s deep macOS integration and product craft into ChatGPT, and all members of the team will join OpenAI.”\nThat includes SAI co-founders Ari Weinstein (CEO), Conrad Kramer (CTO), and Kim Beverett (Product Lead)—all of whom worked together for several years at Apple after Apple acquired Weinstein and Kramer’s previous company, which produced an automation tool called Workflows, to integrate Shortcuts across Apple’s software platforms.Read full article\nComments",
      "content_length": 1084,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Lawsuit: Reddit caught Perplexity “red-handed” stealing data from Google results",
      "link": "https://arstechnica.com/tech-policy/2025/10/reddit-sues-to-block-perplexity-from-scraping-google-search-results/",
      "published": "2025-10-23T21:54:39",
      "content": "In a lawsuit filed on Wednesday, Reddit accused an AI search engine, Perplexity, of conspiring with several companies to illegally scrape Reddit content from Google search results, allegedly dodging anti-scraping methods that require substantial investments from both Google and Reddit.\nReddit alleged that Perplexity feeds off Reddit and Google, claiming to be “the world’s first answer engine” but really doing “nothing groundbreaking.”\n“Its answer engine simply uses a different company’s” large language model “to parse through a massive number of Google search results to see if it can answer a user’s question based on those results,” the lawsuit said. “But Perplexity can only run its ‘answer engine’ by wrongfully accessing and scraping Reddit content appearing in Google’s own search results from Google’s own search engine.”Read full article\nComments",
      "content_length": 860,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Researchers show that training on “junk data” can lead to LLM “brain rot”",
      "link": "https://arstechnica.com/ai/2025/10/researchers-show-that-training-on-junk-data-can-lead-to-llm-brain-rot/",
      "published": "2025-10-23T21:20:48",
      "content": "On the surface, it seems obvious that training an LLM with “high quality” data will lead to better performance than feeding it any old “low quality” junk you can find. Now, a group of researchers is attempting to quantify just how much this kind of low quality data can cause an LLM to experience effects akin to human “brain rot.”\nFor a pre-print paper published this month, the researchers from Texas A&amp;M, the University of Texas, and Purdue University drew inspiration from existing research showing how humans who consume “large volumes of trivial and unchallenging online content” can develop problems with attention, memory, and social cognition. That led them to what they’re calling the “LLM brain rot hypothesis,” summed up as the idea that “continual pre-training on junk web text induces lasting cognitive decline in LLMs.”\nFiguring out what counts as “junk web text” and what counts as “quality content” is far from a simple or fully objective process, of course. But the researchers used a few different metrics to tease a “junk dataset” and “control dataset” from HuggingFace’s corpus of 100 million tweets.Read full article\nComments",
      "content_length": 1151,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Dinosaurs may have flourished right up to when the asteroid hit",
      "link": "https://arstechnica.com/science/2025/10/dinosaurs-may-have-flourished-right-up-to-when-the-asteroid-hit/",
      "published": "2025-10-23T20:57:36",
      "content": "The end of the dinosaurs was clearly linked to an asteroid impact that brought the Cretaceous period to a close. But the details of their end have remained a matter of debate since the impact crater was discovered. There is a lot of evidence that the impact alone should have been enough to do them in. But the asteroid arrived amid major volcanic eruptions associated with previous mass extinctions. And fossils dating to just before the impact have suggested that dinosaur-dominated ecosystems had become less diverse, making them more prone to collapse.\nNow, a new study has revealed that fossils we already know about originated within the last few hundred thousand years before the impact that killed off all dinosaurs except birds. The results indicate that species richness wasn’t likely to be a problem—at least in the neighborhood of the impact itself.\nWyoming vs. New Mexico\nMost of what we know about the last days of the non-avian dinosaurs comes from the Hell Creek Formation, rich fossil beds in present-day Wyoming. These not only date from within a few hundred thousand years prior to the impact, but there may be deposits that capture the immediate aftermath of the impact. Beyond this area, which reflects the ecosystem of the northern Great Plains, we have little else. It hasn’t been clear whether the diversity of species present at Hell Creek reflects what was present more globally, or if there were regional differences in ecosystemsRead full article\nComments",
      "content_length": 1483,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "You need to listen to the brutally oppressive I’ve Seen All I Need to See",
      "link": "https://www.theverge.com/column/806767/you-need-to-listen-to-the-body-ive-seen-all-i-need-to-see",
      "published": "2025-10-26T16:00:00",
      "content": "\n\n\n\t\n\t\t\n\nThere are only a handful of albums that I think qualify as genuinely scary. You Won't Get What You Want by Daughters, and Swans To Be Kind both immediately come to mind. But those records come with… let's say, baggage. I've Seen All I Need to See lacks some of the atmospheric spookiness of To Be Kind and the flashes of pop-tinged menace of You Won't Get What You Want, but it makes up for that with unrelenting brutality. It's not the soundtrack to a slasher film, it's the most violent scene in the bleakest horror film, rendered as blown-out drums and detuned guitar.\nThe album opens with a reading of Douglas Dunn's The Kaleidoscope, a poem ab …\nRead the full story at The Verge.",
      "content_length": 693,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Adobe’s Project Indigo camera finally adds iPhone 17 support",
      "link": "https://www.theverge.com/news/806779/adobes-project-indigo-camera-finally-adds-iphone-17-support",
      "published": "2025-10-26T15:17:22",
      "content": "\n\n\n\t\n\t\t\n\nAdobe’s computational photography app, Project Indigo, had a bit of trouble adapting to the new square-format selfie sensor in the iPhone 17 series. For the last month or so, the app simply didn’t support Apple’s latest phones at all. Adobe was working behind the scenes to get things up and running, and posting occasional updates to the Adobe Community forums. But the company has decided to simply turn off access to the front-facing camera entirely, in order to get some version of Project Indigo out the door with iPhone 17 support.\n\nThe app debuted back in June and immediately started garnering fans who preferred the softer touch it took to processing images, compared to the standard iPhone camera app. But the new sensors in the iPhone 17 series apparently threw Project Indigo for a loop. A fix in iOS 26.1 will allow Adobe to enable selfie camera support as well, but for now, iPhone 17 owners will have to make do with rear-camera support only. \n\n",
      "content_length": 969,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "How Guitar Hero made everybody a rock star",
      "link": "https://www.theverge.com/podcast/806168/guitar-hero-game-version-history",
      "published": "2025-10-26T14:41:11",
      "content": "\n\n\n\t\n\t\t\n\n\"Sharp Dressed Man,\" by ZZ Top. Hard on a good day, Medium when my friends were over, Expert once and then never ever again. That was my Guitar Hero sweet spot. And for years, it seemed like everybody had one. The plastic guitar controllers became a staple of living rooms everywhere, and the songs - from big bands, small bands, and bands that didn't even actually exist - became huge hits. Long before TikTok was the most important thing in music, getting your track on a Guitar Hero setlist could change your life forever.\nFor this episode of Version History, we go through the whole history of Guitar Hero. The story begins in arcades in Japan, …\nRead the full story at The Verge.",
      "content_length": 693,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "The next legal frontier is your face and AI",
      "link": "https://www.theverge.com/column/805821/the-next-legal-frontier-is-your-face-and-ai",
      "published": "2025-10-26T12:00:00",
      "content": "\n\n\n\t\n\t\t\n\nThis is The Stepback, a weekly newsletter breaking down one essential story from the tech world. For more on the legal morass of AI, follow Adi Robertson. The Stepback arrives in our subscribers' inboxes at 8AM ET. Opt in for The Stepback here.\nHow it started \nThe song was called \"Heart on My Sleeve,\" and if you didn't know better, you might guess you were hearing Drake. If you did know better, you were hearing the starting bell of a new legal and cultural battle: the fight over how AI services should be able to use people's faces and voices, and how platforms should respond.\nBack in 2023, the AI-generated faux-Drake track \"Heart on My Sl …\nRead the full story at The Verge.",
      "content_length": 691,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "My favorite e-reader just got a big update",
      "link": "https://www.theverge.com/tech/806697/boox-palma-2-pro-chatgpt-atlas-galaxy-xr-installer",
      "published": "2025-10-26T12:00:00",
      "content": "\n\n\n\t\n\t\t\n\nHi, friends! Welcome to Installer No. 103, your guide to the best and Verge-iest stuff in the world. (If you're new here, welcome, sorry everything's so expensive this week, and also you can read all the old editions at the Installer homepage.) \nThis week, I've been reading about gooning and Costco and protein bars and the Jonas Brothers, bingeing Nobody Wants This season two, trying to figure out how to save $4,500 for the new Rivian e-bike, telling anyone who will listen that T-Pain's still got it, learning everything I can about the Louvre heist, playing a surprising amount of Fortnite on my iPad, and shopping for Yoto Players after abou …\nRead the full story at The Verge.",
      "content_length": 693,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Tech left teens fighting over scraps, and now it wants those too",
      "link": "https://www.theverge.com/report/806728/tech-left-teens-fighting-over-scraps-robots-taking-jobs",
      "published": "2025-10-25T18:00:00",
      "content": "\n\n\n\t\n\tRobots will be flipping your burgers soon.\t\n\nRight now, there are robots stocking convenience store shelves in Japan. We haven't embraced that tech here in America yet, but it's hard to imagine 7-11 or Walmart won't at least experiment with it soon. Walmart gave up on its shelf-scanning robots in 2020, but machine vision and AI have improved a lot in the last five years, and it's only a matter of time before it's a machine refilling that row of family-sized Fruity Pebbles and not a kid earning some extra cash during senior year of high school.\nTruth is, there just aren't many jobs for teens out there anymore, and most of them have chosen to simply remove themselves from the job market …\nRead the full story at The Verge.",
      "content_length": 735,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "AirTags and cheap gaming laptops headline our favorite deals this week",
      "link": "https://www.theverge.com/tech/806174/apple-airtag-hulu-with-live-tv-deal-sale",
      "published": "2025-10-25T15:09:15",
      "content": "\n\n\n\t\n\tYou can grab a four-pack of AirTags for just $64.99 right now.\t\n\nApple’s AirTags have become one of my essentials while traveling, namely because they let me check whether my luggage is in the right place instead of panicking at the baggage claim. And right now, you can get a four-pack of AirTags at Amazon and Walmart for $64.99 ($35 off), which is just a few cents short of the bundle’s all-time low.\n\nThe sleek Bluetooth trackers let you check their location using Apple’s Find My app. If the item is out of Bluetooth range, you can flag the AirTag as lost, and you’ll receive an update on its location whenever it’s near an iPhone or iPad. You can also share the location of an AirTag with up to five other people or select airlines if your bag doesn&#8217;t arrive at the terminal or you need someone to grab it ASAP.\n\nIf you have an iPhone 15 or newer model, you can also leverage ultra wideband tech to enable “precision finding,” which will show you the distance and direction to your AirTag. What’s more, each location tracker uses replaceable batteries and carries an IP67 rating, meaning it can withstand immersion in up to a meter of water for half an hour.\n\nRead our original AirTag review.\nApple AirTags\n\nWhere to Buy: $99 $64.99 at Amazon (four-pack) $99 $64.99 at Walmart (four-pack)\n\n\nThere&#8217;s no shortage of great gaming laptops out there, but it’s hard to argue against the value of Lenovo’s Legion 5 — especially given it’s currently on sale for $1,049 ($501 off) at Walmart, which is about $100 short of its recent Prime Day low. The Legion 5 features a 15.1-inch 2,560 x 1,600 OLED screen with a 165Hz refresh rate, an AMD Ryzen 7 260 processor, 16GB of RAM, a 512GB SSD, and an Nvidia GeForce RTX 5060 GPU. That’s a lot of power for a gaming laptop in this price range, and you can upgrade its storage (up to 2TB) and RAM (up to 32GB) yourself to improve its performance down the line.\n\nIf you want a more capable machine out of the box, you can also pick up the step-up configuration with 1TB of storage and an Intel Core i7 14700HX processor for $1,199 ($300 off) at Walmart. Both models are equipped with a backlit RGB keyboard, three USB-A ports, two USB-C ports, an HDMI port, an ethernet port, and a power adapter port.\nLenovo Legion 5 gaming laptop\n\nWhere to Buy: $1549.99 $1049 at Walmart (AMD model) $1499.99 $1199 at Walmart (Intel model)\n\n\nIf you want to cut the cord (and binge-watch your favorite shows and movies), Hulu is offering a three-month subscription to Hulu with Live TV for $64.99 ($25 off) through November 5th at 6PM ET. The ongoing promo is limited to new and former subscribers, though, specifically those who haven’t had an active subscription in more than a month.\n\nHulu with Live TV lets you stream more than 95 channels, including Comedy Central, VH1, and Adult Swim. A subscription also provides access to Hulu and Disney Plus (with ads), along with both ESPN Select and ESPN Unlimited. The trio of streaming services lets you watch live sports and download new shows and movies, including Andor, Abbot Elementary, The Lowdown, Alien Earth, Stay, and Tempest. Just keep in mind that your subscription will automatically renew at the then-current price after three months, unless you cancel it beforehand.\nHulu with Live TV\nHulu (with Live TV) lets you stream over 90 channels with unlimited DVR. The subscription also comes with (ad-supported) Disney Plus and Hulu subscriptions, plus ESPN Select and Unlimited.\n\nWhere to Buy: $89.99 $64.99 at Hulu (per month)\nMore standouts from this week\n\n\nSummer might be over, but you can still grab JBL’s Charge 6 at Walmart starting at $153.99 ($46 off). The waterproof Bluetooth speaker features an upgraded woofer, up to 28 hours of continuous playback, and an IP68 rating, meaning it can withstand immersion in more than three feet of water for over 30 minutes. The Charge 6 also supports JBL’s AI Sound Boost feature — which analyzes your audio to avoid distortion at higher volumes — as well as lossless audio from streaming services like Apple Music and Spotify (finally), so long as you connect using a USB-C cable.\n\n\n\nCMF’s Buds 2A were already a solid pair of budget earbuds, but they’re even more so today, now that they’re on sale at Amazon for Prime members for a mere $29 ($20 off). The inexpensive in-ears feature noise cancellation, a sweat-proof IP54 rating, and multipoint Bluetooth support, not to mention up to five hours of playback with ANC enabled or eight hours with it off. You can also tweak their sound, adjust ANC levels, and locate them via Nothing’s app, which is a welcome surprise for a pair of $30 earbuds.\n\n\n\nIf you want to beef up your home security system, Ring’s Battery Doorbell Plus is down to a new low of $79.99 ($70 off) at Amazon and Best Buy. Our favorite battery-powered buzzer can record sharp 1536p video, capture an entire person from top to bottom, and features removable batteries for easy charging. It also lasts about two months on a single charge with HDR and snapshot capture enabled, and with a Ring Home subscription ($4.99 a month / $49.99 a year), can provide up to 180 days of history.\n",
      "content_length": 5152,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "What does nearly $6,000 of gaming laptop get you?",
      "link": "https://www.theverge.com/tech/806052/msi-titan-18-ai-rtx-5090-gaming-laptop-review",
      "published": "2025-10-25T15:00:00",
      "content": "\n\n\n\t\n\tMSI’s flagship is indeed titanic in stature, and certainly price.\t\n\nIt's easy to get into the weeds on a hobby, especially if you're into PC gaming and dreaming of the highest levels of graphical performance. But how much is too much for hardware? Spending top dollar on graphics power, processing, RAM, storage, etc. - like many things - eventually leads to diminishing returns. When it comes to gaming laptops, MSI's $5,699.99 Titan 18 is well beyond that inflection point. But it's also like nothing else. \nIt's not very logical to spend that much when other excellent gaming laptops are nearly as powerful but cost almost half as much. While the Titan is an absolutely reckless purchase, it's also a joyous one t …\nRead the full story at The Verge.",
      "content_length": 758,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "ICE is building a social media panopticon",
      "link": "https://www.theverge.com/policy/806425/ice-social-media-surveillance-free-speech-assault",
      "published": "2025-10-25T14:00:00",
      "content": "\n\n\n\t\n\t\t\n\nAs Immigration and Customs Enforcement carries out raids across the country, the agency is working rapidly to expand an online surveillance system that could potentially track millions of users on the web. Federal records uncovered by The Lever reveal that ICE is paying $5.7 million to use an AI-powered social media monitoring platform called Zignal Labs, something Will Owen, the communications director at the Surveillance Technology Oversight Project (STOP), calls an \"assault\" on democracy and free speech. \nThe \"real-time intelligence\" platform is capable of ingesting and analyzing vast amounts of publicly available data, like social media …\nRead the full story at The Verge.",
      "content_length": 693,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Ball x Pit is a deep, delightful rabbit hole",
      "link": "https://www.theverge.com/games/805022/ball-x-pit-review-pc-nintendo-switch-ps5-xbox-series-x-s",
      "published": "2025-10-25T13:00:00",
      "content": "\n\n\n\t\n\t\t\n\nIt took me a while to get into Ball x Pit. The new roguelike blends elements from games like Breakout, Vampire Survivors, and even city builders, creating a complex mix of ideas. But as is the case with many roguelikes, once I figured everything out well enough to get a taste of my first win, delving back into the pit for another round was all I could think about.\nBall x Pit barely has a story - it's more like a setup. The initial moments of the game show a multi-tiered Gondor-like city called \"Ballbylon\" being struck by a giant, glowing rock (ball?), and all that remains is a giant pit that \"treasure seekers\" aim to explore. Then, you're d …\nRead the full story at The Verge.",
      "content_length": 693,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Preisschock bei Microsoft 365 mit Copilot: Australische Behörde reicht Klage ein",
      "link": "https://www.heise.de/news/Preisschock-bei-Microsoft-365-mit-Copilot-Australische-Behoerde-reicht-Klage-ein-10900222.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-27T06:11:00",
      "content": "Nachdem Microsoft die Preise für das Office-Abo nach der Integration der Copilot-KI deutlich angehoben und eine Alternative versteckt hat, gibt es eine Klage.",
      "content_length": 158,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "WSUS-Lücke: Bereits Attacken beobachtet",
      "link": "https://www.heise.de/news/WSUS-Luecke-Bereits-Attacken-beobachtet-10899799.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-25T06:57:00",
      "content": "Microsoft hat am Freitagmorgen Notfallupdates für eine WSUS-Sicherheitslücke veröffentlicht. Die wird nun im Internet angegriffen.",
      "content_length": 130,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "AWS-Ausfall: Amazon legt vollständigen Ursachenbericht vor",
      "link": "https://www.heise.de/news/AWS-Ausfall-Amazon-legt-vollstaendigen-Ursachenbericht-vor-10848208.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-24T11:41:00",
      "content": "Der AWS-Ausfall Anfang der Woche hat viele Internet-Dienste lahmgelegt. Amazon hat nun einen vollständigen Bericht veröffentlicht.",
      "content_length": 130,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Angreifer attackieren kritische Lücke in Adobe Commerce und Magento",
      "link": "https://www.heise.de/news/Angreifer-attackieren-kritische-Luecke-in-Adobe-Commerce-und-Magento-10845752.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-24T07:11:00",
      "content": "Im September hat Adobe Updates für Commerce und Magento veröffentlicht, die eine kritische Lücke schließen. Die wird nun angegriffen.",
      "content_length": 133,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Microsoft WSUS: Notfallupdate stopft kritische Codeschmuggel-Lücke",
      "link": "https://www.heise.de/news/Microsoft-WSUS-Notfallupdate-stopft-kritische-Codeschmuggel-Luecke-10845666.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-24T06:07:00",
      "content": "Am Freitagmorgen hat Microsoft ein Notfall-Update für eine kritische Sicherheitslücke in WSUS veröffentlicht. Ein Exploit wurde gesichtet.",
      "content_length": 138,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Vorsicht Kunde: Unsichere Packstation",
      "link": "https://www.heise.de/news/Vorsicht-Kunde-Unsichere-Packstation-10845620.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-24T04:25:00",
      "content": "Packstationen sind praktisch, der Paketempfang klappt meist reibungslos, doch beim Versand lauern Risiken und bei einem Sendungsverlust droht der Totalschaden.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Seekabel: EU warnt vor Abhängigkeit von US-Hyperscalern",
      "link": "https://www.heise.de/news/Seekabel-EU-warnt-vor-Abhaengigkeit-von-US-Hyperscalern-10824923.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-23T14:21:00",
      "content": "Ein EU-Bericht warnt vor Europas Abhängigkeit von US-Technologiekonzernen bei Unterseekabeln und kritischen Komponenten. Auch die Reparatur ist gefährdet.",
      "content_length": 154,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "LKA Niedersachsen warnt vor Guthabenkarten-Betrugsmasche",
      "link": "https://www.heise.de/news/LKA-Niedersachsen-warnt-vor-Guthabenkarten-Betrugsmasche-10819486.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-23T12:29:00",
      "content": "Das LKA Niedersachsen sieht eine Häufung von Betrugsversuchen, bei denen Täter sich als Bekannte ausgeben und Guthabenkarten wollen.",
      "content_length": 132,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Nexperia-Krise: Wirtschaftsministerium sieht \"erhebliche Betroffenheit\"",
      "link": "https://www.heise.de/news/Nexperia-Krise-Wirtschaftsministerium-sieht-erhebliche-Betroffenheit-10819376.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-23T11:35:00",
      "content": "Die Folgen der Auseinandersetzung um den Chiphersteller Nexperia sind weiter unklar. Das Bundeswirtschaftsministerium spricht von \"erheblicher Betroffenheit\".\n",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "KDE Plasma 6.5 kommt mit kurvigen Ecken",
      "link": "https://www.heise.de/news/KDE-Plasma-6-5-kommt-mit-kurvigen-Ecken-10813730.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-23T09:11:00",
      "content": "Die neue Version der Desktop-Umgebung KDE Plasma schleift die Fensterecken rund, verbessert die Zwischenablage und legt bei der Barrierefreiheit nach.",
      "content_length": 150,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Falschinformation durch KI: 45 Prozent der Antworten fehlerhaft",
      "link": "https://www.heise.de/news/Europaeische-Rundfunkunion-KI-Systeme-geben-Nachrichteninhalte-oft-falsch-wider-10796779.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-22T15:16:00",
      "content": "Im Rahmen einer Studie interpretierten ChatGPT & Co. in 45 Prozent der Fälle Nachrichteninhalte fehlerhaft – unabhängig von Sprache, Region oder Plattform.",
      "content_length": 155,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Windows: Netzwerkprobleme durch geklonte Installationen",
      "link": "https://www.heise.de/news/Windows-Anmeldeprobleme-im-Netz-mit-geklonten-SIDs-10794271.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-22T11:24:00",
      "content": "Seit den Update-Vorschauen aus dem August klemmt die Netzwerkanmeldung von geklonten Windows-Installationen mit identischen SIDs.",
      "content_length": 129,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Bahn zieht Reißleine: Cargo-Chefin Nikutta muss gehen",
      "link": "https://www.heise.de/news/Bahn-zieht-Reissleine-Cargo-Chefin-Nikutta-muss-gehen-10794333.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-22T10:03:00",
      "content": "Seit 2020 hat Sigrid Nikutta versucht, DB Cargo zu sanieren. Nach Kritik der Gewerkschaft und einem verheerenden Gutachten zieht der Konzern Konsequenzen.",
      "content_length": 154,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Have I Been Pwned: 183 Millionen Zugänge  aus Infostealer-Sammlung hinzugefügt",
      "link": "https://www.heise.de/news/Have-I-Been-Pwned-183-Millionen-von-Infostealern-erbeutete-Zugaenge-ergaenzt-10793974.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-22T07:44:00",
      "content": "\"Have I Been Pwned\" sammelt veröffentlichte Zugangsdaten. Nun kamen 183 Millionen von Infostealern geklaute Konten hinzu.",
      "content_length": 121,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Ein Browser für ChatGPT: OpenAI gibt Chrome-Konkurrenten Atlas für macOS frei",
      "link": "https://www.heise.de/news/Ein-Browser-fuer-ChatGPT-OpenAI-gibt-Chrome-Konkurrenten-Atlas-fuer-macOS-frei-10793833.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-22T05:12:00",
      "content": "Wer ChatGPT beim Surfen nutzt, muss bislang noch viel zwischen Tabs wechseln und Inhalte kopieren. Das soll mit Atlas der Vergangenheit angehören, sagt OpenAI.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Gefährlicher und unsichtbarer Wurm in Visual Studio Code Extensions gefunden",
      "link": "https://www.heise.de/news/Gefaehrlicher-und-unsichtbarer-Wurm-in-Visual-Studio-Code-Extensions-gefunden-10789320.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-21T08:14:00",
      "content": "Eine Schadsoftware, die Credentials und Kryptowährungen abgreift, nutzt Unicode für unsichtbaren Code und installiert einen Remote-Access-Trojaner.",
      "content_length": 147,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Abermals neuer NTFS-Treiber für Linux vorgestellt",
      "link": "https://www.heise.de/news/Abermals-neuer-NTFS-Treiber-fuer-Linux-vorgestellt-10789388.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-21T07:18:00",
      "content": "Ein erfahrener Kernel-Hacker hat den Dateisystem-Treiber \"ntfsplus\" vorgestellt, der Schwächen bisheriger Lösungen vermeidet, aber keinen Freifahrtschein hat.",
      "content_length": 158,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Microsoft: Update außer der Reihe für Windows Recovery Environment",
      "link": "https://www.heise.de/news/Microsoft-Update-ausser-der-Reihe-fuer-Windows-Recovery-Environment-10789291.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-21T06:50:00",
      "content": "Ein ungeplantes Update für die Windows-Wiederherstellungsumgebung macht sie wieder bedienbar – auch mit USB-Keyboards und -Mäusen.",
      "content_length": 130,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Amazon Web Services: AWS wieder im Normalbetrieb",
      "link": "https://www.heise.de/news/Amazon-Web-Services-AWS-wieder-im-Normalbetrieb-10789249.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-21T05:23:00",
      "content": "Am Montag legte ein Fehler Amazons Web Services und damit diverse Internet-Dienste lahm. Amazon erklärt die Probleme.",
      "content_length": 117,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Bemannte Mondlandung: NASA-Chef droht SpaceX mit Vertragsentzug",
      "link": "https://www.heise.de/news/Rueckkehr-zum-Mond-NASA-Chef-droht-SpaceX-mit-Auftrag-fuer-Konkurrenten-10789259.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-21T05:19:00",
      "content": "SpaceX soll schon Menschen bald zurück zum Mond bringen. Die NASA erhöht nun den Druck, weil der Zeitplan nicht zu halten ist – und auch aus anderen Gründen.",
      "content_length": 157,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Werkzeugsammlung Powertoys 0.95: Automatischer Windows-Lichtschalter",
      "link": "https://www.heise.de/news/Werkzeugsammlung-Powertoys-0-95-Automatischer-Windows-Lichtschalter-10782114.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-20T11:32:00",
      "content": "Die Werkzeugsammlung Powertoys bekommt in Version 0.95 einen Lichtschalter. Der schaltet den Darkmode automatisch an und aus.",
      "content_length": 125,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Amazon Web Services: Globale Störung am Montagmorgen",
      "link": "https://www.heise.de/news/Amazon-Web-Services-Globale-Stoerung-10778963.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-20T08:37:00",
      "content": "Diverse Internet-Dienste beklagten am Montagmorgen Ausfälle. Das ging auf Störungen der Cloud-Dienste Amazon Web Services zurück.",
      "content_length": 129,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Windows-Updates: Probleme nach dem Patchday",
      "link": "https://www.heise.de/news/Windows-Updates-Probleme-nach-dem-Patchday-10778683.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-20T06:54:00",
      "content": "Microsoft meldet einige Probleme, die nach der Installation der Sicherheitsupdates vom Oktober-Patchday auftreten.",
      "content_length": 114,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Instagrams Teen-Konten bekommen ein filmreifes Update",
      "link": "https://www.heise.de/news/Instagrams-Teen-Konten-bekommen-ein-filmreifes-Update-10752367.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-14T12:00:00",
      "content": "Social Media für Jugendliche: Teenager bekommen bei Instagram künftig nur noch das zu sehen, was in etwa FSK 12 bei Filmen entspricht. ",
      "content_length": 135,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "77 Prozent betroffen: Kleine Unternehmen jetzt ohne MS-Office-Support",
      "link": "https://www.heise.de/news/77-Prozent-betroffen-Kleine-Unternehmen-jetzt-ohne-MS-Office-Support-10753286.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-14T08:03:00",
      "content": "Der Support für Microsoft Office 2016 und 2019 endet heute, am 14. Oktober 2025. Etliche kleine Firmen stehen jetzt ohne Sicherheitsupdates da.",
      "content_length": 143,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "KI-Update: KI-Vorurteile, Campact gegen xAI, Schwachstelle in LLMs, rabbitAI",
      "link": "https://www.heise.de/news/KI-Update-KI-Vorurteile-Campact-gegen-xAI-Schwachstelle-in-LLMs-rabbitAI-10751038.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-13T13:00:00",
      "content": "Das \"KI-Update\" liefert werktäglich eine Zusammenfassung der wichtigsten KI-Entwicklungen.",
      "content_length": 90,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Jeeps nach OTA-Software-Update unbrauchbar",
      "link": "https://www.heise.de/news/OTA-Software-Update-brickt-Jeeps-waehrend-der-Fahrt-10751765.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-13T12:57:00",
      "content": "Ein Software-Update für die Telemetrie-Einheit hat Jeeps mit Hybridantrieb in den USA ausfallen lassen – bei einigen auf dem Highway.",
      "content_length": 133,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Widerstand und Chancen: Der digitale Euro spaltet das EU-Parlament",
      "link": "https://www.heise.de/news/Digitaler-Euro-Souveraenitaetsdrang-und-ein-glitschiger-Fisch-im-EU-Parlament-10751673.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-13T12:16:00",
      "content": "Die EU-Abgeordneten schwanken beim geplanten digitalen Euro zwischen politischem Widerstand, der Lust an Souveränität und einer Inklusionsforderung.",
      "content_length": 148,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Studie zur digitalen Kluft in Arztpraxen: Software-Nutzung mit Ost-West-Gefälle",
      "link": "https://www.heise.de/news/Studie-zur-digitalen-Kluft-in-Arztpraxen-Software-Nutzung-mit-Ost-West-Gefaelle-10749684.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-10T09:01:00",
      "content": "Praxissoftware ist regional sehr unterschiedlich nutzerfreundlich. Ostdeutsche Praxen nutzen häufiger weniger nutzerfreundliche Systeme. Das zeigt eine Studie.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Freie Alternative zu Google und Apple: Free Software Foundation plant LibrePhone",
      "link": "https://www.heise.de/news/Freie-Alternative-zu-Google-und-Apple-Free-Software-Foundation-plant-LibrePhone-10749621.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-10T08:47:00",
      "content": "Die Free Software Foundation (FSF) will mit dem LibrePhone Projekt eine freie Alternative zu Android und iOS entwickeln. Es wäre nicht der erste Anlauf der FSF.",
      "content_length": 160,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Dramatische Warnung: US-Satelliten sollen Sonnenlicht zur Erde reflektieren",
      "link": "https://www.heise.de/news/Astronomen-alarmiert-US-Satelliten-sollen-Sonnenlicht-zur-Erde-reflektieren-10749257.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-10T08:25:00",
      "content": "Eine US-Firma will 2026 einen Satelliten starten, der als Spiegel Sonnenlicht zur Erde reflektieren soll. Geplant sind tausende mehr. Die Kritik wird lauter.",
      "content_length": 157,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "OpenAI sieht sich im Wettbewerb benachteiligt – EU soll handeln",
      "link": "https://www.heise.de/news/OpenAI-sieht-sich-im-Wettbewerb-benachteiligt-EU-soll-handeln-10749337.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-10T08:08:00",
      "content": "OpenAI wirft Google, Microsoft und Apple potenziell schädigendes Verhalten vor. Die EU-Wettbewerbsbehörden sollen handeln.",
      "content_length": 122,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Potenziell drastische Folgen: China sanktioniert Export weiterer Seltener Erden",
      "link": "https://www.heise.de/news/Potenziell-drastische-Folgen-China-sanktioniert-Export-weiterer-Seltener-Erden-10749203.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-10T05:13:00",
      "content": "Chinas Führung hat drastische Exportkontrollen für die verbleibenden Seltenen Erden angekündigt, die Folgen für die Halbleiterindustrie könnten drastisch sein.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Ivanti Endpoint Manager: Zero Day Initiative veröffentlicht 13 Zero-Days",
      "link": "https://www.heise.de/news/Ivanti-Endpoint-Manager-Zero-Day-Initiative-veroeffentlicht-13-Zero-Days-10749054.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-10T05:00:00",
      "content": "Mehrere Lücken mit hohem Schweregrad klafften monatelang in Ivanti EPM. Das Unternehmen wollte mehr als ein halbes Jahr Frist zu deren Behebung. ",
      "content_length": 145,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Vorsicht Kunde: Bank kassiert trotz Kündigung weiter",
      "link": "https://www.heise.de/news/Vorsicht-Kunde-Bank-kassiert-trotz-Kuendigung-weiter-10711657.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-10T04:00:00",
      "content": "Viele Banken stellen auf Debitkarte um, die alte EC-Karte wird gebührenpflichtig. Für die Karten gelten sehr kurze Kündigungsfristen – die oft ignoriert werden.",
      "content_length": 160,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Weniger Gas im Speicher: Warum Deutschland gelassen bleibt",
      "link": "https://www.heise.de/news/Deutschland-geht-mit-weniger-Gasreserven-in-den-Winter-2025-26-10748707.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-09T14:19:00",
      "content": "Die deutschen Gasspeicher sind deutlich weniger gefüllt als in den Vorjahren. Experten sehen die Versorgungslage dennoch entspannt.",
      "content_length": 131,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Trend Micro Apex One: Fehler verhindert Start ausführbarer Dateien",
      "link": "https://www.heise.de/news/Trend-Micro-Apex-One-Fehler-verhindert-Start-ausfuehrbarer-Dateien-10748428.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-09T11:51:00",
      "content": "Ein fehlerhaftes Apex-One-Update von Trend Micro legt betroffene Endpoints weitgehend lahm. Der Hersteller arbeitet an einer Lösung.",
      "content_length": 132,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "WhatsApp: Beta-Version bringt Nutzernamen-Reservierung",
      "link": "https://www.heise.de/news/WhatsApp-Beta-Version-bringt-Nutzernamen-Reservierung-10747957.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-09T10:11:00",
      "content": "WhatsApp arbeitet an Privatsphärenschutz durch Nutzernamen anstatt Telefonnummern. Eine Beta-Version erlaubt die Nutzernamen-Reservierung.",
      "content_length": 138,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Kaufprämie für Elektroautos kehrt zurück",
      "link": "https://www.heise.de/news/Kaufpraemie-fuer-Elektroautos-kehrt-zurueck-10747888.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-09T07:32:00",
      "content": "Die Bundesregierung hat vor dem Autogipfel im Kanzleramt beschlossen, die Kaufprämie für Elektroautos wieder einzuführen. ",
      "content_length": 122,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Windows 10: Registrierung für Supportverlängerung auf ersten Rechnern möglich",
      "link": "https://www.heise.de/news/Windows-10-Registrierung-fuer-Supportverlaengerung-auf-ersten-Rechnern-moeglich-10742529.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-08T12:00:00",
      "content": "Nach Hinweisen auf eine \"in Kürze\" verfügbare Registrierung zur Supportverlängerung bieten erste Windows-10-Rechner einen Link an.",
      "content_length": 130,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "\"Dann gibt es kein Bier\": Lieferprobleme nach Cyberangriff auf Brauerei in Japan",
      "link": "https://www.heise.de/news/Cyberattacke-auf-Brauereikonzern-Asahi-Japan-geht-das-Bier-aus-10736540.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-08T08:52:00",
      "content": "Die japanische Brauerei Asahi gehört zu den größten der Welt. Nach einer Cyberattacke kam sie mit der Produktion nicht mehr nach. Die Lage soll sich bessern.",
      "content_length": 157,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Dank \"Mein iPhone suchen\": Londoner Polizei gelingt Schlag gegen Handydiebstahl",
      "link": "https://www.heise.de/news/Dank-Mein-iPhone-suchen-Londoner-Polizei-gelingt-Schlag-gegen-Handydiebstahl-10733928.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-08T05:07:00",
      "content": "Londons Polizei hat eine kriminelle Bande ausgehoben, die Zehntausende gestohlene Handys nach China geschmuggelt haben soll. Dort wurden sie teuer verkauft.",
      "content_length": 156,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Spahn: \"Anlasslose Chatkontrolle wird es mit uns nicht geben\"",
      "link": "https://www.heise.de/news/Spahn-Anlasslose-Chatkontrolle-wird-es-mit-uns-nicht-geben-10733716.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-07T18:17:00",
      "content": "Fraktionschef Spahn erteilt der anlasslosen Chatkontrolle für die Union im Bundestag eine Absage. Offenbar soll die Abstimmung im EU-Rat verschoben werden.",
      "content_length": 155,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Markus Haas muss gehen: Telefónica Deutschland sucht neuen CEO",
      "link": "https://www.heise.de/news/Markus-Haas-muss-gehen-Telefonica-Deutschland-sucht-neuen-CEO-10733645.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-07T16:14:00",
      "content": "Telefónica Deutschland löst den Vertrag mit Markus Haas vorzeitig auf und sucht einen neuen CEO. Der Chef des spanischen Mutterkonzerns hat andere Pläne.",
      "content_length": 153,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Das passiert, wenn der KI-Betreiber die Sicherheit vernachlässigt",
      "link": "https://www.heise.de/news/Sensible-Unternehmensdaten-ueber-Sicherheitsprobleme-bei-KI-Firma-kompromittiert-10731728.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-07T13:43:00",
      "content": "Verträge, Rechnungen und weitere sensible Daten erreichten uns via E-Mail. Die Quelle: eine österreichische KI-Firma, die demnach bei der Sicherheit schlampte.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Ab 39 Euro: Qualcomm kauft Arduino und stellt Raspi-Konkurrenten vor",
      "link": "https://www.heise.de/news/Raspi-Konkurrenz-Qualcomm-schluckt-Arduino-und-stellt-Einplatinencomputer-vor-10733137.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-07T13:00:00",
      "content": "Der Einplatinencomputer Arduino Uno Q bekommt einen Qualcomm-Prozessor. Er ermöglicht ähnliche Projekte wie ein Raspberry Pi.",
      "content_length": 125,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Microsoft erschwert Windows-Einrichtung ohne Microsoft-Konto",
      "link": "https://www.heise.de/news/Windows-Insider-Vorschauen-verbauen-Einrichtung-mit-lokalem-Konto-10733102.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-07T12:04:00",
      "content": "Microsoft verbaut die Einrichtung mit lokalem Konto in den jüngsten Windows-Insider-Vorschauen. Es gibt aber auch neue Funktionen.",
      "content_length": 130,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Physiknobelpreis für Wegbereiter des Quantencomputing",
      "link": "https://www.heise.de/news/Physiknobelpreis-fuer-Erfinder-von-Quantenchips-10726274.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-07T10:04:00",
      "content": "Für die Entwicklung von quantenmechanischen Schaltkreisen erhalten drei US-Forscher in diesem Jahr den Nobelpreis für Physik.",
      "content_length": 125,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Microsoft Outlook: Zur Sicherheit keine SVG-Anzeige mehr",
      "link": "https://www.heise.de/news/Microsoft-Outlook-Zur-Sicherheit-keine-SVG-Anzeige-mehr-10729201.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-07T09:52:00",
      "content": "Ein Einfallstor für Malware ist das Vektorgrafikformat SVG. Microsoft zieht dem Format in Outlook daher den Stecker – etwas.",
      "content_length": 124,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Google: KI-Bug-Bounty-Programm zahlt bis zu 30.000 US-Dollar pro Fehler",
      "link": "https://www.heise.de/news/Google-KI-Bug-Bounty-Programm-zahlt-bis-zu-30-000-US-Dollar-pro-Fehler-10727388.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-07T08:58:00",
      "content": "Google führt ein Bug-Bounty-Programm für KI-Anwendungen ein. Entdecker schwerwiegender Fehler in Gemini oder der KI-Suche erhalten Belohnungen.\n",
      "content_length": 144,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Starlink: Schon ein bis zwei Satellitenabstürze pro Tag – bald sind es fünf",
      "link": "https://www.heise.de/news/Satelliteninternet-Schon-ein-bis-zwei-Abstuerze-von-Starlink-Satelliten-pro-Tag-10726535.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-07T08:38:00",
      "content": "Fast 10.000 Starlink-Satelliten sind im Erdorbit, täglich stürzen ein bis zwei davon ab und mehr wird erwartet. Das könnte etwa die Ozonschicht beeinflussen.",
      "content_length": 157,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Salesforce-Datenklau: Cybergangs erpressen namhafte Unternehmen auf Leaksite",
      "link": "https://www.heise.de/news/Salesforce-Datenklau-Cybergangs-erpressen-namhafte-Unternehmen-auf-Leaksite-10726346.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-07T08:18:00",
      "content": "Cyberkriminelle erpressen auf einer Leaksite im Darknet 39 namhafte Unternehmen. Deren Daten haben sie aus Salesforce kopiert.",
      "content_length": 126,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Staatsfonds beteiligt? DLC für \"Assassin's Creed Mirage\" spielt in Saudi-Arabien",
      "link": "https://www.heise.de/news/Staatsfonds-beteiligt-DLC-fuer-Assassin-s-Creed-Mirage-spielt-in-Saudi-Arabien-10726248.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-07T06:44:00",
      "content": "Zwei Jahre nach dem Release bekommt \"Assassin's Creed Mirage\" einen neuen, kostenlosen DLC. \"Valley of Memory\" spielt in Saudi-Arabien. ",
      "content_length": 136,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Schlappe vorm Supreme Court: Google muss Änderungen am Play Store vorbereiten",
      "link": "https://www.heise.de/news/Schlappe-vorm-Supreme-Court-Google-muss-Aenderungen-am-Play-Store-vorbereiten-10726156.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-07T04:59:00",
      "content": "Vor zwei Jahren wurde Google zu umfangreichen Änderungen am Play Store von Android verpflichtet. Im Versuch, das zu verhindern, gab es nun wieder eine Schlappe.",
      "content_length": 160,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Raspberry Pi OS wechselt auf Debian-Trixie-Basis",
      "link": "https://www.heise.de/news/Raspberry-Pi-OS-wechselt-auf-Debian-Trixie-Basis-10722458.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-06T12:58:00",
      "content": "Raspberry Pi OS basiert auf Debian. Jetzt wechselt auch das Einplatinencomputer-Betriebssystem auf den Trixie-Stand.",
      "content_length": 116,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Viertelstundentakt bei Strombörse gestartet",
      "link": "https://www.heise.de/news/Viertelstundentakt-bei-Stromboerse-gestartet-10721514.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-06T11:59:00",
      "content": "Wie zuletzt angekündigt arbeitet der Stromhandel seit Monatsanfang im 15-Minuten-Takt. Erneuerbare Energien erreichen neue Schwellwerte.",
      "content_length": 136,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Spiele-Engine Unity: Lücke bedroht Android, Linux, macOS und Windows",
      "link": "https://www.heise.de/news/Spiele-Engine-Unity-Luecke-bedroht-Android-Linux-macOS-und-Windows-10713427.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-06T08:13:00",
      "content": "Unity steckt in zahlreichen populären Spielen für Mobilgeräte und Desktop. Eine gravierende Lücke ermöglicht Angreifern, Schadcode auszuführen.",
      "content_length": 143,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Sechs Milliarden Tonnen pro Sekunde: Rekordwachstum eines Planeten beobachtet",
      "link": "https://www.heise.de/news/Sechs-Milliarden-Tonnen-pro-Sekunde-Rekordwachstum-eines-Planeten-beobachtet-10700487.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-02T12:00:00",
      "content": "Ein 620 Lichtjahre von uns entfernter einsamer Planet verhält sich in vielerlei Hinsicht wie ein Stern. Unter anderem wächst er teilweise beispiellos schnell.",
      "content_length": 158,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Ohne Erklärung: Internet in Afghanistan nach 48 Stunden wieder verfügbar",
      "link": "https://www.heise.de/news/Ohne-Erklaerung-Internet-in-Afghanistan-nach-48-Stunden-wieder-verfuegbar-10699605.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-02T04:48:00",
      "content": "Ziemlich genau 48 Stunden lang war Afghanistan komplett vom Internet abgeschnitten. Ohne den weitreichenden Schritt zu erklären, haben die Taliban ihn beendet.",
      "content_length": 159,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Ursache unbekannt: Durch die Milchstraße läuft eine gigantische Welle",
      "link": "https://www.heise.de/news/Ursache-unbekannt-Durch-die-Milchstrasse-laeuft-eine-gigantische-Welle-10690112.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-10-01T08:57:00",
      "content": "Unzählige Sterne in der Milchstraße werden durch eine gigantische Welle angehoben und gesenkt. Das wurde anhand von Daten des Weltraumteleskops Gaia entdeckt.",
      "content_length": 158,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Developer Snapshots: Kleinere News der Woche",
      "link": "https://www.heise.de/news/Developer-Snapshots-Kleinere-News-der-Woche-10815349.html",
      "published": "2025-10-25T07:34:00",
      "content": "Die Übersicht enthält kleine, aber interessante Meldungen zu Grafana Tempo, Visual Studio 2026, Accessibility, GitHub, Valkey, PyTorch, Slint und Django.",
      "content_length": 153,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "DeepSeek-OCR: Bilder vereinfachen Texte für große Sprachmodelle",
      "link": "https://www.heise.de/hintergrund/DeepSeek-OCR-Bilder-vereinfachen-Texte-fuer-grosse-Sprachmodelle-10845788.html",
      "published": "2025-10-24T08:47:00",
      "content": "DeepSeek experimentiert mit einem OCR-Modell und zeigt, dass komprimierte Bilder für Berechnungen auf GPUs speicherfreundlicher sind als viele Text-Token.",
      "content_length": 154,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Projektmanagement: Wir sind eine große Familie",
      "link": "https://www.heise.de/blog/Projektmanagement-Wir-sind-eine-grosse-Familie-9871007.html",
      "published": "2025-10-24T08:17:00",
      "content": "Wenn der Vorgesetzte darauf hinweist, dass &quot;wir eine große Familie sind&quot;, geht es meist nicht um ein bevorstehendes Fest.",
      "content_length": 131,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": ".NET: Ein Herz und Sponsoring für NuGet-Maintainer",
      "link": "https://www.heise.de/news/NET-Ein-Herz-und-Sponsoring-fuer-NuGet-Maintainer-10846299.html",
      "published": "2025-10-24T07:57:00",
      "content": "NuGet-Package-Maintainer können nun finanzielle Unterstützung durch ihre User erhalten, indem sie Sponsorship-URLs zu ihren Paketen hinzufügen.",
      "content_length": 143,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Aus Softwarefehlern lernen – Teil 5: 440 Millionen Dollar Verlust in Minuten",
      "link": "https://www.heise.de/hintergrund/Aus-Softwarefehlern-lernen-Teil-5-440-Millionen-Dollar-Verlust-in-Minuten-10748532.html",
      "published": "2025-10-24T07:05:00",
      "content": "Ein vergessenes Feature Flag sorgt für einen Fehlkauf an der Börse – IT-Pannen wiederholen sich nach immer gleichen Mustern. Aber wir können daraus lernen.",
      "content_length": 155,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Britisches Urteil: Apple hat App-Käufer abgezockt",
      "link": "https://www.heise.de/news/Niederlage-fuer-Apple-in-London-App-Gebuehren-viel-zu-hoch-10837104.html",
      "published": "2025-10-23T19:53:00",
      "content": "Die Gebühren in Apples App Store sind viel zu hoch, sagt ein Gericht in London. Apple soll hunderte Millionen zurückgeben. Auch App-Anbieter dürfen hoffen.",
      "content_length": 155,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "AWS: CloudWatch generiert jetzt automatisch Incident-Reports",
      "link": "https://www.heise.de/news/AWS-CloudWatch-generiert-jetzt-automatisch-Incident-Reports-10819046.html",
      "published": "2025-10-23T12:34:00",
      "content": "Amazon hat CloudWatch um automatische Incident-Report-Generierung erweitert. Das soll nur wenigen Minuten dauern – was beim eigenen Ausfall aber nicht klappte.",
      "content_length": 159,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "software-architektur.tv: Experiencing Generative AI mit Oliver Zeigermann",
      "link": "https://www.heise.de/news/software-architektur-tv-Experiencing-Generative-AI-mit-Oliver-Zeigermann-10811070.html",
      "published": "2025-10-23T09:35:00",
      "content": "Anhand einer Demo-Applikation sprechen Oliver Zeigermann und Lisa Maria Schäfer über das Thema generative KI.",
      "content_length": 109,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "JavaScript: Testing-Framework Vitest 4.0 bringt visuelles Regressionstesting",
      "link": "https://www.heise.de/news/JavaScript-Testing-Framework-Vitest-4-0-bringt-visuelles-Regressionstesting-10811238.html",
      "published": "2025-10-23T09:08:00",
      "content": "Im Major Release ist der Browser Mode stabil, der neuerdings Visual Regression Testing bietet, um optische Änderungen aufzudecken.",
      "content_length": 130,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "OpenWrt: Updates schließen Sicherheitslücken in Router-Betriebssystem",
      "link": "https://www.heise.de/news/OpenWRT-Updates-schliessen-Sicherheitsluecken-in-Router-Betriebssystem-10811056.html",
      "published": "2025-10-23T06:24:00",
      "content": "Zwei als hochriskant geltende Sicherheitslücken haben die Entwickler des quelloffenen Router-Betriebssystems OpenWrt geschlossen.",
      "content_length": 129,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Schwachstelle in Rust-Library für tar-Archive entdeckt",
      "link": "https://www.heise.de/news/Schwachstelle-in-Rust-Library-fuer-tar-Archive-entdeckt-10793899.html",
      "published": "2025-10-22T08:51:00",
      "content": "Die Library async-tar und ihre Forks enthalten eine als TARmageddon benannte Schwachstelle. Der am weitesten verbreitete Fork tokio-tar bekommt keinen Patch.",
      "content_length": 157,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "React-Framework Next.js 16 macht Turbopack zum Standard-Bundler",
      "link": "https://www.heise.de/news/React-Framework-Next-js-16-macht-Turbopack-zum-Standard-Bundler-10794045.html",
      "published": "2025-10-22T08:16:00",
      "content": "Turbopack und der Support für den React Compiler sind nun stabil. Das Caching soll durch die neuen Cache Components flexibler werden.",
      "content_length": 133,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Eventarchitektur für die JVM: OpenCQRS 1.0 ist erschienen",
      "link": "https://www.heise.de/blog/Eventarchitektur-fuer-die-JVM-OpenCQRS-1-0-ist-erschienen-10778433.html",
      "published": "2025-10-22T06:27:00",
      "content": "OpenCQRS bringt Event Sourcing auf die JVM – mit nativer EventSourcingDB-Integration, Spring-Boot-Support und produktionsreifem Tooling.",
      "content_length": 136,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "BentoPDF 1.0: Neues Open-Source-PDF-Werkzeug fürs Self-Hosting",
      "link": "https://www.heise.de/news/BentoPDF-1-0-0-Open-Source-PDF-Tool-mit-Privacy-Fokus-erschienen-10793109.html",
      "published": "2025-10-21T12:49:00",
      "content": "Das neue Open-Source-Tool BentoPDF erscheint in Version 1.0 mit umfangreichen PDF-Funktionen, Docker-Integration und Fokus auf lokale Datenverarbeitung.",
      "content_length": 152,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Browser-Engine Servo veröffentlicht erstes offizielle Release 0.0.1",
      "link": "https://www.heise.de/news/Browser-Engine-Servo-veroeffentlicht-erstes-offizielle-Release-0-0-1-10789486.html",
      "published": "2025-10-21T09:21:00",
      "content": "Mit dem ersten offiziellen Release gibt es Servo erstmals für ARM-Macs. Trotz des Meilensteins ist die Browser-Engine noch nicht bereit für Endanwender.",
      "content_length": 152,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Software Testing: Praxisnahes Softwaretesten mit Java",
      "link": "https://www.heise.de/blog/Software-Testing-Praxisnahes-Softwaretesten-mit-Java-10789378.html",
      "published": "2025-10-21T08:26:00",
      "content": "In dieser Episode des Podcasts sprechen Richard Seidl und Pascal Moll über den Einstieg ins Softwaretesten in der Java-Welt.",
      "content_length": 124,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Gefährlicher und unsichtbarer Wurm in Visual Studio Code Extensions gefunden",
      "link": "https://www.heise.de/news/Gefaehrlicher-und-unsichtbarer-Wurm-in-Visual-Studio-Code-Extensions-gefunden-10789320.html",
      "published": "2025-10-21T08:14:00",
      "content": "Eine Schadsoftware, die Credentials und Kryptowährungen abgreift, nutzt Unicode für unsichtbaren Code und installiert einen Remote-Access-Trojaner.",
      "content_length": 147,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Apple: KI-Modell erkennt Softwarefehler mit 98 Prozent Genauigkeit",
      "link": "https://www.heise.de/news/Apple-KI-Modell-erkennt-Softwarefehler-mit-98-Prozent-Genauigkeit-10787217.html",
      "published": "2025-10-20T15:13:00",
      "content": "Apple Research präsentiert ADE-QVAET, ein KI-Modell zur Vorhersage von Softwarefehlern mit 98 Prozent Genauigkeit bei Tests.",
      "content_length": 124,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Interview: \"Open Source allein ist nicht die Lösung\"",
      "link": "https://www.heise.de/hintergrund/Interview-Open-Source-allein-ist-nicht-die-Loesung-10785682.html",
      "published": "2025-10-20T15:08:00",
      "content": "Warum der Vorstand des Bundesverbands IT-Mittelstand, Oliver Grün, es für falsch hält, wenn die öffentliche Hand nur noch Open Source vorschreibt.",
      "content_length": 146,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Die Produktwerker: Produktstrategie, OKRs und Discovery sinnvoll kombinieren",
      "link": "https://www.heise.de/blog/Die-Produktwerker-Produktstrategie-OKRs-und-Discovery-sinnvoll-kombinieren-10778969.html",
      "published": "2025-10-20T08:48:00",
      "content": "Diese Podcastfolge dreht sich darum, wie Product Owner Produktstrategie, OKRs und Discovery sinnvoll miteinander verbinden können.",
      "content_length": 130,
      "source": "Heise Developer",
      "category": "Tech News"
    }
  ],
  "stats": {
    "by_category": {
      "German News": 126,
      "International News": 69,
      "Tech News": 110
    },
    "by_source": {
      "Tagesschau": 40,
      "Tagesschau Ausland": 64,
      "Deutschlandfunk": 22,
      "The Guardian World": 45,
      "France 24 English": 24,
      "Ars Technica": 20,
      "The Verge": 10,
      "Heise Top": 60,
      "Heise Developer": 20
    }
  }
}