{
  "metadata": {
    "timestamp": "2025-11-29T07:12:22.244893",
    "deduplicated_at": "2025-11-29 07:12:22",
    "lookback_days": 7,
    "total_input": 1089,
    "duplicates_removed": 973,
    "new_articles": 116,
    "deduplication_rate": "89.3%",
    "historical_files_checked": 6
  },
  "articles": [
    {
      "title": "UK MPs push for extra aid and visas as Jamaica reels from Hurricane Melissa",
      "link": "https://www.theguardian.com/world/2025/nov/29/uk-mps-extra-aid-humanitarian-visas-jamaica-hurricane-melissa-dawn-butler",
      "published": "2025-11-29T07:00:31",
      "content": "Dawn Butler leads calls for humanitarian visas and fee waivers for vulnerable relatives of UK nationals affected by stormBritish MPs have joined campaigners calling for more aid and humanitarian visas for Jamaicans to enter the UK after Hurricane Melissa demolished parts of the country, plunging hundreds of thousands of people into a humanitarian crisis.The UK has pledged £7.5m emergency funds to Jamaica and other islands affected by the hurricane, but many argue that the country has a moral obligation to do more for former Caribbean colonies. Continue reading...",
      "content_length": 569,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Gießen - Proteste gegen Gründung von neuer AfD-Jugendorganisation",
      "link": "https://www.deutschlandfunk.de/proteste-gegen-gruendung-von-neuer-afd-jugendorganisation-100.html",
      "published": "2025-11-29T07:00:22",
      "content": "In Gießen hat es wegen der dort erwarteten Gründung einer neuen AfD-Jugendorganisation erste Protestaktionen gegeben. Wie ein Polizeisprecher mitteilte, gibt es Blockaden von Autobahnen, Bundes- und Landesstraßen. Die Zufahrt in das Stadtzentrum sei stark beeinträchtigt.",
      "content_length": 271,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "AfD - Soziologe Nachtwey erwartet weitere Debatten über \"Brandmauer\"",
      "link": "https://www.deutschlandfunk.de/soziologe-nachtwey-erwartet-weitere-debatten-ueber-brandmauer-102.html",
      "published": "2025-11-29T07:00:22",
      "content": "Der Soziologe Nachtwey erwartet, dass das Kooperationsverbot der Union mit der AfD weiter infrage gestellt wird, sollten für die CDU die Landtagswahlen in Sachsen-Anhalt und Mecklenburg-Vorpommern im kommenden Jahr verloren gehen.",
      "content_length": 230,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Russische Invasion - Orban sieht Ukraine nach Kriegsende als \"Pufferstaat\"",
      "link": "https://www.deutschlandfunk.de/orban-sieht-ukraine-nach-kriegsende-als-pufferstaat-102.html",
      "published": "2025-11-29T07:00:22",
      "content": "Die Ukraine sollte aus Sicht des ungarischen Ministerpräsidenten Orban nach einem Ende des Krieges als eine Art \"Pufferstaat\" zwischen Russland und der NATO fungieren. Das sei die einzige mögliche dauerhafte Lösung, sagte Orban der \"Welt am Sonntag\".",
      "content_length": 250,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "USA - Trump kündigt Aufhebung fast aller Dekrete Bidens an",
      "link": "https://www.deutschlandfunk.de/trump-kuendigt-aufhebung-fast-aller-dekrete-bidens-an-100.html",
      "published": "2025-11-29T07:00:22",
      "content": "US-Präsident Trump hat angekündigt, dass er die meisten Dekrete seines Amtsvorgängers Biden widerruft. Zur Begründung hieß es, fast alle seien mit einer mechanischen Signaturhilfe unterzeichnet worden. Um welche Dekrete es konkret geht, blieb zunächst offen.",
      "content_length": 258,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Medienbericht - Spekulationen über mögliches Treffen nach Telefonat zwischen Trump und Maduro",
      "link": "https://www.deutschlandfunk.de/spekulationen-ueber-moegliches-treffen-nach-telefonat-zwischen-trump-und-maduro-104.html",
      "published": "2025-11-29T07:00:22",
      "content": "Inmitten wachsender Spannungen zwischen den USA und Venezuela hat es nach Informationen der \"New York Times\" ein Telefonat zwischen Präsident Trump und Staatschef Maduro gegeben.",
      "content_length": 178,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Hongkong - Acht weitere Festnahmen nach Hochhaus-Großbrand",
      "link": "https://www.deutschlandfunk.de/acht-weitere-festnahmen-nach-hochhaus-grossbrand-102.html",
      "published": "2025-11-29T07:00:22",
      "content": "In Hongkong sind nach dem verheerenden Großbrand in einem Hochhaus-Komplex acht weitere Personen festgenommen worden.",
      "content_length": 117,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Menschenrechtsorganisation - Russland verbietet Human Rights Watch",
      "link": "https://www.deutschlandfunk.de/russland-verbietet-human-rights-watch-112.html",
      "published": "2025-11-29T07:00:22",
      "content": "Russland hat die Menschenrechtsorganisation Human Rights Watch als sogenannte unerwünschte Organisation verboten.",
      "content_length": 113,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Gießen - AfD gründet heute neue Parteijugend - was ist geplant?",
      "link": "https://www.deutschlandfunk.de/afd-gruendet-heute-neue-parteijugend-was-ist-geplant-100.html",
      "published": "2025-11-29T07:00:22",
      "content": "Gießen rüstet sich für einen Polizeigroßeinsatz: Die AfD will heute in der mittelhessischen Universitätsstadt eine neue Nachwuchsorganisation gründen. Es wird mit rund 50.000 Gegendemonstranten gerechnet. Hier ein Überblick darüber, worum es bei dem AfD-Treffen konkret geht.",
      "content_length": 275,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Klimapolitik - SPD-Europa-Abgeordneter Wölken kritisiert deutsche Änderungsvorschläge zum Verbrenner-Aus",
      "link": "https://www.deutschlandfunk.de/spd-europa-abgeordneter-woelken-kritisiert-deutsche-aenderungsvorschlaege-zum-verbrenner-aus-102.html",
      "published": "2025-11-29T07:00:22",
      "content": "Der SPD-Europaabgeordnete Wölken hat die deutschen Änderungsvorschläge zum europäischen Verbrenner-Aus kritisiert. Wölken sagte im Deutschlandfunk, dass die Bundesregierung ganz massiv auf traditionelle Biokraftstoffe und hocheffiziente Verbrennerautos setze, helfe dem Klima nicht und sei kontraproduktiv. So müsse man für Biokraftstoffe viel Ackerfläche bereitstellen, die eigentlich für die Ernährung vorgesehen sei.",
      "content_length": 419,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Bundesparteitag in Hannover - Grüne lehnen Homöopathie als Kassenleistung ab",
      "link": "https://www.deutschlandfunk.de/gruene-lehnen-homoeopathie-als-kassenleistung-ab-108.html",
      "published": "2025-11-29T07:00:22",
      "content": "In Hannover setzen die Grünen heute ihren Bundesparteitag fort.",
      "content_length": 63,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Luftfahrt - Airbus muss bei Tausenden Flugzeugen Software nachbessern",
      "link": "https://www.deutschlandfunk.de/airbus-muss-bei-tausenden-flugzeugen-software-nachbessern-120.html",
      "published": "2025-11-29T07:00:22",
      "content": "Der Flugzeughersteller Airbus hat über Softwareprobleme bei Tausenden Maschinen seiner A320-Familie informiert.",
      "content_length": 111,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Vor Präsidentenwahl in Honduras - Trump will in USA inhaftierten Ex-Staatschef Hernández begnadigen - erneute Einmischung in Wahlkampf",
      "link": "https://www.deutschlandfunk.de/trump-will-in-usa-inhaftierten-ex-staatschef-hern-ndez-begnadigen-erneute-einmischung-in-wahlkampf-100.html",
      "published": "2025-11-29T07:00:22",
      "content": "US-Präsident Trump hat angekündigt, den in den Vereinigten Staaten inhaftierten Ex-Staatschef von Honduras, Hernández, zu begnadigen.",
      "content_length": 133,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Krieg gegen die Ukraine - Kiew meldet erneut russische Angriffe",
      "link": "https://www.deutschlandfunk.de/kiew-meldet-erneut-russische-angriffe-100.html",
      "published": "2025-11-29T07:00:22",
      "content": "Die ukrainische Hauptstadt Kiew meldet einen weiteren nächtlichen Angriff der russischen Invasoren.",
      "content_length": 99,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Fußball-Bundesliga - Mönchengladbach - Leipzig: 0:0",
      "link": "https://www.deutschlandfunk.de/moenchengladbach-leipzig-0-104.html",
      "published": "2025-11-29T07:00:22",
      "content": "Im Freitagsspiel der Fußball-Bundesliga haben Borussia Mönchengladbach und RB Leipzig 0:0 gespielt.",
      "content_length": 99,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Nations-League-Final-Hinspiel - DFB-Frauen spielen 0:0 gegen Spanien",
      "link": "https://www.deutschlandfunk.de/dfb-frauen-spielen-0-0-gegen-spanien-104.html",
      "published": "2025-11-29T07:00:22",
      "content": "Das deutsche Fußball-Nationalteam der Frauen hat in der ersten Finalpartie der Nations League unentschieden gespielt.",
      "content_length": 117,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Nach Durchsuchung - Leiter des ukrainischen Präsidialamtes Jermak zurückgetreten",
      "link": "https://www.deutschlandfunk.de/leiter-des-ukrainischen-praesidialamtes-jermak-zurueckgetreten-114.html",
      "published": "2025-11-29T07:00:22",
      "content": "In der Ukraine ist der Chef des Präsidialamtes, Jermak, zurückgetreten. Das gab Präsident Selenskyj bekannt. Jermak gilt als enger Vertrauter Selenskyjs.Die ukrainische Anti-Korruptions-Behörde hatte gestern seine Wohnung durchsucht.",
      "content_length": 233,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Energie - Kanada will Ölpipeline zum Pazifik bauen - mehr Unabhängigkeit von USA",
      "link": "https://www.deutschlandfunk.de/kanada-will-oelpipeline-zum-pazifik-bauen-mehr-unabhaengigkeit-von-usa-110.html",
      "published": "2025-11-29T07:00:22",
      "content": "In Kanada hat Premier Carney eine Absichtserklärung für den Bau einer mehr als 1.000 Kilometer langen Ölpipeline unterzeichnet.",
      "content_length": 127,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Berlin - Wadephul sagt Türkei neuen Anlauf für EU-Beitritt zu",
      "link": "https://www.deutschlandfunk.de/wadephul-sagt-tuerkei-neuen-anlauf-fuer-eu-beitritt-zu-106.html",
      "published": "2025-11-29T07:00:22",
      "content": "Bundesaußenminister Wadephul hat der Türkei einen neuen Anlauf zum Beitritt in die Europäische Union in Aussicht gestellt. Es sei an der Zeit, ein neues Kapitel aufzuschlagen, sagte der CDU-Politiker bei einer gemeinsamen Pressekonferenz mit dem türkischen Außenminister Fidan in Berlin.",
      "content_length": 287,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "\"Artemis\"-Missionen - Deutscher Astronaut Gerst will \"selbstverständlich\" auf den Mond",
      "link": "https://www.deutschlandfunk.de/deutscher-astronaut-gerst-will-selbstverstaendlich-auf-den-mond-106.html",
      "published": "2025-11-29T07:00:22",
      "content": "Er wird vielleicht der erste Deutsche auf dem Mond: Der Astronaut Alexander Gerst wurde von der Europäischen Weltraumorganisation ESA neben seinem Kollegen Matthias Maurer als Kandidat genannt, um in einigen Jahren in Richtung Mond zu fliegen. Gerst zeigte sich erfreut über die Entscheidung.",
      "content_length": 292,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Rente, Verbrenner-Aus, E-Auto-Förderung - Worauf sich CDU, CSU und SPD im Koalitionsausschuss geeinigt haben",
      "link": "https://www.deutschlandfunk.de/worauf-sich-cdu-csu-und-spd-im-koalitionsausschuss-geeinigt-haben-102.html",
      "published": "2025-11-29T07:00:22",
      "content": "Der Koalitionsausschuss will nach Angaben von Bundeskanzler Merz trotz der Kritik aus der Jungen Gruppe der Union an den bisherigen Rentenplänen festhalten. Außerdem gibt es Einigungen zum geplanten Verbenner-Aus und der Förderung von E-Autos. Ein Überblick.",
      "content_length": 258,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Von \"guter Kompromissansatz\" bis \"schwerer Fehler\" - Gemischte Reaktionen auf Rentenbeschluss",
      "link": "https://www.deutschlandfunk.de/gemischte-reaktionen-auf-rentenbeschluss-102.html",
      "published": "2025-11-29T07:00:22",
      "content": "Die Einigung zu den Rentenplänen im Koalitionsausschuss stößt bei Politik und Wirtschaft auf gemischte Reaktionen. Der hessische Ministerpräsident Rhein sprach von einem guten Kompromissansatz für einen Generationenfrieden zwischen Jung und Alt. Von Ökonomen gibt es Gegenwind.",
      "content_length": 277,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Medien - ARD konkretisiert Aus für Radiowellen",
      "link": "https://www.deutschlandfunk.de/ard-konkretisiert-aus-fuer-radiowellen-112.html",
      "published": "2025-11-29T07:00:22",
      "content": "Die ARD-Intendanten haben einen Überblick über die Radiowellen gegeben, die im Zuge des neuen Reformstaatsvertrags wegfallen sollen.",
      "content_length": 132,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Militärischer Abschirmdienst - Rekordzahl an Drohnen über Bundeswehr-Basen",
      "link": "https://www.deutschlandfunk.de/rekordzahl-an-drohnen-ueber-bundeswehr-basen-106.html",
      "published": "2025-11-29T07:00:22",
      "content": "In Deutschland wurde im vergangenen Monat die bislang höchste Zahl an Drohnensichtungen über Einrichtungen der Bundeswehr verzeichnet.",
      "content_length": 134,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Stuttgart - Deutsche Handballerinnen gewinnen bei der WM gegen Uruguay",
      "link": "https://www.deutschlandfunk.de/deutsche-handballerinnen-gewinnen-bei-der-wm-gegen-uruguay-110.html",
      "published": "2025-11-29T07:00:22",
      "content": "Die deutschen Handballerinnen haben bei der Weltmeisterschaft im eigenen Land vorzeitig die Hauptrunde erreicht. Das Team von Bundestrainer Markus Gaugisch setzte sich im zweiten Vorrundenspiel der Gruppe C gegen Außenseiter Uruguay mit 38:12 durch. Zum Auftakt hatte es ein 32:25 gegen Island gegeben. ",
      "content_length": 303,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Hochwasser - Mehr als 140 Todesopfer nach Unwetter in Thailand",
      "link": "https://www.deutschlandfunk.de/mehr-als-140-todesopfer-nach-unwetter-in-thailand-106.html",
      "published": "2025-11-29T07:00:22",
      "content": "In Thailand ist die Zahl der Todesopfer nach schweren Überschwemmungen auf mindestens 145 gestiegen.",
      "content_length": 100,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Lateinamerika - Weiterer peruanischer Ex-Präsident zu Gefängnisstrafe verurteilt",
      "link": "https://www.deutschlandfunk.de/weiterer-peruanischer-ex-praesident-zu-gefaengnisstrafe-verurteilt-102.html",
      "published": "2025-11-29T07:00:22",
      "content": "In Peru ist ein weiterer ehemaliger Präsident zu einer Gefängnisstrafe verurteilt worden.",
      "content_length": 89,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Wetter - Teils Regen, im Südosten bei Frost Glatteisgefahr",
      "link": "https://www.deutschlandfunk.de/teils-regen-im-suedosten-bei-frost-glatteisgefahr-100.html",
      "published": "2025-11-29T07:00:22",
      "content": "Das Wetter:",
      "content_length": 11,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "The best Black Friday deals you can still get on AirTags, iPad, and other Apple gear",
      "link": "https://www.theverge.com/gadgets/827826/best-black-friday-apple-deals-sale-2025",
      "published": "2025-11-29T06:59:12",
      "content": "\n\n\n\t\n\tApple’s latest AirPods Pro are down to their best price to date.\t\n\nIf you’re planning to gift an Apple device this holiday season — or treat yourself — now’s the time to start shopping.&nbsp;Black Friday has officially arrived, bringing with it the best Apple deals we’ve seen all year.\n\nDespite having recently launched, for instance, the new AirPods Pro, Apple Watch Series 11, and new M5-powered MacBook Pro are all down to record low prices for the holiday. Last-gen models are also cheaper than ever right now, with the second-gen AirPods Pro now priced close to the AirPods 4 with active noise cancellation — a welcome surprise, given that the last-gen Pro offer superior ANC performance by comparison.\n\nThere’s a whole lot more on sale, and to sift through discounts more easily, we’ve rounded them up by category. We’ve even sprinkled in some historical price info, so you can spot the best deals at a glance.\n\n\n\n\n\n\n\n\nEarbud and headphone dealsApple Watch dealsiPad dealsMacBook dealsAirTags, chargers, and other deals\n\n\nEarbud and headphone deals\nAirPods Pro 3\nThe recently released AirPods Pro 3 have a new design that improves their fit, superior noise cancellation, better bass, and fairly accurate heart rate sensors. Read our review.\n\nWhere to Buy: $249 $219.99 at Amazon $249.99 $219.99 at Best Buy $249 $219.99 at TargetAirPods 4\nApple’s AirPods 4 are the latest update to the company’s base-model wireless earbuds. The hard, plastic buds feature improved audio over the third-gen model, along with deep iOS integration and spatial audio with head tracking. Read our review.\n\nWhere to Buy: $129 $69 at Amazon $129 $69 at WalmartAirPods 4 with Active Noise Cancellation (ANC)\nThe fancier version of the new AirPods 4 offer support for active noise cancellation, a wireless charging case that can use either Qi or Apple Watch pads, and a speaker in the case that chirps to help you find them. Read our review.\n\nWhere to Buy: $179 $109 at Amazon $179 $139.99 at Walmart $179.99 $139.99 at Best Buy\n\nIf you’re looking for the step-up AirPods 4 with ANC, you can buy them for around $109.99 $99.99 ($30 off) at Amazon and Target. Their noise cancellation performance doesn’t quite match the current- or even last-gen AirPods Pro, but it’s still impressive for the price. In addition to ANC, you also get other features not found on the base-model AirPods 4, including wireless charging, a handy transparency mode, and Find My support for the included charging case. Read our review.\n\n\n\nThe updated&nbsp;AirPods Max&nbsp;with USB-C are down to $399.99 ($140 off) at Amazon&nbsp;and&nbsp;Best Buy, which is their best price to date. The over-ear headphones offer a luxurious stainless steel and aluminum design that’s exceptionally comfortable, while delivering rich sound quality with lossless audio support and a surprisingly natural-sounding transparency mode. Read our original review.\n\nBeats Powerbeats Pro 2\nThe latest Powerbeats Pro are a no-brainer for athletes. They pack fantastic sound and thumping bass, along with active noise cancellation, IPX4 water resistance, and heart rate monitoring. Read our review.\n\nWhere to Buy: $249 $199.95 at Walmart $249 $199.95 at Amazon $249 $199.99 at Best BuyBeats Studio Pro\nThe latest Beats Studio Pro feature improved noise cancellation, sound quality, and comfort. They also support lossless audio over USB-C, making them the first Apple headphones to do so. Read our review.\n\nWhere to Buy: $349.99 $169.95 at Amazon $349.99 $169.95 at Walmart $349.99 $169.99 at Best BuyApple EarPods (USB-C)\nApple’s wired earbuds are comfortable, offer great microphone quality for the price, and feature a built-in remote for controlling audio playback.\n\nWhere to Buy: $19.99 $16.99 at Amazon $19.99 at Best Buy\nApple Watch deals\nApple Watch Series 11 (42mm, GPS)\nAlthough the Apple Watch Series 11 is the same size as its predecessor, it features a 5G cellular modem, a display that’s twice as durable, and slightly improved battery life. Read our review.\n\nWhere to Buy: $399 $339 at Amazon $399 $339 at Walmart $399 $339 at Best BuyApple Watch SE 3\nThe Apple Watch SE 3 offers some big upgrades over its predecessor, including an always-on display, allowing you to glance at the time or unread notifications. It also has Apple’s powerful S10 chip, which enables on-device Siri requests. Read our review.\n\nWhere to Buy: $249 $199 at Amazon (40mm, GPS) $279 $229 at Amazon (44mm, GPS) $249 $199 at Costco (40mm, GPS)\n\nThe 42mm Apple Watch Series 10 with GPS is on sale at Walmart starting at $249 ($150 off), which is its best price to date. While the Series 11 offers slightly longer battery life, a more efficient 5G modem, and a more scratch-resistant display, the Series 10 remains an excellent smartwatch. It features a large, wide-angle OLED display and the same S10 SiP chip found in the Series 11. It also supports FDA-cleared sleep apnea detection and offers the same hypertension notifications, courtesy of the recent watchOS 26 update. Read our review.\n\n\n\nYou can currently pick up the 40mm Apple Watch SE (second-gen) with GPS at Walmart starting at $129 ($120 off), which is a new low price (the 44mm variant is also on sale starting at $159). If you’re on a tight budget, the last-gen Apple Watch SE is still worth considering. It lacks some of Apple’s newer sensors and doesn’t offer an always-on display, but it remains relatively fast, given that it uses the same chipset as the Apple Watch Series 8. It also provides all the essentials, including daily activity and sleep tracking, heart-rate monitoring, fall and crash detection, and access to the newer Vitals app in watchOS 26.\n\nApple Watch Ultra 2\nThe rugged Apple Watch Ultra 2 comes in one size: 49mm. It offers a large, bright display along with long battery life and excellent performance. It sports Apple’s last-gen S9 SiP, too, allowing you to take advantage of Apple’s double tap feature. Read our review.\n\nWhere to Buy: $799 $599 at Amazon (with Alpine Loop) $799 $599 at Amazon (with Trail Loop) $799 $599 at Amazon (with Ocean Band) \n\nYou can also buy the newfangled Apple Watch Ultra 3 at Amazon with either an Ocean Band, a Trail Loop, or an Alpine Loop for $779.99 ($20 off), which is a far cry from its all-time low of $699.99 but still one of the first discounts we’ve seen. Apple’s latest wearable is its most rugged and capable to date, with a larger wide-angle OLED display, satellite and 5G connectivity, and a battery that can last up to 42 hours on a single charge (up from 36 hours on the Ultra 2). Read our review.\n\n\niPad deals\niPad (2025)\nApple’s entry-level iPad is an excellent tablet for casual use. Its high resolution screen is great for watching video, and its A16 processor is fast enough to handle light games and productivity apps. Read our review.\n\nWhere to Buy: $349 $274 at Amazon (128GB, Wi-Fi) $449 $374 at Amazon (256GB, Wi-Fi) $649 $579 at Amazon (512GB, Wi-Fi)\n\nThe 11-inch M5 iPad Pro is down to its best price to date at Amazon, where you can buy it starting at $899 with Wi-Fi and 256GB of storage. Other configurations, specifically the 512GB and 1TB models, are on sale for $1,099 ($100 off) and $1,482 ($117 off), respectively. In addition to offering faster performance than their predecessor, the new Pros support Wi-Fi 7, faster charging, and start with 12GB of RAM. They also come with an N1 chip for Wi-Fi, Bluetooth, and Thread, and if you get the cellular version, Apple’s new C1X cellular modem. Read our review.\n\n\n\nThe latest 13-inch iPad Pro is also on sale at Amazon in its 256GB base configuration for $1,199 ($100 off), which remains the tablet’s lowest price to date. If you need more storage, the 1TB model is down to $1,768 ($131 off) at Amazon, while the 2TB version is going for $2,147 ($152 off). The heavier 13-inch model is nearly identical to the 11-incher, but it offers more screen real estate and higher resolution.\n\n11-inch iPad Air M3\nThe latest 11-inch iPad Air features Apple’s fast M3 chip with GPU upgrades like dynamic caching for smoother performance in demanding apps. It also supports the Apple Pencil Pro and the newest Magic Keyboard, which features a larger build and a 14-key function row. Read our review.\n\nWhere to Buy: $599 $449.99 at Amazon (128GB, Wi-Fi) $599 $449 at Best Buy (128GB, Wi-Fi) $699 $549.99 at Amazon (256GB, Wi-Fi)\n\nIf you want a larger display, the 13-inch M3-powered iPad Air with Wi-Fi / 128GB of storage is also on sale at Amazon, Best Buy, and Target, where you can buy it starting at an all-time low of around $649 ($150 off). Other configurations are also on sale, with the 256GB model going for $749.99 ($150 off), the 512GB version $929 ($170 off), and the 1TB variant $1,229.\n\n\n\nYou can buy the 13-inch M4-powered iPad Pro with Wi-Fi and 256GB of storage at Amazon starting at $1,049 ($200 off) when you clip the on-page coupon. The last-gen Pro offers a stunning OLED display and a thinner build than prior models, along with a front-facing camera that’s (finally) located in the middle of the long side of the iPad. Read our review.\n\n13-inch iPad Pro M4\nThe last-gen iPad Pro comes in either an 11- or 13-inch configuration with Apple’s M4 processor. Both feature an OLED display and a thinner build than previous models, as well as horizontal placement for the front camera and support for the Apple Pencil Pro. Read our review.\n\nWhere to Buy: $1299 $1099 at Amazon (256GB, Wi-Fi) $1499 at Amazon (512GB, Wi-Fi) $1899 at Amazon (1TB, Wi-Fi)iPad Mini (2024)\nThe seventh-gen iPad Mini comes with Apple’s A17 Pro chip and support for Apple Intelligence. It’s also compatible with the Apple Pencil Pro and offers faster Wi-Fi and USB-C speeds. Read our review.\n\nWhere to Buy: $499 $399 at Amazon (128GB, Wi-Fi) $499 $399 at Best Buy (128GB, Wi-Fi) $599 $499 at Amazon (256GB, Wi-Fi)\nMacBook deals\n13-inch MacBook Air (M4, 16GB RAM, 256GB SSD)\nPowered by the M4 chip, Apple’s latest 13-inch MacBook Air is faster than its predecessor and offers double the base RAM. It can also connect to two external displays with the lid open, unlike prior models, and features an improved 12-megapixel Center Stage webcam. Read our review.\n\nWhere to Buy: $999 $749 at Amazon $999 $749 at Best Buy $999 $749.99 at CostcoMacBook Pro 14-inch (M5, 2025)\nApple&#8217;s 14-inch M5 MacBook Pro takes everything we loved about the M4 model — including all-day battery life and a 12-megapixel webcam — and improves upon it with an M5 chip. It also offers faster storage and a 10-core CPU / 10-core GPU that’s up to 3.5x faster at AI tasks. Read our review.\n\nWhere to Buy: $1599 $1349.99 at Amazon (16GB RAM, 512GB SSD) $1799 $1599.99 at Amazon (16GB RAM, 1TB SSD) $1999 $1749 at Amazon (24GB RAM, 1TB SSD)\n\nThe last-gen 16-inch MacBook Pro is still a powerhouse even if it runs on the older M4 Pro chip, and right now you can buy it with 24GB of RAM and 512GB of storage for $2,189 (about $310 off) at&nbsp;Amazon, which is just a few dollars shy of its all-time low. It sports speedy Thunderbolt 5 ports and a sharp 12-megapixel Center Stage webcam, and because the new M5-powered MacBook Pros don’t yet come in a 16-inch size, it’s your best bet if you want a larger display. Read our review of the 14-inch MacBook Pro.\n\n\n\nIf you’re in the market for a desktop and don’t mind supplying your own keyboard and mouse, you can buy the M4 Mac Mini with an M4 processor, 16GB of RAM, and 256GB of storage for $479 ($120 off) at Amazon and Best Buy, which is one of its best prices to date. The desktop can handle everyday tasks with ease, along with some light gaming and 4K video editing. It can also run up to three displays simultaneously and offers a great port selection that includes three Thunderbolt 4 (USB4) ports, a gigabit ethernet jack, HDMI, two 10Gbps USB-C (USB 3) ports, and a front-facing 3.5mm audio jack. Read our review.\n\n\nAirTags, chargers, and other deals\nApple AirTag\nApple’s AirTags can help you find your lost items with their UWB technology. You’ll get the best compatibility with an iPhone, though Apple released an Android app to detect an AirTag’s location if one seems to be following you. Read our original review.\n\nWhere to Buy: $29 $17.97 at Amazon $29 $17.97 at Walmart $99 $62.99 at Amazon (four-pack)Baseus Free2Pull Retractable USB-C Cable 100W\nBaseus’ slick USB-C charger supports 100W passthrough and takes a puck-like form when not in use, with male connectors on either side that retract inward with a quick tug.\n\nWhere to Buy: $16.99 $9.96 at Amazon (3.3-foot) $21.99 $15.19 at Amazon (6.6-foot) $16.99 $11.89 at Baseus (3.3-foot)Apple TV (six-month subscription)\nApple is hosting a Black Friday sale that lets you lock in six months for just $5.99 per month, which is over 50 percent off the usual cost. This promo isn’t applicable to those eligible to redeem three free months earned through buying a new Apple device, nor will it work for those who get the subscription through a third party, like Amazon.\n\nWhere to Buy: $12.99 $5.99 at Apple (monthly)\n\nThe second-gen&nbsp;HomePod&nbsp;is Apple’s latest smart speaker, and you can pick one up for $269.99 ($30 off) at&nbsp;Best Buy&nbsp;right now. The great-sounding speaker can play Dolby Atmos tracks with proper separation, though you can also pair two together for even better separation. The speaker doesn’t support Bluetooth, which means your device has to be on the same network to stream music to it. You can also ask Siri to play tunes, control various smart home accessories, set timers, or answer questions, but all of those functions still require a stable internet connection.&nbsp;Read our review.\n\n\n\nYou can buy the&nbsp;Apple Pencil Pro&nbsp;for $94.99 ($35 off) at&nbsp;Amazon and Walmart, which is $10 more than its best price to date. If you own the latest iPad Pro, iPad Mini, or an M2- or M3-based iPad Air, this is a fantastic stylus that offers several features not found on the entry-level Apple Pencil with USB-C (which is also discounted to $49 at Walmart). In addition to wireless charging, you get Find My support, pressure sensitivity, and a “Barrel Roll” gyroscope that allows you to easily adjust the angle of your pen with a twist.\n\nTwelve South PowerBug\nPart wall wart, part magnetic wireless charger, the StandBy-ready PowerBug is about as unique as chargers come. The simple device can top off MagSafe and Qi2-compatible devices — including the latest Google Pixel models — while supplying 35W charging speeds to a second gadget via USB-C.\n\nWhere to Buy: $49.99 $39.99 at Amazon (black) $49.99 $39.99 at Twelve South $49.99 $39.99 at Amazon (white)Anker MagGo Wireless Charging Station (3-in-1, Dock Stand)\nAnker’s MagGo Wireless Charging Station features a MagSafe charging stand, a Qi wireless charging pad, and an Apple Watch charger, allowing you to charge three devices simultaneously. It also comes with a 40W USB-C power adapter and cable.\n\nWhere to Buy: $89.99 $75.99 at Best Buy $89.99 $75.99 at Amazon $89.99 $75.99 at Anker (with code WSPDV2OAFIC6)Anker MagGo Qi2 Certified 15W Wireless Charger\nThe latest version of Anker’s magnetic MagGo charging pads supports 15W Qi2 and has a five-foot USB-C cable.\n\nWhere to Buy: $29.99 $14.99 at Amazon (without adapter) $35.99 $17.99 at Amazon (with adapter)\n\nThere’s no question the Apple Studio Display is beautiful, but it’s quite expensive; however, you can pick up the standard option with a tilt-adjustable stand for $1,409 ($190 off) at Amazon and Best Buy, which is a new low price. The Studio Display features a 27-inch 5K screen, a 12-megapixel ultra-wide camera with Center Stage, and a three-mic array for video calls. Apple’s monitor is over three years old by now and there are reports a sequel is on the way, but if this has been on your radar for a while, it’s never been more affordable. Read our review.\n\nTwelve South HiRise 3 Deluxe\nTwelve South’s 3-in-1 charging stand offers full 15W MagSafe iPhone charging and can simultaneously top off a set of AirPods while fast-charging a compatible Apple Watch. It also includes a power supply (with travel adapters) to deliver enough juice over its 5-foot / 1.5m USB cable.\n\nWhere to Buy: $149.99 $59.99 at Amazon $149.99 $69.99 at Twelve South $149.99 $99.99 at Best BuyAnker Nano Power Bank (30W, Built-in USB-C Cable)\nWith a 10,000mAh battery, a max output of up to 30W, and a built-in USB-C cable that conveniently doubles as a carrying loop, Anker’s Nano Power Bank is perfect for charging on the go.\n\nWhere to Buy: $49.99 $29.99 at Amazon $49.99 $30.49 at Anker (with code WS24GL8K4K)Anker Laptop Power Bank\nAnker’s 25,000mAh power bank sports two built-in USB-C cables (one of which is retractable), plus one USB-C and USB-A port. It tops out at 165W when charging two devices simultaneously, or 130W when charging three or four.\n\nWhere to Buy: $119.99 $87.99 at Amazon $119.99 $87.99 at Best Buy $119.99 $87.99 at Anker\nUpdate, November 28th: Updated price / availability and added several new deals, including those for the AirPods 4 with Active Noise Cancellation and the Baseus Free2Pull charger.",
      "content_length": 17065,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Herzschwäche: Comeback für ein uraltes Medikament aus der Natur",
      "link": "https://www.tagesschau.de/wissen/gesundheit/herzschwaeche-digitalis-100.html",
      "published": "2025-11-29T06:48:03",
      "content": "   Digitalis - der aus dem roten Fingerhut gewonnene giftige Wirkstoff wurde 200 Jahre lang gegen Herzschwäche eingesetzt, zuletzt aber kaum noch verordnet. Das könnte sich nach einer neuen Studie ändern. Von T. Hassenstein[mehr]",
      "content_length": 229,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Australian prime minister, Anthony Albanese, marries partner Jodie Haydon",
      "link": "https://www.theguardian.com/australia-news/2025/nov/29/australian-prime-minister-anthony-albanese-marries-jodie-haydon-wedding-canberra",
      "published": "2025-11-29T06:36:42",
      "content": "The PM becomes the first Australian leader to celebrate a wedding while in office with a private ceremony followed by a reception at his official residence, the LodgeGet our breaking news email, free app or daily news podcastThe Australian prime minister, Anthony Albanese, has married his partner, Jodie Haydon, in Canberra, making him the first Australian leader to tie the knot in office.The ceremony took place on Saturday afternoon at Albanese’s official residence, the Lodge, witnessed by a small group of close family and friends, including Albanese’s son, Nathan, and Haydon’s parents, Bill and Pauline. Continue reading...",
      "content_length": 631,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "The 192 best Black Friday deals you can still shop — a ton of tech is over half off",
      "link": "https://www.theverge.com/gadgets/824521/black-friday-2025-best-deals-tech-gadgets-gift-ideas",
      "published": "2025-11-29T06:19:35",
      "content": "\n\n\n\t\n\t\t\n\nNow that the Thanksgiving dishes are put away and the last slice of pie is hidden in the back of the fridge, it’s time to turn your attention to the next major holiday: Black Friday. The biggest shopping day of the year has started, and as expected, there are tens of thousands of deals staring you in the face. The Verge found the ones that are actually worth considering.&nbsp;\n\nOur team has spent an enormous amount of time looking through spreadsheets and e-mails to find gadgets that don’t go on sale very often, are down to their all-time low price, or both. In many cases, our reviews team has tested these gadgets — either for work or in their spare time — and can authoritatively vouch for their quality.&nbsp;Below you can find deals on everything from the AirPods Pro 3 and current-generation Kindle Paperwhite to some of our favorite non-tech essentials.\n\nThere are also great discounts on streaming service subscriptions, including HBO Max, Paramount Plus, and a bundle comprising Hulu and Disney Plus. We update our roundup as we find even more deals, so we encourage you to check back later for more recommendations.&nbsp;\n\n\n\n\n\n\nApple dealsHeadphone and earbud dealsSmartwatch and fitness tracker dealsTablet and e-reader dealsTV and streaming dealsSmart home dealsRobot vacuum and mop dealsSoundbar and speaker dealsLaptop dealsGaming dealsBoard game dealsLego dealsOther Verge favorites\n\n\nApple deals\nAirPods Pro 3\nThe recently released AirPods Pro 3 have a new design that improves their fit, superior noise cancellation, better bass, and fairly accurate heart rate sensors. Read our review.\n\nWhere to Buy: $249 $219.99 at Amazon $249.99 $219.99 at Best Buy $249 $219.99 at TargetApple AirTags\nApple’s AirTags are unobtrusive, waterproof, and tap into the massive Find My network for out-of-range locating.\n\nWhere to Buy: $29 $17.97 at Amazon $99 $64.99 at Amazon (four-pack) $99 $62.99 at Best Buy (four-pack)AirPods Pro (second-gen with USB-C)\nThe second-gen AirPods Pro improve upon Apple’s original pair with much better noise cancellation, sound quality, and onboard volume controls. The latest refresh also ships with a USB-C charging case, as opposed to Lightning. Read our review.\n\nWhere to Buy: $249.99 $139 at Walmart\n\nAmazon, Walmart, and Target&nbsp;have marked the&nbsp;AirPods 4&nbsp;down to around $69 ($60 off), which is their best price to date. Apple’s latest non-Pro AirPods sound great despite their open-style build, support voice isolation for clearer-sounding calls, and have a streamlined setup process and multipoint pairing with Apple devices. You can also get the version with active noise cancellation on sale for a new all-time low of $99.99 ($80 off) at&nbsp;Amazon and Target.&nbsp;Read our review.\n\n13-inch MacBook Air (M4, 16GB RAM, 256GB SSD)\nPowered by the M4 chip, Apple’s latest 13-inch MacBook Air is faster than its predecessor and offers double the base RAM. It can also connect to two external displays with the lid open, unlike prior models, and features an improved 12-megapixel Center Stage webcam. Read our review.\n\nWhere to Buy: $999 $749 at Amazon $999 $749 at Best Buy $999 $749.99 at Costco\n\nThe 15-inch MacBook Air with M4 is $949 ($250 off) at Best Buy and Amazon — the same discount as the 13-inch. It’s much the same excellent computer as the 13-inch version, just with a bigger screen, more battery life, and better speakers. Read our review.\n\n\n\nIf you need to sizable step up in power for a Mac laptop, the 14-inch MacBook Pro with M4 Pro processor is $1,749 ($250 off) at Best Buy and Amazon. It has a 12-core CPU and 16-core GPU, 512GB SSD like the base M5 model, but 24GB of RAM and faster Thunderbolt 5 ports. You can also step up to a bigger and beefier 16-inch version with a 14-core / 20-core M4 Pro chip, 48GB of RAM, and 512GB SSD for around $2,535 ($360 off) at Best Buy and Amazon.\n\n\n\nThe Mac Mini is one of the best bargains available if you want a lot of computing power in a wildly small desktop. The base M4 model is down to $479 ($120 off) at Best Buy and Amazon, which is just $10 shy of its all-time low. Meanwhile, the more powerful M4 Pro version is going for $1,199.99 ($200 off) at Amazon, which is also one of its better prices to date. If you already have a monitor, keyboard, and mouse, there’s no better deal for this kind of power. Read our review.\n\nApple MacBook Pro 14 (2025, M5)\nThe M5-equipped MacBook Pro is mostly a chip bump from the M4 model of 2024. But it remains an excellent choice for beginners and students in creative fields. Read our review.\n\nWhere to Buy: $1599 at Apple $1599 $1349 at Best Buy $1599 $1349 at AmazonApple Watch Series 11 (42mm, GPS)\nAlthough the Apple Watch Series 11 is the same size as its predecessor, it features a 5G cellular modem, a display that’s twice as durable, and slightly improved battery life. Read our review.\n\nWhere to Buy: $399 $339 at Amazon $399 $339 at Walmart $399 $339 at Best Buy\n\nYou can also buy the newfangled Apple Watch Ultra 3 at Amazon with either an Ocean Band, a Trail Loop, or an Alpine Loop for its all-time low of $699.99 ($100 off). Apple’s latest wearable is its most rugged and capable to date, with a larger wide-angle OLED display, satellite and 5G connectivity, and a battery that can last up to 42 hours on a single charge (up from 36 hours on the Ultra 2). Read our review.\n\n\n\nYou can pick up the 40mm Apple Watch SE (second-gen) with GPS at Walmart starting at $129 ($120 off), which is a new low price (the 44mm variant is also on sale starting at $159). If you’re on a tight budget, the last-gen Apple Watch SE is still worth considering. It lacks some of Apple’s newer sensors and doesn’t offer an always-on display, but it remains relatively fast, given that it uses the same chipset as the Apple Watch Series 8. It also provides all the essentials, including daily activity and sleep tracking, heart-rate monitoring, fall and crash detection, and access to the newer Vitals app in watchOS 26.\n\nApple Watch SE 3\nThe Apple Watch SE 3 offers some big upgrades over its predecessor, including an always-on display, allowing you to glance at the time or unread notifications. It also has Apple’s powerful S10 chip, which enables on-device Siri requests. Read our review.\n\nWhere to Buy: $249 $199 at Amazon (40mm, GPS) $279 $229 at Amazon (44mm, GPS) $249 $199 at Costco (40mm, GPS)\n\nThe second-gen HomePod is Apple’s latest smart speaker, and you can pick one up for  $269.99 ($30 off) at Best Buy right now. The great-sounding speaker can play Dolby Atmos tracks with proper separation, though you can also pair two together for even better separation. The speaker doesn’t support Bluetooth, which means your device has to be on the same network to stream music to it. You can also ask Siri to play tunes, control various smart home accessories, set timers, or answer questions, but all of those functions still require a stable internet connection. Read our review.\n\n\n\nThe latest 11-inch iPad Pro has only been out for about a month, but that hasn’t stopped Amazon from cutting the price of the 256GB / Wi-Fi model to $899 ($100 off). Apple’s newest, most powerful iPad has the same design as last year’s model, but features a faster M5 processor, which you’ll notice most when performing resource-intensive tasks like playing games. Lower storage configurations of the iPad Pro also have 12GB of RAM (up from 8GB), while all models have faster memory bandwidth. Read our review.\n\n11-inch iPad Air M3\nThe new 11-inch iPad Air comes with Apple’s M3 chip and GPU upgrades. It&#8217;s available in dark gray, blue, purple, and a “starlight” cream shade. Read our review.\n\nWhere to Buy: $599 $449 at Amazon (128GB, Wi-Fi) $699 $549 at Amazon (256GB, Wi-Fi) $899 $749 at Amazon (512GB, Wi-Fi)iPad (2025)\nApple’s entry-level iPad is an excellent tablet for casual use. Its high resolution screen is great for watching video, and its A16 processor is fast enough to handle light games and productivity apps. Read our review.\n\nWhere to Buy: $349 $274 at Amazon (128GB, Wi-Fi) $449 $374 at Amazon (256GB, Wi-Fi) $349 $274 at Walmart (128GB, Wi-Fi)\nHeadphone and earbud deals\nBose QuietComfort Ultra Headphones\nBose’s last-gen flagship headphones are a replacement for the Noise Cancelling Headphones 700 that offer a more travel-friendly design, spatial audio, better call quality, excellent comfort, and some of the best noise cancellation around. Read our review.\n\nWhere to Buy: $429 $299 at Amazon $429 $299 at Best Buy $429 $298 at WalmartBose QuietComfort Headphones\nBose’s QuietComfort Headphones, which replace the QuietComfort 45, have adjustable noise cancellation and the ability to set custom modes. However, they lack immersive audio mode and the higher-quality Bluetooth found in the QuietComfort Ultra Headphones.\n\nWhere to Buy: $359 $199 at Amazon $359 $199 at Best Buy $359 $199 at BoseSony WH-1000XM6\nSony’s latest pair of flagship headphones feature improved comfort, better noise cancellation, and the ability to charge while in use. They even fold down for travel, which can’t be said about the last-gen XM5. Read our initial impressions.\n\nWhere to Buy: $449.99 $398 at Amazon $449.99 $398 at Best Buy $449.99 $399.99 at Target\n\nBose’s Ultra Open Earbuds are the brand’s boldest, most unique earbuds — and you can pick them up at Amazon, Walmart, and Best Buy for $199 ($100 off), their lowest price to date. Instead of sitting in your ear canal, the earbuds cling to your outer ear like a piece of jewelry. That design means you’ll always hear external noise, which isn’t ideal if you want to block out noisy coworkers; however, it’s great if you need to remain aware of your surroundings, such as when walking or riding a bike. Read our review.\n\n\n\nEarFun is offering up to 65 percent off its already affordable headphones, earbuds, and speakers. The EarFun Free Pro 3, a great pair of cheap wireless earbuds, are currently down to just $27.99 ($52 off) at Earfun’s online storefront with coupon code PDFP3. The wireless earbuds feature ANC, wireless charging, and over seven hours of continuous playback on a single charge. The EarFun Tune Pro, meanwhile, are on sale for $48.99 ($21 off) with code TUNEPRO56. The over-ear headphones feature noise-canceling tech and support for multipoint Bluetooth connectivity, so you can connect to two devices simultaneously.\n\nBeats Powerbeats Pro 2\nThe latest Powerbeats Pro are a no-brainer for athletes. They pack fantastic sound and thumping bass, along with active noise cancellation, IPX4 water resistance, and heart rate monitoring. Read our review.\n\nWhere to Buy: $249 $199.95 at Walmart $249 $199.95 at Amazon $249 $199.99 at Best BuyGoogle Pixel Buds Pro 2\nSignificantly smaller and lighter than their predecessors, the Pixel Buds Pro 2 also offer stronger noise cancellation, a crystal clear transparency mode, and lengthy battery life. Read our review.\n\nWhere to Buy: $229 $168.99 at Amazon $229 $169 at B&amp;H Photo $229 $169 at Best BuyBose QuietComfort Ultra Earbuds (second-gen)\nThe second-gen QuietComfort Ultra Earbuds have dynamic, rich sound and the best noise cancellation available in true wireless earbuds. They’re a terrific pick if earbuds you want to listen to your music in peace. Read our review.\n\nWhere to Buy: $299 $216 at Amazon $299 $216 at Best Buy $299 $249.99 at Target\n\nNow through December 1st, you can snag the Sony WF-1000XM5 earbuds for $228 ($101 off) at Amazon, Best Buy, and Sony’s online store, which matches the price drop we saw during Amazon’s most recent Prime Day event. Sony’s flagship earbuds improve upon the prior model with richer sound, slightly more powerful noise cancellation, and vastly superior comfort thanks to their reduced size and weight. They also come with four foam-style ear tips, offer around eight hours of battery life with ANC enabled, and carry an IPX4 rating with support for multipoint connectivity. Read our review.\n\nNothing Ear (a)\nNothing’s Ear (a) earbuds have the same general design as the company’s previous earbuds — but you can get these in a snazzy yellow. They include ANC, more than decent sound quality, and other features like multipoint for just under $100. Read our impressions.\n\nWhere to Buy: $99 $59 at Amazon $99 $59 at NothingSony WH-1000XM5\nWith improved comfort, refined sound, and even better active noise cancellation, Sony’s WH-1000XM5 offer a compelling mix of features for the price. Read our review.\n\nWhere to Buy: $399.99 $248 at Amazon $399.99 $248 at Best Buy $399.99 $249.99 at SonyShokz OpenRun Pro 2\nThe OpenRun Pro 2 are Shokz’s best bone conduction headphones yet, with better sound and more bass than their predecessor. Our reviewer Victoria Song praised their cozy fit as well as their USB-C charging (goodbye, proprietary charger!). Read our review.\n\nWhere to Buy: $179.95 $124.95 at Amazon $179.95 $124.99 at REI $179.95 $124.99 at Best Buy\nSmartwatch and fitness tracker deals\nGoogle Pixel Watch 4\nThe Pixel Watch 4 has a bigger display, longer battery life, more repairable design, and new Satellite SOS mode. It also  leverages Google Gemini, and introduces an AI Health Coach. Read our review.\n\nWhere to Buy: $349.99 $299.99 at Amazon (41mm, Wi-Fi) $349.99 $299.99 at Best Buy (41mm, Wi-Fi) $349.99 $299.99 at Target (41mm, Wi-Fi)Oura Ring 4\nThe Oura Ring 4 is slimmer and more accurate than its predecessor, while adding new AI-powered tools and longer battery life. Read our review.\n\nWhere to Buy: $349 $249 at Amazon $349 $249 at Best Buy $349 $249 at OuraFitbit Charge 6\nThe Fitbit Charge 6 features a haptic side button, an improved heart rate algorithm, turn-by-turn navigation with Google Maps, and the ability to broadcast your heart rate on certain Bluetooth gym equipment. Read our review.\n\nWhere to Buy: $159.95 $99.95 at Amazon $159.95 $99.95 at Best Buy $159.95 $99.95 at Target\n\nThe Fitbit Ace LTE is down to around $99.95 ($80 off) at Amazon, Target, and Best Buy, which marks a new low price. The fitness tracker is designed specifically for kids, with movement-based games that encourage physical activity. It also supports GPS location tracking, along with the ability to send messages and place calls to a limited number of contacts. However, keep in mind that a Fitbit Ace Pass subscription ($9.99 per month / $119.99 per year) is required for location tracking, messaging, and access to the Fitbit Arcade.&nbsp;Read our hands-on impressions.\n\n\n\nThe Fitbit Versa 4 is on sale at Amazon, Target, and Best Buy for $119.95 ($80 off), which is the lowest price we’ve seen this year. The smartwatch features heart rate, activity, sleep, blood oxygen, menstrual health, and stress tracking, as well as more than 40 exercise modes that automatically detect and track specific workouts. Although it doesn’t support ECG, it can record heart rate variability and monitor it 24/7. It also supports services like Fitbit Pay and Google Maps, extending its usefulness beyond its core fitness tracking capabilities.\n\nFitbit Sense 2\nThe Sense 2 delivers premium health tracking, highlighted by top-tier stress sensing via continuous EDA and heart-rate variability. It also offers strong battery life and monitors sleep, ECG, and temperature. Read our review.\n\nWhere to Buy: $249.95 $179.95 at Amazon $249.95 $179.95 at Target $249.95 $179.95 at Best Buy\n\nThe entry-level Fitbit Inspire 3 has returned to its all-time low of $69.95 ($30 off) at Amazon, Target, and Best Buy. The basic fitness band nails the basics, providing heart rate, sleep, exercise, blood oxygen, and menstrual health tracking. It can also provide you with a sleep score every morning, along with tips for improving your sleep. You can also remove the Inspire 3 from its band and wear it as a necklace, which is less obtrusive but disables heart rate tracking.&nbsp;Read our hands-on impressions.\n\nGoogle Pixel Watch 3 (45mm, Wi-Fi)\nGoogle’s last-gen smartwatch features a large screen, a battery that lasts up to 24 hours, and sensors for measuring your blood oxygen levels and taking an EKG. The wearable also offers a host of useful Google integrations and can provide you with custom running workouts. Read our review.\n\nWhere to Buy: $299.99 $199.99 at Amazon $299.99 $199.99 at Best BuyGarmin Fenix 8\nThe Garmin Fenix 8 adds smart features like the ability to take calls on the wrist, and an on-board voice assistant.\n\nWhere to Buy: $999.99 $749.99 at Garmin $1000 $749.99 at REI $999.99 $749.99 at Amazon\n\nThe Venu X1, one of Garmin’s more premium smartwatches, is available from Amazon for a new low of $599.99 ($200 off). The X1 features a 2-inch OLED display and Garmin’s thinnest case yet. It can also track your activity, heart rate, blood oxygen level, and sleep (including naps). It’ll provide you with a morning report based on recorded health metrics, and it offers stress tracking and guided meditations. It can even track over 100 activities and create a running or strength training regimen via Garmin Coach.\n\n\n\nGarmin’s midrange Vivoactive 6 is on sale for $249.99 ($50 off) — its best price to date — at Amazon, Best Buy, and REI. The watch features a circular 1.2-inch OLED screen, a battery that can last up to 11 hours per charge, and Bluetooth support. It can also track your activity, blood oxygen level, sleep, and heart rate, as well as generate fitness plans using the built-in Garmin Coach.\n\nGarmin Forerunner 265 (42mm)\nGarmin’s midrange Forerunner watch adds an OLED display, a week’s worth of battery life, and dual-frequency GPS for better accuracy. Read our review.\n\nWhere to Buy: $449.99 $299.99 at Amazon (42mm) $449.99 $299.99 at Amazon (46mm) $449.99 $299.99 at Best Buy (42mm)\n\nThe&nbsp;46mm OnePlus Watch 3&nbsp;is available from Amazon, Best Buy, and  OnePlus for $249.99 ($100 off) — its best prices to date. The newer wearable retains everything&nbsp;we loved about its predecessor, including dual-frequency GPS and long battery life, but improves the experience with a rotating crown that scrolls and up to 120 hours of battery life. It can also provide a quick snapshot of your heart rate, blood oxygen levels, sleep quality, and more. Read our hands-on impressions.\n\nGarmin Venu 3S\nThe Venu 3S remains our favorite Garmin smartwatch. It’s a comfortable wearable with up to 10 days of battery life and a vibrant 1.2-inch OLED display, not to mention solid sleep tracking, Atrial Fibrillation detection, and a built-in EKG reader. Read our review.\n\nWhere to Buy: $449.99 $349.99 at Amazon $449.99 $349.99 at Best Buy $449.99 $349.99 at REI\n\nThe Amazfit Active 2 remains our favorite fitness tracker because it offers a surprising feature set given its modest price tag, especially now that you can get it for an all-time low of $79.99 ($20 off) at Amazon, Best Buy, and Walmart. The budget-friendly smartwatch can track your sleep, heart rate, and a slew of activities, while providing a daily readiness score based on what its sensors record. It also features a vibrant OLED display, an estimated 10 days of battery life, and enough built-in sports modes to accurately track every part of your workout routine. Read our review.\n\n\n\nSamsung’s Galaxy Ring is an excellent complement to a Samsung smartphone, and it’s hit an all-time low of $279.99 ($120 off) at Amazon, Best Buy, and Samsung’s online store. The newer smart ring has a slim, lightweight design, long battery life, and, unlike competitors like the Oura Ring, doesn’t lock features behind a paywall (yet). That said, its battery lasts longer when paired with a Samsung phone, and certain features — including the ability to view your daily Energy Score or use the camera shutter by pinching your fingers — aren’t available when paired with another Android phone. Read our review.\n\n\nTablet and e-reader deals\nAmazon Fire HD 10 (2023)\nThe 2023 Amazon Fire HD 10 sports a 10.1-inch, 1080p display and 3GB of RAM, which is plenty if you’re streaming or browsing. It’s lighter than the last-gen model, too, and comes with support for both the Made for Amazon Stylus Pen and Amazon’s handwriting recognition technology.\n\nWhere to Buy: $139.99 $69.99 at Amazon (32GB, with ads) $179.99 $79.99 at Amazon (64GB, with ads) $154.99 $84.99 at Amazon (32GB, without ads)\n\nThe latest Amazon Fire HD 10 Kids tablet is matching its all-time low of $104.99 ($85 off) at Amazon, Target, and Best Buy. The tablet features a 10.1-inch 1080p display, a kid-proof case, and up to 13 hours of battery life. It also comes with 32GB of storage for loading up apps and other content, along with robust parental controls and a two-year warranty. It also comes with a year of Amazon Kids Plus, which features access to ad-free, age-appropriate content, including books, movies, apps, and more.\n\n\n\nIf you’re looking for something more compact, the latest Amazon Fire 7 Kids is currently available at Target, Best Buy, and Amazon, for $44.99 ($55 off), its lowest price to date. The basic tablet offers many of the same features and services found in the larger 10.1-inch model — including an extended two-year warranty, extensive parental controls, and a year of Amazon Kids Plus — but the base Fire 7 Kids comes with 16GB of storage and features a smaller 7-inch display. The device also offers up to 10 hours of battery life, providing plenty of fun while on the road.\n\nKindle Paperwhite (12th-gen)\nAmazon&#8217;s latest Kindle Paperwhite — aka our favorite ebook reader — is waterproof, has a seven-inch display, and lasts weeks per charge. Read our review.\n\nWhere to Buy: $159.99 $124.95 at Amazon (with ads) $159.99 $124.95 at Best Buy (with ads) $159.99 $124.95 at Target (with ads)\n\nThe 16GB Kindle Colorsoft, Amazon’s newest color e-reader, is down to a new low of $169.99 ($80 off) at Amazon and Best Buy. It features a 7-inch screen with 300ppi when viewing text and black-and-white imagery, or 150ppi when viewing color. It has 16GB of storage, a battery that lasts up to eight weeks, and a waterproof design. If you want to carry around more books, the Signature Edition has 32GB of storage, plus wireless charging and an auto-adjusting front light sensor. You can pick the latter up for $229.99 ($70 off) at Amazon, Best Buy, and Target.\n\nKindle (11th-gen)\n Amazon’s latest entry-level Kindle retains a six-inch, 300ppi display and USB-C charger. It’s brighter and slightly faster than its predecessor, though, and features longer battery life.\n\nWhere to Buy: $109.99 $79.99 at Amazon (with ads) $109.99 $79.99 at Best Buy (with ads) $109.99 $79.99 at Target\n\nAmazon, Best Buy, and Target have all marked the 2024 Kindle Scribe with 16GB of storage down to an all-time low of $279.99 ($120 off). The Scribe has a 10.2-inch display and a battery that can last up to 12 weeks, and it comes with Amazon’s Premium Pen, which you can use to annotate books or jot down ideas. The e-reader’s built-in AI features, meanwhile, allow you to clean up your handwriting, summarize your notes, or adjust the length and tone of what you’ve written. However, keep in mind that Amazon recently announced a new model, though we still don’t have a firm launch date. Read our review.\n\nKobo Libra Colour\nThe Libra Colour is one of the first e-readers from Kobo with color. It packs physical-page turning buttons, stylus compatibility, and supports a broad range of file formats, while making it easy to borrow books from the Overdrive library system. Read our review.\n\nWhere to Buy: $229 $199.99 at Amazon $219.99 $199.99 at Target $219.99 $199.99 at Rakuten Kobo\nTV and streaming deals\nDisney Plus, Hulu Bundle (with ads)\nYou can get an ad-supported Disney Plus and Hulu bundle for $4.99 a month ($8 off) for an entire year. Both streaming services feature a deep catalog of new and classic shows and movies, including The Simpsons, Andor, Toy Story, The Fantastic 4: First Steps, and Freakier Friday.\n\nWhere to Buy: $12.99 $4.99 at Disney Plus (monthly)HBO Max\nAn HBO Max Basic subscription provides access to shows like House of the Dragon, The Last of Us, and The Pitt, as well as films like Superman and Weapons. You can get a year of the monthly, ad-supported subscription for $2.99 ($8 off) a month until December 1st. \n\nWhere to Buy: $10.99 $2.99 at HBO Max (monthly, with ads) $109.99 at HBO Max (annual, with ads) $184.99 at HBO Max (annual, ad-free)\n\nLG’s 55-inch C5 OLED is down to $1,049.99 ($950 off) at Amazon. The midrange TV is a good entry point into the world of OLED technology, offering a solid balance in terms of design, brightness, and high-end gaming features, including four HDMI 2.1 ports that support 4K at 144Hz with variable refresh rate tech. The C5 Series also handles glare and ambient light better than the step-down B5 Series; however, OLED panels are still not ideal for really bright rooms.\n\n\n\nHisense’s 65-inch S7N Canvas TV is the company’s answer to Samsung’s popular Frame TV, one you can currently grab for $849.99 ($450 off) at Amazon. The 4K set has a matte screen that makes the artwork it displays more akin to a real painting, and Hisense includes a wall mount, allowing you to hang it. The S7N features a QLED panel with a 144Hz refresh rate and four HDMI ports (two HDMI 2.1 and two HDMI 2.0), making it suitable for a mix of current and last-gen gaming consoles.\n\nApple TV (six-month subscription)\nApple is hosting a Black Friday sale that lets you lock in six months for just $5.99 per month, which is over 50 percent off the usual cost. This promo isn’t applicable to those eligible to redeem three free months earned through buying a new Apple device, nor will it work for those who get the subscription through a third party, like Amazon.\n\nWhere to Buy: $12.99 $5.99 at Apple (monthly)Sony Bravia 8 II\nThe Bravia 8 II was chosen as the “king of TV” by a panel of judges (including The Verge’s own Nilay Patel) in Value Electronics’ 2025 shootout. The OLED TV has excellent color accuracy, a bright panel, and a 120Hz refresh rate.\n\nWhere to Buy: $2999.99 $1998 at Amazon (55-inch) $2999.99 $1998 at B&amp;H Photo (55-inch) $3499.99 $2298 at Amazon (65-inch)Hisense U7 Series ULED TV (2025)\nIt’s always more immersive to watch TV and movies on a bigger screen, but up until the last few years that required a projector. Now, TVs like the 100-inch Hisense U7 deliver a brighter image than any projector ever could for a fraction of the cost.\n\nWhere to Buy: $3497.99 $2199.99 at Best Buy (100-inch)\n\nIf you’re looking for a solid OLED TV, but don’t need the best of the best, the Samsung S90F is one of the best 65-inch TVs you can get for its sale price of $1,397.99 (down from about $1,600 last month) at Amazon and two dollars more Best Buy. It might not be the brightest OLED of 2025 (for that, see the LG G5), but at a little over 1,400 nits, there’s plenty of light to combat a well-lit living space. The S90F is also very accurate and has excellent color gamut coverage, which translates to vibrant, lifelike colors. And for gamers, all four HDMI ports are version 2.1, the TV supports high refresh rates with FreeSync up to 144Hz for PC gaming, and its input lag is under 10ms.\n\nRoku Pro Series 4K TV\nRoku’s latest Pro 4K TV has a 120Hz refresh rate, four HDMI ports (two 2.1 ports), full array local dimming for even brightness, and supports both Dolby Vision IQ and HDR 10 Plus for better color accuracy. It also works with Apple Home, Amazon Alexa, and Google Home to integrate easily into most smart homes.\n\nWhere to Buy: $899.99 $597.99 at Amazon (55-inch) $1199.99 $797.99 at Amazon (65-inch) $1199.99 $798.99 at Best Buy (65-inch)TCL QM8K Series QD-Mini LED TV\nThe QM8K is one of the best (and brightest) mini-LED TVs of 2025. And a 65-inch model under $1,000 is an absolute steal.\n\nWhere to Buy: $1799.99 $899.99 at Best Buy (65-inch)\n\nLG’s 77-inch G5 OLED is an expensive set, but you can currently snag it for around $3,346.99 ($1,153 off) — one of its best prices to date — at Amazon. The high-end 4K TV delivers better brightness than the aforementioned C5, allowing you to use it in rooms that are exposed to a lot of ambient light. It also features four HDMI 2.1 ports that support 4K at 165Hz with VRR, as well as support for the popular Dolby Vision HDR format.\n\nGoogle TV Streamer (4K)\nGoogle&#8217;s terrific TV Streamer (4K) is the company’s best attempt at a streaming device yet, with built-in ethernet, an excellent interface, and smart home compatibility with both Matter and Thread. Read our review.\n\nWhere to Buy: $99.99 $74.99 at Amazon $99.99 $74.99 at Walmart $99.99 $74.99 at Best BuyAmazon Fire TV Stick 4K Max (2023)\nAmazon’s Fire TV Stick 4K Max is noticeably faster than its predecessor, features Wi-Fi 6E, and benefits from twice the storage. It can also showcase widgets and artwork when idle, and continues to offer robust Alexa integration. \n\nWhere to Buy: $59.99 $34.99 at Amazon $59.99 $34.99 at Best Buy $59.99 $34.99 at Target\n\nAmazon’s recently rebranded Fire TV Stick 4K Plus is the company’s midrange option, and it’s down to an all-time low of $24.99 ($25 off) at Amazon and Best Buy. The inexpensive streaming device comes with an Alexa Voice Remote that features a built-in microphone, which lets you use Amazon’s virtual assistant to find TV shows and movies, or control compatible smart home accessories using your voice. You can also use it to access Amazon Luna or Xbox Game Pass, allowing you to play games from their respective cloud gaming libraries.\n\nParamount Plus (two months)\nYou can get a two-month subscription to either Paramount Plus Essential (ad-supported) or Paramount Plus Premium (ad-free) for $2.99 until December 2nd. The deal saves you up to $20 and includes access to a catalog of over 40,000 TV shows and movies, including Star Trek: Strange New Worlds, The Naked Gun, South Park, and The Daily Show.\n\nWhere to Buy: $7.99 $2.99 at Paramount Plus Essential $12.99 $2.99 at Paramount Plus PremiumRoku Ultra\nRoku’s latest Ultra streamer has built-in ethernet, a rechargeable voice remote with backlit buttons, and AirPlay 2 support. You can also control it with Amazon Alexa through a compatible smart speaker. The Roku Channel app lets you stream over 400 free live TV stations, plus exclusive movies like Weird: The Al Yankovic Story.\n\nWhere to Buy: $99.99 $69 at Amazon $99.99 $69.99 at Best Buy $99.99 $69.99 at B&amp;H Photo\nSmart home deals\nPhilips Hue Festavia string lights\nThese smart lights have beautiful colors, a nice selection of festive scenes, and an easy-to-use app. They are super reliable when paired with a Hue Bridge and also work over Bluetooth. They come in three lengths, work with all the major smart home platforms, and are Matter-compatible.\n\nWhere to Buy: $241.99 $145.19 at Amazon (65-foot) $395.99 $237.6 at Amazon (130-foot)Blink Video Doorbell (second-gen)\nBlink’s latest Video Doorbell is one of the best options available if you want a budget-friendly buzzer with motion-activated recording and alerts, night vision, two-way audio, and up to two years of battery life. Just know that a Sync Module is required for the doorbell to work properly. \n\nWhere to Buy: $69.99 $29.99 at Amazon (with Sync Module Core) $59.99 $29.99 at Best Buy (with Sync Module Core)\n\nThe Ring Battery Doorbell and Indoor Cam Bundle is available at Amazon, Target, and Best Buy for $69.99 ($70 off), matching its best price to date. The bundle includes a Ring Battery Doorbell and an Indoor Cam, making it a great starter kit for renters and new home owners. The Ring Battery Doorbell offers head-to-toe video outside your front door, while the Indoor Cam let’s you keep an eye on an interior space. They’re easy to install, easy to set up, and easy to use.\n\n\n\nThe Blink Mini 2 is on sale for $17.99 ($22 off) at Amazon, Best Buy, and Target, which matches its best price to date. The 1080p camera offers all the basics, including color night video, motion alerts, and two-way audio. It also features USB-C support and a wider 143-degree field of view than prior models, letting you see more of the room or porch. Just note that if you want to use it outside to keep tabs on packages, you’ll need a weather-resistant adapter to go with it, which you can get on Amazon for about $10 more.\n\n\n\nThe Yale Assure Lock 2 Touch is on sale for $199.99 ($100 off) at Best Buy. The stylish smart lock works with every major smart-home platform and supports both Bluetooth and Wi-Fi. It also lets you unlock your door in multiple ways, including via fingerprint, touchscreen, the app, and even has an auto-unlocking feature. Read our review.\n\n\n\nIf Philips Hue’s Festavia lights are outside your budget, Govee’s Christmas Lights 2 are also on sale, with the 66-foot going for an all-time low of $63.99 ($36 off) at Amazon and Govee’s online storefront. You can also grab the 99-foot strand for $11 more (Amazon / Govee), the longer 164-foot set for $129.99 (Amazon / Govee), or the 328-foot string for $249.99 (Amazon / Govee). The Matter-compatible lights offer an IP65 rating so you can use them indoors and outdoors, but their dro-style head LEDs aren’t as attractive as the Festavia’s. Plus, the Festavia offer nicer preset scenes.\n\nRing Battery Doorbell Plus\nRing’s Battery Doorbell Plus offers great video quality, a head-to-toe view, and a removable battery for easy charging. It works with Alexa and can send alerts for people and packages with a Ring Home subscription.\n\nWhere to Buy: $149.99 $79.99 at Amazon $149.99 $79.99 at The Home Depot $149.99 $79.99 at TargetGoogle Nest Doorbell (second-gen, battery)\nWith 24/7 recording, facial recognition, reliable smart alerts, and some free video recording, Google’s second-generation battery doorbell is a great option for home monitoring.\n\nWhere to Buy: $179.99 $119.99 at Amazon $179.99 $119.99 at Target $179.99 $119.99 at Best Buy\n\nThe Google Nest Cam — which can be used both indoors and outside — is now available for its lowest price in months at Amazon, Best Buy, and the Google Store, where you can pick it up for $119 ($60 off). The battery-powered security cam features 24/7 recording, smart alerts for people, pets, and vehicles, and up to 60 days of video history (with a Nest Aware subscription). You can also snag a two-pack for around $228.99 ($101 off) at Amazon, Best Buy, and the Google Store, or a three-pack for $349.99 ($100 off) at Best Buy and the Google Store.\n\nGoogle Nest Learning Thermostat (4th-gen)\nThe striking fourth-gen Nest is $50 off right now and a great addition to your smart home if you’re looking to save money on heating and cooling. With a bigger screen, better dial, and a room sensor included, this is one of the best thermostats you can buy. Read my full review.\n\nWhere to Buy: $279.99 $229.99 at Amazon $279.99 $229.99 at Google\n\nIf you’re looking for an inexpensive smart thermostat that offers a lot of value, Amazon’s Smart Thermostat is down to $51.99 ($28 off) at Amazon, Best Buy, and Target — the best price we’ve seen all year. It lacks native temperature sensors, but it can learn and adapt to your habits over time, which is rather impressive for the price. It also integrates well with Alexa, though it doesn’t support other voice assistants. Read our review.\n\nAmazon Echo Hub\nAmazon’s new Echo Hub is kind of like a small Fire tablet you mount on your wall that gives you full-time access to all your smart home controls. It’s got an eight-inch touchscreen and support for Matter and Thread. Read our review.\n\nWhere to Buy: $179.99 $119.99 at Amazon $179.99 $119.99 at Best Buy $179.99 $119.99 at The Home Depot\n\nYou can buy the latest Echo Show 8 for $159.99 ($20 off) at Amazon, Best Buy, and Target, which is the best price we’ve seen on the eight-inch smart display. The fabric-wrapped Show 8 offers improved sound over the prior model, along with a better LCD display with&nbsp;wider viewing angles and higher contrast. It’s snappier, slimmer, and sleeker; it’s also designed to run on Amazon’s revamped&nbsp;Alexa Plus AI assistant. Read our impressions of the latest Echo Show 8.\n\n\n\nReolink’s Video Doorbell is one of our top recommendations if you don’t want to pay a subscription fee to view footage, and it’s returned to its all-time low of $76.99 ($43 off) at Amazon, Newegg, and Reolink’s website. The wired doorbell can record clear 2K HDR footage and store video clips locally on a microSD card, the Reolink Hub, or an FTP server. It’s also compatible with both Amazon Alexa and Google Home, but not Apple Home.\n\nAura Aspen\nThe Aura Aspen digital frame lets you upload photos via the companion app, cloud services, or email from anywhere. Its 12-inch LCD display features slim bezels, a 4:3 aspect ratio, and an antiglare screen that mimics the look of real photos.\n\nWhere to Buy: $229 $199 at Amazon $229 $199 at Aura $229.99 $199.99 at Best BuyNuki Smart Lock\nA rare discount on our favorite retrofit door lock, the Nuki Smart Lock, makes it easy to upgrade your home security system without replacing your entire lock and supports every major smart home platform through Matter-over-Thread. Read our full review.\n\nWhere to Buy: $159 $127.2 at Amazon (with on-page coupon)\n\nMakers of some of the best smart switches, Lutron Caseta is offering its customary 20 percent off select products this Black Friday. A great option if you don&#8217;t have neutral wires, you can pick up the Smart Diva Dimmer Kit for $99.95 at Amazon to get started with smart switches.\n\n\n\nThe excellent Matter-over-Thread Eve Energy smart plug, which features energy monitoring and works with Matter, Apple Home, Alexa, Google, SmartThings, and more, is down to $33 at&nbsp;Amazon.\n\n\n\nSwitchBot’s simple Smart Switch Button Pusher is just $19.99 at Amazon, down from $29.99. This is a great gadget for a new smart home user, as it can turn any button into a smart one.\n\nMeross Smart Wi-Fi Garage Door Opener\nMeross makes a handy add-on that can transform a variety of garage door models into smart doors that you can open remotely. It works with Amazon Alexa, Apple Home, Google Home, and Samsung SmartThings.\n\nWhere to Buy: $59.99 $39.99 at Amazon (with Prime)Aqara Smart Lock U300\nThe first single-borehole smart lock to work with Apple Home Key, the U300 can also be unlocked with a fingerprint, making it an easy, smart addition for shed, garage, or home office doors. It works over Thread and is Matter compatible, with up to a 10-month battery life.\n\nWhere to Buy: $229.99 $149.49 at Amazon $229.99 $149.49 at Best Buy\nRobot vacuum and mop deals\nDreame X40 Ultra\n\nWhere to Buy: $1199.99 $499.99 at Amazon $1199.99 $499.99 at Dreame $1199.99 $499.99 at Best Buy\n\nThe Dreame X50 Ultra recently replaced the X40 Ultra as our favorite mopping bot for hardwood floors, and it’s currently available for an all-time low of $799.99 (50 percent off) from Amazon and Dreame. In addition to having a higher 20,000Pa of suction power and an improved dual rubber roller system, it has a motorized “swing arm” leg that allows it to climb over higher thresholds (up to 6cm), so it can maneuver around even more spaces than its predecessor.\n\nEcovacs Deebot T50 Max Pro\nEcovacs&#8217; Deebot T50 Max Pro is a robot vacuum / mop combo with tangle-resistant brushes, a side brush for cleaning corners, and deep carpet cleaning capabilities. Its charging station thoroughly cleans and dries its mopping pads automatically upon its return, and it supports Matter, allowing you to easily integrate it into any smart home.\n\nWhere to Buy: $799.99 $499.99 at Amazon $799.99 $499.99 at Best Buy $799.99 $499.99 at Walmart\n\nRoborock’s Saros 10R is on sale for $999.99 ($500 off) at Amazon and directly from Roborock, which is a record low price. The pricey robovac uses an AdaptLift chassis to help it climb over high room transitions, and can even lift its mop pads out of the way when they’re not needed. It’s also exceptionally powerful, with 22,000Pa of suction, lidar navigation, and a vibrating mopping pad.\n\n\n\nThe&nbsp;Eufy Omni S1 Pro&nbsp;is also matching its all-time low of $699.99 ($800 off) at Amazon and from Anker’s online storefront (with promo code WS24T2080111). The robovac features an 11.4-inch roller mop and dual spinning side brushes, which work in tandem to leave your hardwood floors spotless. Plus, with 8,000Pa of suction power, it’s decent at picking up dirt and debris from carpets; it also features solid AI-powered obstacle avoidance, so you don’t need to worry about it getting stuck in clutter.\n\n\n\nThe&nbsp;Eufy X10 Pro Omni,&nbsp;our favorite midrange robot vacuum / mop, has returned to its Prime Day low of $449.99 ($450 off) at Amazon and from Anker’s online storefront (with code WS24T2351). The X10 Pro Omni is particularly great for cleaning up carpets and tiles, thanks to its 8,000Pa of suction power. It also features reliable AI-powered obstacle detection, dual oscillating brushes for mopping up floors, and a dock that handles auto-emptying, washing, and refilling.\n\nTapo RV30 Max Plus\nOur favorite budget-friendly robot vacuum offers high-end features, including room-specific cleaning, a capable mop, carpet boost, and smart navigation. It also features an auto-empty dock.\n\nWhere to Buy: $329.99 $199.99 at Amazon (with code 30RV30MPLUS) $329.99 $199.99 at TP-Link (with code 30RV30MPLUS)Ecovacs Deebot X9 Pro Omni\nThe Ecovacs Deebot X9 Pro Omni features an extendable mop that can clean itself, just like its predecessor. However, it also features Ecovacs&#8217; Boosted Large-Airflow Suction Technology, which optimizes the airflow path from intake to exhaust, rather than relying solely on suction power. \n\nWhere to Buy: $1299.99 $699.99 at Amazon $1299.99 $699.99 at Ecovacs $1299.99 $699.99 at Best Buy\nSoundbar and speaker deals\nSony Bravia Theater Bar 6\nSony’s Bravia Theater Bar 6 is a 3.1.2 audio system, meaning the soundbar comes with a wireless subwoofer and features multiple drivers pointed at you — and upward — for playing Dolby Atmos audio. You can also purchase the soundbar in a bundle with rear speakers if you want a more traditional surround sound setup. \n\nWhere to Buy: $699.99 $498 at Amazon $699.99 $499.99 at Best Buy $699.99 $499.99 at Sony Sony Bravia Theater Bar 8\nSony packed 11 drivers into the Bravia Theater Bar 8, including both side- and upward-firing drivers for a wider soundstage and better Dolby Atmos playback. If you have a Sony TV, the soundbar and its built-in speakers can work together to create an audio system tuned for even clearer-sounding dialogue.\n\nWhere to Buy: $999.99 $798 at Amazon $999.99 $799.99 at Best Buy $999.99 $799.99 at Sony\n\nJBL’s Charge 6 is marked down to an all-time low of $129.95 ($70 off) at Amazon, Best Buy, and Walmart. The powerful Bluetooth speaker carries an IP68 rating, offers up to 28 hours of playback per charge, and uses JBL’s AI Sound Boost tool to prevent distortion at higher volumes. You can also plug your phone into its USB-C port and use it as a battery pack, but JBL says it can’t be used to top off a laptop.\n\n\n\nThe&nbsp;JBL Flip 7 has returned to its all-time low of around $109.95 ($40 off) at&nbsp;Amazon,&nbsp;Best Buy, and&nbsp;REI. The portable Bluetooth speaker features several notable upgrades over its&nbsp;predecessor, including a more rugged design, an enhanced tweeter, and an additional two hours of playtime. It also features JBL’s AI Sound Boost technology, which can boost the speaker’s volume without introducing distortion, as well as a PushLock system that lets you attach interchangeable accessories, such as the included wrist strap.\n\nEcho Pop\nThe Echo Pop is one of Amazon’s smallest Alexa-enabled smart speakers. It offers a unique semisphere form factor and can function as an Eero mesh Wi-Fi extender.\n\nWhere to Buy: $39.99 $21.99 at Amazon $39.99 $21.99 at Best Buy $39.99 $21.99 at The Home DepotUltimate Ears Wonderboom 4\nThe Wonderboom 4 might feature a compact design, but it still delivers big sound for its diminutive size. It also carries an IP67 rating, meaning it’s both water and dust-resistant (it can even float if you need it to).\n\nWhere to Buy: $99.99 $59.99 at Amazon $99.99 $59.99 at Best Buy\n\nThe Bose SoundLink Plus is on sale for $189.99 ($80 off) at Amazon and Best Buy, which is its best price to date. Despite being about the size of a 20-ounce water bottle, it delivers loud, impressive sound with a rugged IP67 build and USB-C charging. It supports multipoint Bluetooth connectivity and, unlike the Micro, doubles as a 15W power bank, with longer battery life that lasts up to 20 hours. Read our review.\n\n\n\nThe new Echo Dot Max is on sale for $89.99 ($10 off), its best price to date, at Amazon, Best Buy, and Target. The snappy smart speaker delivers significantly improved audio compared to its predecessor,&nbsp;the fourth-gen Echo, delivering richer bass and a crisper sound. It also supports Matter, Thread, and Zigbee, and comes with Alexa Plus enabled out of the box. Read our review.\n\n\n\nThe latest Bose SoundLink Micro is on sale for a new all-time low of $109 ($20 off) at Amazon and Best Buy. The rugged Micro is the brand’s smallest Bluetooth speaker, but it still offers big sound and up to 12 hours of battery life. The second-gen model also features a USB-C charging port, an IP67 rating for full water and dust resistance, and a handy utility strap, so you can clip the speaker to your bag using a carabiner.\n\nBose TV Speaker\nThe Bose TV Speaker delivers a rich, immersive sound in a compact design. It features a three-speaker setup, a dedicated dialog mode, and Bluetooth connectivity, so you can use the soundbar to listen to music or podcasts.\n\nWhere to Buy: $279 $199 at Amazon $279 $199 at Bose $279 $199.99 at Best Buy\n\nAnother soundbar that delivers surprisingly full sound and Dolby Atmos performance for its size is the Bose Smart Ultra Soundbar. It’s currently priced at around $699 ($200 off) for Black Friday at Amazon, Walmart, and Best Buy, which is its best price to date. It sounds great with both movies and music, and has a nice slim profile that’s low enough for practically any TV.\n\nSonos Beam (second-gen)\nThe latest Sonos Beam fits into the middle of Sonos’ soundbar lineup. It supports Dolby Atmos through virtualized surround sound and offers eARC compatibility with newer TVs. Read our review.\n\nWhere to Buy: $499 $349 at Amazon $499 $349 at Best Buy $499 $349 at Sonos\n\nThe Sonos Era 100 is the company’s entry-level smart speaker, one you can grab for $169 ($50 off) at Amazon, Best Buy, and B&amp;H Photo. The speaker has a single woofer and two tweeters, which allows it to play music in stereo — though you’ll get a far wider soundstage by pairing two Era 100s together. You can stream music to it over Bluetooth or Wi-Fi, or connect it to a turntable if you pick up an optional 3.5mm to USB-C adapter. Read our review.\n\nSonos Roam 2\nLike its predecessor, the Sonos Roam 2 is a compact and travel-friendly Bluetooth speaker that easily syncs up with Sonos’ home audio ecosystem via Wi-Fi. While it looks much like the original, the Roam 2 has some small quality-of-life improvements, like a separate button for Bluetooth connections. Read our hands-on impressions.\n\nWhere to Buy: $179 $139 at Amazon $179 $139 at Best Buy $179 $139 at Sonos\n\nYou can pick up Sonos’ Era 300 at Amazon, Best Buy, and B&amp;H Photo for $379 ($100 off), which is $20 shy of the smart speaker’s lowest price to date. It offers the same connectivity options as the aforementioned Era 100, plus the ability to play Dolby Atmos audio with surprising depth. You can also use a pair of them as rear speakers in a surround sound system when connected to a Beam 2 or Arc Ultra soundbar. Read our review.\n\nTribit StormBox Micro 2\nThe latest version of Tribit’s StormBox Micro is a compact Bluetooth speaker that delivers impressive sound for its size and features a built-in strap for attaching to to various objects. \n\nWhere to Buy: $69.99 $49.99 at Amazon (with Prime) $69.99 $51.99 at TribitSonos Move 2\nWith double the battery life of its predecessor and better-sounding stereo audio, the Sonos Move 2’s improvements don’t stop there. It supports line-in audio, can stream Bluetooth audio to other Sonos speakers, and more. Read our review.\n\nWhere to Buy: $499 $399 at Amazon $499 $399 at Best Buy $499 $399 at Sonos\nLaptop deals\nMicrosoft Surface Laptop, 13-inch\nMicrosoft’s slightly smaller, entry-level Surface Laptop trims some of the size and a few features from its bigger 13.8-inch counterpart, but it maintains excellent battery life and solid performance. Read our review.\n\nWhere to Buy: $899.99 $549.99 at Amazon $899.99 $549.99 at Best Buy\n\nIn addition to the base-model 13-inch Surface Laptop hitting a new low of $549.99 ($350 off) at Best Buy and Amazon, and the same model with 512GB storage is $749.99 ($250 off) at Amazon.\n\n\n\nIf you want a Surface with a slightly bigger, nicer display and a higher-end Snapdragon X Elite processor, the Surface Laptop 7th Edition (13.8-inch) from 2024 is on sale for $899.99 ($500 off) at Best Buy and Amazon. It’s still a great machine if you prioritize battery life on Windows and want a nice screen with a 120Hz refresh rate and 2304 x 1536 resolution. Read our review.\n\n\n\nLenovo’s Legion 5 gaming laptop is a well-rounded entry-level gaming laptop with a unique twist: it has a 16:10 aspect ratio OLED screen and costs just $999.99 at Walmart during Black Friday. Its specs can’t run every game at high settings, but it’s no slouch, either, with its AMD Ryzen 7 260 AI processor, RTX 5060 GPU, 16GB of DDR5 RAM, and 512GB SSD.\n\nMicrosoft Surface Pro 12-inch\nMicrosoft’s latest Surface Pro is smaller, with a new design and updated keyboard. It’s powered by Qualcomm’s Arm64 Snapdragon X Plus chip. Read our review.\n\nWhere to Buy: $799.99 $649.99 at Amazon $799.99 $649.99 at Walmart $799.99 $649.99 at Best Buy\n\nMicrosoft’s flagship 13-inch Surface Pro is also on a big discount, selling for as low as $749.99 ($450 off) at Microsoft with a 10-core Snapdragon X Plus chip, 16GB of RAM, and 512GB SSD. It’s quite a deal, though the keyboard and stylus are sold separately. The convertible tablet has great battery life and solid performance.\n\n\n\nThe Asus Zenbook A14 is selling for an all-time low of $549.99 ($450 off) at Best Buy. If you want a super-light laptop with an Arm-based Snapdragon chip for long battery life, the Zenbook is an impressive offering — especially since it has an OLED display to boot. I first handled this thing at CES, and the combination of its lightweight 2.4-pound chassis, unique finish with earthy colors, port selection, and OLED screen was really impressive. Now, at this price? It’s quite compelling.\n\n\n\nI’m currently testing the 14-inch HP OmniBook 5 and liking it, especially for the value it offers. It’s very affordable for a laptop with an OLED display and marathon battery life, and it’s just $529.99 ($170 off MSRP) at Amazon and direct from HP. Its base Snapdragon X1 Plus chip isn’t very speedy, but it’s manageable if you’re not going too wild on multitasking. But the star of the show is this nice 1920 x 1200 OLED panel for such a low, low price.\n\nAsus ROG Zephyrus G14 (2025)\nAsus’ ROG Zephyrus G14 is the go-to choice for a portable gaming machine that’s great at regular laptop duties. It’s got a lovely OLED display, great keyboard and trackpad, and solid battery life. The base model with RTX 5060 graphics is fairly thin at around 0.63 inches, while the highest-end model with RTX 5070 Ti is a little thicker.\n\nWhere to Buy: $1799.99 $1299.99 at Best Buy (5060) $2099.99 at Asus (5070) $2399.99 $1999.99 at  Best Buy (5070 Ti)\n\nThe base Asus ROG Strix G16 gaming laptop with a last-gen Intel Raptor Lake 14650HX CPU, RTX 5060 GPU, 16GB of RAM, and 1TB SSD is $1,199.99 ($300 off) at Amazon. For a higher-end model that doesn’t skyrocket in price, the Strix G16 with AMD Ryzen 9 8940HX and RTX 5070 Ti is $1,599.99 ($400 off) at Best Buy. Strix models are much chunkier than their ROG Zephyrus cousins, but they’re a better deal if you prioritize performance over portability.\n\nLenovo Legion Pro 7i (16-inch, Intel)\nLenovo’s Legion Pro 7i is a well built gaming laptop with a lovely 2.5K OLED display and a powerful RTX 5080 GPU, enough to handle 4K gaming on an external monitor. It’s only major downsides are a lack of face or fingerprint unlocking and Lenovo’s tendency to pre-load some annoying bloatware.\n\nWhere to Buy: $3559.99 $2499.99 at Best Buy (RTX 5080, 1TB SSD) $3499 $2249 at B&amp;H Photo (RTX 5080, 2TB SSD) $3559.99 $2346.49 at Lenovo (RTX 5080, 1TB SSD)\n\nThe Lenovo Legion 7i above is one of my preferred gaming laptops if you like a beefy boy with high-end RTX 5080 graphics, but a solid alternative for less is the similarly-specced HP Omen Max 16. The Omen Max 16 with RTX 5080 graphics, 32GB of RAM, and 1TB SSD is just $1,999.99 ($1,300 off) direct from HP. It’s also at Best Buy with a 2TB SSD for $2,599.99 ($560 off), but the one at HP is the screaming deal that you should nab before it’s gone (you can always do your own SSD upgrade later).\n\nHP Victus 15 (2025, RTX 4050)\nThe Victus 15 is a popular, budget-friendly gaming laptop that now comes with RTX 4050 graphics, more RAM, and an improved 144Hz screen.\n\nWhere to Buy: $1049.99 $599 at Walmart (Intel) $899.99 $549.99 at Best Buy (AMD)Razer Blade 16 (2025, RTX 5090)\nRazer’s latest and greatest version of its Blade 16 laptop returns to a thinner, more travel-friendly chassis. It comes with RTX 50-series GPU options but each configuration features an excellent OLED display. Read our review.\n\nWhere to Buy: $2399.99 $1599.99 at Razer (RTX 5060) $2799.99 $1899.99 at Razer (RTX 5070) $3499.99 at Razer (RTX 5080)Acer Chromebook Plus Spin 514 (2025)\n\nWhere to Buy: $699 $599 at Best Buy $799.99 $769.99 at Acer\n\nThe closest competitor to the Acer Chromebook Plus Spin 514 is the Lenovo Chromebook Plus 14, which is on sale for a new low of $599.99 ($50 off) direct from Lenovo. It’s the base model with a non-touch OLED display, 12GB of RAM, 128GB of storage, and the power-sipping MediaTek Kompanio Ultra 910 processor. The higher-end $749 model with a touchscreen that I tested in my review is slightly better, but these kinds of Chromebooks rarely go on sale.\n\n\nGaming deals\nMeta Quest 3S\nThe Meta Quest 3S is a battery-powered standalone VR headset runs the same chipset as the pricier Quest 3, along with the lenses and screen resolution as the Quest 2. It can also be connected to a PC to play VR games like Half-Life Alyx. Read our review.\n\nWhere to Buy: $299 $249 at Best Buy (128GB, with $50 gift card) $399.99 $329.99 at Best Buy (256GB, with $50 gift card) $399.99 $329 at Amazon (256GB, with $50 credit)PlayStation Portal\nThe PlayStation Portal is a handheld that allows you to stream games from your PS5 over the same network, or the cloud for certain titles if you have a PS Premium Plus subscription. The Portal has an 8-inch 1080p display with a 60Hz refresh rate, serviceable speakers, and a long-lasting battery. It also supports DualSense features, including haptic feedback and motion sensing. Read our review. \n\nWhere to Buy: $199.99 $178.99 at Amazon $199.99 $179 at Walmart $199.99 $179.99 at Best BuySony DualSense Edge\nSony’s pro-style controller, the DualSense Edge, might suffer from shorter battery life than the standard DualSense model, but it features great software integration with the PlayStation 5 and plenty of customizable components. Read our review.\n\nWhere to Buy: $199.99 $159.99 at Amazon $199.99 $169.99 at Best Buy $199 $159 at Walmart\n\nNintendo’s big wave of Black Friday discounts has arrived, knocking $30 off several fantastic Switch titles that every owner should consider playing. Games like Super Mario Odyssey, Splatoon 3, and others are $30 instead of $60. Some of these price drops aren’t unprecedented, but the timing is good if you’re getting a Switch 2, as some titles have free Switch 2 upgrades that boost visual fidelity. Also, many of the Zelda-themed amiibo that launched alongside Nintendo’s new console are just $10, down from $30.\n\n\n\nWalmart has discounted the G7 HE Wired Xbox Controller to $37 ($13 off) when you sign in with your Walmart account, which is a new low. The wireless controller features drift-resistant Hall effect joysticks, Hall effect magnetic triggers, and Hall effect analog triggers. You can use GameSir’s Nexus app (available on PC and the Xbox store) to remap buttons and make other adjustments to optimize it for your favorite games.\n\nSteam Deck (LCD)\nThe Steam Deck is a portable handheld console you can use to play PC games. Read our review.\n\nWhere to Buy: $399 $319.2 at Steam (256GB)\n\nThe 32-inch Asus ROG Swift 4K (model PG32UCDM) is one of the most feature-packed OLED gaming monitors on the market, with a 240Hz refresh rate, 90W USB-C charging, a glossy screen coating, and a built-in KVM switch that lets you control different computers with a single mouse and keyboard. Right now, it’s down to $899 at Amazon, which is a big drop from its usual price of $1,299 (nobody tell Nathan Edwards).\n\n\n\nThe Backbone Pro can turn any smartphone or smaller tablet with a USB-C port into a more effective handheld, and it’s fallen to a new low of $134.99 ($35 off) at Amazon, Best Buy, and Backbone’s online store. The controller has an Xbox-like button layout, plus a pair of remappable rear buttons. It’s also compatible with games available on the App Store and Google Play Store, as well as cloud-based titles that are streamable via Xbox Game Pass. The Pro is Backbone’s first controller to support Bluetooth, too, which allows you to use it with everything from a Stream Deck to the latest smart TVs.\n\n\n\nIf you have (or soon plan to buy) a Nintendo Switch 2, you may need a microSD Express card if you foresee quickly expanding beyond the console’s internal 256GB of storage, as it’s the only kind of storage you can run Switch 2 games off of. Fortunately, Samsung’s 512GB P9 is down to its lowest price yet, selling for $74.99 (was $99.99) at Amazon.\n\n8BitDo Ultimate 2 Bluetooth Controller\nIf you want something cheaper — and in some ways better — than Nintendo’s official Pro controller, there’s 8BitDo’s Ultimate 2, which works with the original Switch and Switch 2. It features TMR joysticks with trigger switches for adjusting the feel, as well as vibration and motion-control support.\n\nWhere to Buy: $69.99 $55.99 at Amazon (white) $69.99 $55.99 at Amazon (black)8BitDo 64 Bluetooth controller\nThe 8BitDo 64 Bluetooth controller apes the Nintendo 64’s unusual design in a more traditional layout. However, while it’s great for playing old school N64 games, the lack of a second joystick limits its compatibility with modern titles.\n\nWhere to Buy: $39.99 $26.12 at Amazon (black) $39.99 $38.63 at Amazon (white)\n\nIf you’re looking for a new DualSense Wireless Controller, whether for your PlayStation 5, PC, or Steam Deck, every color scheme is $20 off for Black Friday. The adorable “Joyful” model, inspired by Astro Bot, is down to around $64 at Walmart and Best Buy, or, for a simpler look, you can peruse the many color options available at Amazon and Best Buy starting at $54.99 (previously $74.99).\n\nPlayStation 5 Pro\nThe “pro” version of Sony’s PlayStation 5 has a bigger GPU, new PSSR AI-based upscaling, advanced ray tracing, and 2TB SSD (with expandable storage). The new features allow for better graphics at higher frame rates, allowing for the blending of “fidelity” and “performance” modes in some games. Read our review.\n\nWhere to Buy: $749 $648.99 at Amazon $749 $649 at Walmart $749 $649.99 at Target\n\nIf your library of physical Nintendo Switch games is growing, you can easily store them in the&nbsp;Jsaux Game Card case for Nintendo Switch 2. Right now, it’s down to $15.99 ($10 off) at&nbsp;Amazon&nbsp;(with Prime) and&nbsp;Jsaux’s online storefront. The carrying case provides 40 dedicated slots for storing both game cartridges and microSD cards, so you can easily carry your collection of physical and digital titles. The case measures around 6 inches wide and is made of durable hardshell plastic, so your games stay protected in your bag.\n\n\nBoard game deals\nCatan (6th Edition)\nIn Catan, up to four players strategically compete and trade for resources. The iconic board game ends when one player reaches 10 “victory points,” which is achieved by constructing a sprawling civilization of roads, settlements, and cities using sheep, ore, wheat, and wood. \n\nWhere to Buy: $54.99 $24.99 at Amazon $54.99 $24.99 at Target $54.99 $27.5 at Walmart\n\nYou can pick up Monopoly Deal on sale for $5.59 (about $3 off) at Amazon, which is one of its best prices to date. To win in this card game, players must be the first to collect three property sets using cards that correspond to spaces on the Monopoly board. There are no dice to roll like there are in the board game, but action cards let you collect rent, steal, or swap properties to get ahead. It also takes about 45 minutes to play, which is far more approachable than an actual game of Monopoly.\n\n\n\nCodenames is on sale at&nbsp;Amazon&nbsp;right now for $15.95 ($9 off), which is about $1 shy of its best price to date. In the excellent party game, you give your teammates one-word clues to help them figure out which tiles you’re referring to on the board without accidentally pointing them toward the opposing team’s tiles.\n\nExploding Kittens (Party Pack)\nExploding Kittens is a two-to-10-person game wherein each player continually draws cards until one person draws an Exploding Kitten. If the player doesn’t have the proper diffuse or action card, they’re out. You can play defensively by using cards that skip your turn or prevent another player from playing an action card. The last person to avoid an explosion wins.\n\nWhere to Buy: $29.99 $14.99 at Amazon $29.99 $14.99 at WalmartAzul\nAzul is a game in which you arrange patterned tiles in order to create the most beautiful tapestry possible. Arranging tiles in a strategic sequence will help you build your score while limiting your opponents’ ability to grow theirs. \n\nWhere to Buy: $39.99 $21.49 at Amazon $39.99 $21.49 at Target\nLego deals\nLego Boarding the Tantive IV\nThis 502-piece set re-creates the heart-stopping scene when Darth Vader and a platoon of Stormtroopers board the Tantive IV in the original Star Wars. It comes with seven minifigures, including the formidable Lord of the Sith and two Rebel fleet troopers. You can also flick a lever to “blast” open the main door.\n\nWhere to Buy: $54.99 $38.49 at Amazon $54.99 $38.49 at TargetLego Animal Crossing Fly with Dodo Airlines Airport\nThis kid-friendly, 292-piece playset is a nice little homage to Animal Crossing New Horizons, especially if your kiddo or someone you know has a soft spot for planes… or extinct, flightless birds.\n\nWhere to Buy: $37.99 $22.79 at Amazon $37.99 $22.99 at Target $37.99 $22.79 at Best Buy\n\nIf you want to spruce up your desk without having to worry about keeping real plants alive, Amazon has your back by discounting Lego’s Botanicals Mini Bonsai Trees Building Set to its all-time low of $44.99 ($20 off). The 709-piece set comprises three bonsai trees and a pair of ornamental stands, so you can arrange them at different heights. You can also swap around their leaves to leave the trees looking fresh.\n\n\n\nLego’s Super Mario Captain Toad’s Camp Building set is a 159-piece kit that’s perfect for any fan of the Mushroom Kingdom, and it’s $11.99 ($3 off) at Amazon, Best Buy, and Target. It comprises Captain Toad himself along with a tent cooking equipment, and a structure to explore. Just be sure to avoid the Goomba!\n\n\n\nLego’s City Robot World Roller Coaster set puts an interactive theme park ride on your desk, and it’s $69.99 ($30 off) at Amazon . The 986-piece set includes a three-car coaster along with a mech suit, mini figures of park patrons, arcade cabinets, and several accessories — including slushy cups and toy cell phones.\n\nLego Botanicals Mini Bonsai Trees set\nLego’s 709-piece kit lets you construct three brick-ified bonsai trees, including a black pine, a ginkgo with yellow leaves, and a wisteria with hanging lilac flowers. It also comes with three ornamental displays, just in case you want a raised stand on which to showcase them.\n\nWhere to Buy: $64.99 $44.99 at Amazon $64.99 at LegoLego NASA Apollo Lunar Roving Vehicle &#8211; LRV\nWho doesn’t love space? Lego’s 1,913-piece version of the Apollo Lunar Lander includes brick-ified versions of sensors, tools, and a battery pack with heating and cooling elements. It also comes with a miniature plaque displaying statistics about NASA’s actual LRV, which serves as a nice complement to the completed kit.\n\nWhere to Buy: $219.99 $153.99 at Amazon $219.99 $153.99 at Target\n\nLego’s Icon Pac-Man Arcade building set is a throwback to one of the most iconic arcade cabinets of all time, and it’s down to $188.99 ($81 off), a new all-time low at Amazon. The 2,651-piece set allows you to build a pretty solid replica of the arcade cabinet, complete with a light-up coin slot, movable joystick, and pushable buttons. \n\n\n\nIf you’re a fan the dark knight, Lego’s Batman Mech Armor set makes for a great little showpiece, and it’s $11.99 ($3 off) at Amazon and Best Buy. The 140-piece kit includes a brick version of Batman himself, and a set of mech armor that can launch studs from one of its arms. The mech’s limbs are jointed, so you can change its pose, and equip it with its own batarang to match Batman’s.\n\n\nOther Verge favorites\nBaseus Free2Pull Retractable USB-C Cable 100W\nBaseus’ slick USB-C charger supports 100W passthrough and takes a puck-like form when not in use, with male connectors on either side that retract inward with a quick tug.\n\nWhere to Buy: $16.99 $9.96 at Amazon (3.3-foot) $21.99 $15.19 at Amazon (6.6-foot) $16.99 $11.89 at Baseus (3.3-foot)ChomChom Roller Pet Hair Remover\nThe ChomChom is a reusable roller that works great for removing unwanted pet hair from furniture, allowing you to skip lint rollers, vacuuming, and other cleaning tools in a pinch.\n\nWhere to Buy: $27.99 $14.7 at Amazon $31.95 $24.99 at Chewy\n\nThe 2024 Tile Pro is on sale at Amazon and Best Buy for $24.99 (about $11 off), which is just $2 shy of its all-time low. The handy location tracker is our top pick for Android users, but it also works well with iOS devices. While it’s not quite as precise as Apple’s AirTag, it can still help you keep tabs on your belongings from up to 500 feet away. And if you subscribe to the $14.99-per-month Life360 Gold plan, it can even send SOS alerts.\n\n\n\nIf you’re having trouble falling asleep, a sunrise alarm clock can help bring calm to your bedtime routine. Thankfully, you can snag the Hatch Restore 3 from Hatch’s online storefront for an all-time low of $139.99 ($30 off) through December 1st (discount applies at checkout). The Restore 3 features more than 50 sleep sounds and 18 adjustable light colors, with access to hundreds more through the optional Hatch Plus subscription, which runs $4.99 per month or $49.99 per year.\n\n\n\nNeed a powerful travel adapter for all of your USB-C devices? Tessan’s 140W travel charger supports one plug (it supports types C, G, A, and I), and it features three USB-C ports and one USB-A port. You can get up to 140W max by using the USB-C ports labeled C1 and C2, making it a great pick for gaming devices, tablets, and even some laptops. It’s down to $53.99 at Amazon from its original $77 price.\n\nLifeStraw personal water filter\nLifeStraw’s basic filter removes unwanted viruses, bacteria, and microplastics as you drink, giving you a safe way to hydrate no matter where you are.\n\nWhere to Buy: $17.95 $9.99 at Amazon $17.95 $9.99 at Walmart\n\nThe Nomad Tracking Card Air is currently down to $22 ($7 off) at Nomad’s website. The tracker is about the size of two standard credit cards smashed together (it’s officially 1.7mm thick), so it should have no problem slipping into the slimmest of wallets. It features a sturdy polycarbonate body that can withstand daily wear, as well as integration with Apple’s robust Find My network. That means that if you lose it, you can view its last known or current location in the Find My app.\n\n\n\nCriterion Collection 4K Blu-rays, 1080p Blu-rays, and DVDs are up to 50 percent off at Barnes &amp; Noble and Amazon right now. The sale at Barnes &amp; Noble runs through December 7th, giving you a great opportunity to stock up on physical media. Some of the titles on sale include Michael Mann’s Thief, starring the late, great James Caan, and Céline Sciamma’s Portrait of a Lady on Fire.\n\n\n\nIf you’re an avid concert goer who’d like to retain your hearing later in life — and who wouldn’t? — Loop’s ultra-comfortable Experience 2 earpugs are on sale at Amazon for $27.95 ($11 off), matching their best price to date. The stylish earplugs won’t reduce noise as effectively as a custom set; however, they do carry a noise reduction rating of 12dB, which is totally adequate for that occasional Turnstile set.\n\nHoto 3.6V Electric Screwdriver Kit\nHoto’s electric screwdriver is perfect for making small- to medium-sized repairs around the house. In addition to a USB-C port, the screwdriver comes with a magnetic case and 25 steel bits.\n\nWhere to Buy: $79.99 $29.99 at Amazon $79.99 $59.99 at HotoRay-Ban Meta (Gen 1) smart glasses\nDeveloped in partnership with Ray-Ban, Meta’s last-gen smart glasses can perform a range of tasks. They can capture 1080p video and play music, and thanks to a suite of AI-based features, you can even use them to translate from a myriad of languages in real time. Read our review.\n\nWhere to Buy: $299 $238.99 at Amazon $299 $239.2 at Best Buy $299 $239.2 at TargetNinja Creami Scoop &amp; Swirl\nNinja&#8217;s clever 2-in-1 machine can spin up soft serve and traditional hard scoops in a few easy steps, not to mention creamy milkshakes, gelato, and frozen yogurt. \n\nWhere to Buy: $349.99 $279.99 at Amazon $349.99 $279.99 at Best Buy $349.99 $279.99 at SharkNinja\n\nIf you’re planning on going camping next year, Amazon and Anker have marked the Solix C2000 down to $679.16 ($181 off). The 2,400W generator is equipped with five AC outlets and a 2,048Wh battery that can power a fridge for up to 32 hours, a Wi-Fi router for up to 105 hours, or a TV for over 16 hours. It also has a TT-30 port for powering an RV, plus three USB-C ports and a USB-A port for charging smartphones, tablets, laptops, and other portable gadgets. Also great for a power outage at home. It can be charged through the wall or solar panels.\n\n\n\nHeadspace is offering 50 percent off an annual subscription, bringing the price down to $34.99 ($35 off) through December 4th. The discount only applies to your first year; after that, the subscription will renew at full price. Headspace offers access to guided meditations, online therapy, mental health coaching, and more. At a time when the world feels more dire than ever, Headspace can help bring some calm to your daily life.\n\nCoway Airmega AP-1512HH Mighty air purifier\nCoway’s surprisingly efficient Airmega AP-1512HH Mighty is compact enough to fit in any corner of your home and offers a three-stage filtration system, including a true HEPA filter.\n\nWhere to Buy: $239.99 $142.99 at Amazon (white) $239.99 $142.99 at Amazon (black) $239.99 $142.99 at CowayAnker MagGo Wireless Charging Station (3-in-1, Dock Stand)\nAnker’s MagGo Wireless Charging Station features a MagSafe charging stand, a Qi wireless charging pad, and an Apple Watch charger, allowing you to charge three devices simultaneously. It also comes with a 40W USB-C power adapter and cable.\n\nWhere to Buy: $89.99 $75.99 at Best Buy $89.99 $75.99 at Amazon $89.99 $75.99 at Anker (with code WSPDV2OAFIC6)\n\nThe 15-inch Skylight Calendar is an excellent tool for organizing multiple schedules without sending people reminders, and it’s currently on sale for $239.99 ($60 off) directly from Skylight. Once an event is added to the calendar, it’s automatically synced with other people’s devices, whether they use Apple’s Calendar app, Google Calendar, Outlook, or other popular services. Color coding makes it easy to see whose event it is at a glance, too, whether you’re looking at your device or the Skylight itself.\n\n\n\nMasterClass is currently offering a 50 percent discount on any annual subscription, knocking the price of its least expensive plan to $50. The e-learning platform allows you to watch videos courses taught by famous people in their field, including Amanda Gorman, Ringo Starr, David Lynch, and Kevin Hart. You can take courses at your own pace, and re-watch lessons as many times as you’d like. \n\n\n\nWarmups and post-workout cooldowns are easy to skip, but the Theragun Mini Plus may help you look forward to them. Fortunately, Amazon, Best Buy, and Target have all marked the triangle-shaped massage gun down to around $237.99 ($62 off) for Black Friday. The Theragun Mini Plus can operate at three temperatures and vibration levels to help provide relief. Presets available within Theragun’s app can also help you optimize pressure and speed based on the part of your body that you’re working on.\n\nSlice Auto-Retractable Box Cutter\nSlice’s retractable, finger-friendly ceramic blade is great for tearing through packing tape and cutting plastic wrapping. The comfy tool also features a sturdy, reinforced nylon handle and a hooked design that makes it easy to stow when not in use.\n\nWhere to Buy: $28.04 $15.76 at Amazon (with on-page coupon)Xreal One smart glasses\nThe Xreal One aren&#8217;t the most affordable augmented-reality glasses available, but they are some of the best for displaying movies and games on the go. You can connect them via USB-C to your smartphone, tablet, or handheld gaming PC.\n\nWhere to Buy: $499.99 $399.99 at Amazon $499.99 $399.99 at Xreal\n\nIf you want a convenient, compact way to connect older accessories to your new Mac Mini, Best Buy has discounted Satechi’s Mac Mini M4 Hub down to a new low of $69.99 ($30 off). The USB-C hub sits below your Mac Mini without restricting airflow, and has three USB-A ports, an SD card reader, and an M.2 NVMe SSD slot. It’s an easy, tool-free way to make extra storage accessible to your Mac Mini without plugging in a portable SSD.\n\n\n\nAnker’s 10,000mAh Power Bank, a solid 30W battery pack, is currently on sale for $29.99 ($15 off) at&nbsp;Amazon and&nbsp;Anker’s online storefront. The power bank has nearly enough juice to top off an iPhone 15 Pro twice, and it can charge two devices simultaneously using its built-in cable and USB-C port. It’s also a power adapter that can plug directly into an outlet.\n\nAnker 140W 2-in-1 USB-C to USB-C Cable\nWhy settle for a flimsy USB-C cable that can only charge a single gadget when you can opt for a braided one designed to charge two at once? Anker’s two-headed cable supports charging speeds of up to 140W split between two gadgets.\n\nWhere to Buy: $22.99 $15 at Amazon (black) $22.99 $12 at Amazon (white) $22.99 $15 at AnkerFellow Stagg EKG Electric Kettle\nFellow’s handsome gooseneck kettle lets you easily choose your desired water temperature and coffee time via a colored LCD display and built-in stopwatch, making it an ideal companion for pour-over connoisseurs everywhere.\n\nWhere to Buy: $179.95 $143.95 at Amazon $179.95 $143.95 at Fellow $179.95 $143.95 at Williams Sonoma\n\nYou can buy the Insta360 X5 at Amazon, Best Buy, and directly from Insta360’s online storefront for a new low price of $464.99 ($85 off), with Insta360 throwing in a free hardshell case. The 360-degree action camera delivers sharper, more detailed images than its predecessor with improved low-light performance. Specifically, it now allows you to capture 4K footage at up to 120fps instead of 100fps, and shoot 8K video at up to 30fps or 5.7K at 60fps, while offering support for user-replaceable lenses with a $29.99 kit. Read our review.\n\n\n\nNomad’s ChargeKey V2 is a six-inch USB-C cable with a loop that allows you to attach it to your keyring, and it’s available for around $21.75 ($7.25 off) from Amazon (with Prime) and Nomad. The cable can carry up to 240W of power —&nbsp;enough to charge most laptops at their fastest speed — and data at up to 10Gbps. The accessory is a convenient way to make sure you never leave home without a charging cable.\n\n\n\nSmoked food is delicious, but can be intimidating to cook yourself. Brisk-It’s Zelos-450 Electric Smoker lets you manage all of its settings using an app on your phone, has beginner-friendly, guided recipes, and it’s $293.14 ($156.85 off) at Amazon for Prime members. We’ve tried the pellet smoker ourselves, and found it very easy to use — even on stressful cooking days like Thanksgiving.\n\nGlocusent Neck Reading Light\nGlocuscent’s rechargeable book light hangs around your neck to illuminate whatever you’re reading, while offering adjustable brightness and warmth settings.\n\nWhere to Buy: $38.99 $15.99 at AmazonAnker Laptop Power Bank\nAnker’s 25,000mAh power bank sports two built-in USB-C cables (one of which is retractable), plus one USB-C and USB-A port. It tops out at 165W when charging two devices simultaneously, or 130W when charging three or four.\n\nWhere to Buy: $119.99 $87.99 at Amazon $119.99 $87.99 at Best Buy $119.99 $87.99 at AnkerTwelve South PowerBug\nPart wall wart, part magnetic wireless charger, the StandBy-ready PowerBug is about as unique as chargers come. The simple device can top off MagSafe and Qi2-compatible devices — including the latest Google Pixel models — while supplying 35W charging speeds to a second gadget via USB-C.\n\nWhere to Buy: $49.99 $39.99 at Amazon (black) $49.99 $39.99 at Twelve South $49.99 $39.99 at Amazon (white)\nUpdate, November 28th: Updated to include several new deals, including those for the Loop Experience 2 earpugs and Baseus Free2Pull charger.",
      "content_length": 77661,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "USA setzen alle Asylentscheidungen aus",
      "link": "https://www.tagesschau.de/ausland/amerika/usa-migrationspolitik-asylentscheide-100.html",
      "published": "2025-11-29T06:17:00",
      "content": "   Die US-Einwanderungsbehörde hat Entscheidungen über Asylanträge gestoppt. Präsident Trump hatte die Verschärfung der Migrationspolitik nach Schüssen auf Nationalgardisten in Washington angekündigt. Der mutmaßliche Schütze stammt aus Afghanistan.[mehr]",
      "content_length": 254,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Global ‘Free Marwan’ campaign calls for Palestinian political leader’s release",
      "link": "https://www.theguardian.com/world/2025/nov/29/free-marwan-barghouti-global-campaign-palestinian-leader",
      "published": "2025-11-29T06:00:33",
      "content": "Locked away in prison for decades, Marwan Barghouti is a longstanding advocate for a two-state solutionA global campaign is being launched to secure the release of Marwan Barghouti, the Palestinian prisoner seen by many as the best hope of leading a future Palestinian state, as negotiations continue in the context of the current Gaza ceasefire.The campaign, being led by Barghouti’s West Bank-based family with UK civil society support, is seeking to put the 66-year-old’s fate at the centre of the next stage of the ceasefire. Continue reading...",
      "content_length": 549,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Soon-to-be-axed 7am Manchester-London train will still run – but without passengers",
      "link": "https://www.theguardian.com/business/2025/nov/29/avanti-axed-7am-manchester-london-train-will-run-without-passengers",
      "published": "2025-11-29T06:00:33",
      "content": "Exclusive: Rail regulator pulls Avanti service from timetable from mid-December but it is needed for staff travelThe good news for rail travel between Manchester and London is that a morning train will continue to link England’s biggest cities in under two hours. The bad news: passengers will no longer be able to get onboard.The rail regulator has axed one of Britain’s fastest and most lucrative intercity services, the 7am Avanti West Coast from Manchester Piccadilly to London Euston, as part of a timetable shake-up that will take effect in mid-December. Continue reading...",
      "content_length": 580,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "At least 8,000 illegal waste sites in UK, research suggests",
      "link": "https://www.theguardian.com/environment/2025/nov/29/waste-sites-landfill-rubbish-uk-research",
      "published": "2025-11-29T06:00:31",
      "content": "Exclusive: Concerns over impact on health and environment, as well as £1.63bn in avoided landfill taxThe UK is estimated to have at least 8,000 illegal waste sites, containing approximately 13m tonnes of rubbish, research has revealed.The scale of the criminal dumping means at least £1.63bn of landfill taxes have been avoided, according to an analysis of data from the satellite company Air &amp; Space Evidence, shared with the Guardian and Watershed Investigations. Continue reading...",
      "content_length": 489,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "‘The admin’: why it’s not easy to rename streets called after Prince Andrew",
      "link": "https://www.theguardian.com/society/2025/nov/29/streets-named-after-prince-andrew-local-councils-renaming",
      "published": "2025-11-29T06:00:30",
      "content": "Councils consult on removing former prince’s name as residents report ‘embarrassment’ and ‘smirks’ when giving their addressesStreets named after Andrew, formerly known as Prince but now plain Mountbatten-Windsor, can be found from Broadstairs to Belfast to Birmingham. Roads, avenues, terraces, lanes, crescents, closes, drives and ways are all afflicted – to the dismay of some residents.In Carrickfergus, Northern Ireland, Prince Andrew Way, celebrating Mountbatten-Windsor’s 1986 marriage to Sarah Ferguson, will be purged after Mid and East Antrim council passed a motion, described by one councillor as “sad but necessary”, to rename. A public consultation is under way. Continue reading...",
      "content_length": 696,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "UK immigration status fears prompt carer to cancel benefits she is entitled to",
      "link": "https://www.theguardian.com/uk-news/2025/nov/29/immigration-status-fears-carer-cancel-disability-living-allowance-benefit",
      "published": "2025-11-29T06:00:30",
      "content": "Woman cancels all benefits including disability living allowance for daughter after policy change announcementA low-paid carer from Ghana has cancelled all the benefits she is legally entitled to, including the disability allowance one of her children receives, owing to fears about her immigration status after the policy changes announced by the home secretary.The radical changes to legal migration announced by Shabana Mahmood on 20 November will penalise those who are living and working legally in the UK, but who claim benefits. Continue reading...",
      "content_length": 555,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Jetstar cancels 90 domestic flights across Australia after global Airbus A320 recall",
      "link": "https://www.theguardian.com/business/2025/nov/29/jetstar-cancel-domestic-flights-australia-global-airbus-a320-recall",
      "published": "2025-11-29T05:36:34",
      "content": "Immediate software update ordered by Airbus after US mid-air incident causes airport disruption across Australia and New ZealandGet our breaking news email, free app or daily news podcastJetstar has grounded some of its Airbus fleet in Australia and cancelled domestic and international flights after the aerospace manufacturer ordered software changes to thousands of its A320 planes following a mid-air incident.Ninety Jetstar flights were affected on Saturday with disruption expected to continue until Sunday, the airline’s head of flying operations, Tyrone Simes, told reporters at Melbourne airport. Continue reading...",
      "content_length": 625,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "The Verge’s guide to Black Friday 2025",
      "link": "https://www.theverge.com/tech/808624/black-friday-cyber-monday-guide-2025",
      "published": "2025-11-29T05:30:59",
      "content": "\n\n\n\t\n\t\t\n\nNow that we’ve already gathered with friends and family to dine on our favorite foods, the real feast has begun. I’m talking, of course, about Black Friday and the full weekend of shopping that leads into Cyber Monday on December 1st.\n\nMany of the gadgets we recommend to readers have received steep discounts that’ll likely last throughout both events, allowing you to save on laptops, OLED TVs, noise-crushing headphones, and everything in between. If you didn’t get what you wanted during Amazon Prime Day or the retailer&#8217;s most recent sales event, now’s your chance.\n\nHowever, this holiday season could be a more costly affair than you may expect due to the ongoing tariff situation in the US; The price of Sonos speakers, video game consoles, cameras, and other goods continues to climb. The good news is that our deep, well-vetted deals coverage can help you avoid the higher price tags. We also have tips on how to find the best deals and when to shop, and we’ll continue to highlight notable discounts throughout the busy shopping weekend — regardless of which retailer you prefer.\n\n\t\t\tThe 192 best Black Friday deals you can still shop — a ton of tech is over half off\n\t\t\tThe best Black Friday deals you can still get on AirTags, iPad, and other Apple gear\n\t\t\tMy favorite Black Friday TV deals from Samsung, Sony, and others are up to 50% off\n\t\t\tYou can save 50 percent on robovacs from Roborock and Eufy for Black Friday\n\t\t\tDisney Plus, Hulu, and HBO Max are all over 60 percent off for Black Friday\n\t\t\tApple’s last-gen AirPods Pro 2 are down to their lowest price to date\n\t\t\tLG’s brilliant B5 OLED TV is already down to just $530 for Black Friday\n\t\t\tBose’s latest QuietComfort Ultra earbuds are $50 off ahead of Black Friday\n\t\t\tApple’s slim M4 MacBook Air is cheaper than ever ahead of Black Friday\n\t\t\tEvery current-gen Fitbit is already heavily discounted for Black Friday\n\t\t\tThe Meta Quest 3S is $50 off and comes with a $50 gift card and a game\n\t\t\tGoogle’s TV Streamer (4K) is down to its best price to date ahead of Black Friday\n\t\n\t\t\tBreakout Tech Deals\n\t\t\n\t\t\t\t\t\t\tEvery current-gen Fitbit is already heavily discounted for Black Friday\n\t\t\t\t\t\t\tGoogle’s TV Streamer (4K) is down to its best price to date ahead of Black Friday\n\t\t\t\t\t\t\tApple’s slim M4 MacBook Air is cheaper than ever ahead of Black Friday\n\t\t\t\t\t\t\tBose headphones and earbuds return to all-time lows for Black Friday\n\t\t\t\t\t\t\tLG’s brilliant B5 OLED TV is already down to just $530 for Black Friday\n\t\t\t\t\t\t\tBose’s latest QuietComfort Ultra earbuds are $50 off ahead of Black Friday\n\t\t\t\t\t\t\tApple’s last-gen AirPods Pro 2 are down to their lowest price to date\n\t\t\t\t\t\t\tThe Meta Quest 3S is $50 off and comes with a $50 gift card and a game\n\t\t\t\t\t\t\tThe Fire TV Stick 4K Max is back down to $35, its best price in a year\n\t\t\t\t\t\t\tThe DualSense Edge has fallen to one of the lowest we’ve seen for Black Friday\n\t\t\t\t\t\t\tApple&#8217;s AirPods Pro 3 just got their biggest discount ahead of Black Friday\n\t\t\t\t\t\t\tThe M4 MacBook Air is one of the best Apple deals you can get for Black Friday\n\t\t\t\t\t\t\tAura’s latest, gift-worthy digital photo frame is $30 off for Black Friday\n\t\t\t\t\t\t\tYou can pick up 32GB of DDR5 RAM with a whole PC for $999 for Black Friday\n\t\t\t\t\t\t\tNinja’s versatile Creami ice cream maker hits an all-time low for Black Friday\n\t\t\t\t\t\t\tThe Super Mario Galaxy bundle for the Switch is 20 percent off today only\n\t\t\t\t\t\t\tThe Ray-Ban Meta smart glasses are still at their all-time low for Black Friday\n\t\t\t\t\t\t\tThere’s still time to grab a PS5 or PS5 Pro for $100 off for Black Friday\n\t\t\t\t\t\t\tTwelve South&#8217;s magnetic PowerBug charger is 20 percent off for Black Friday\n\t\t\t\t\t\t\tThe Oura Ring 4 is still at its lowest price ever for Black Friday\n\t\t\t\t\t\t\tYou can get a four-pack of AirTags for just over $60, the lowest price ever\n\t\t\t\t\t\t\tApple&#8217;s most affordable iPad is over 20 percent off for Black Friday\n\t\t\t\t\t\t\tTessan’s 140W Universal Travel Adapter has hit a new all-time low\n\t\t\t\t\t\t\tHallmark’s Mario and Toad Christmas ornaments are less than $10 for Black Friday\n\t\t\t\t\t\t\tThe best Black Friday deals on Apple AirPods — up to 47 percent off\n\t\t\t\t\t\t\tDreame’s X40 Ultra is arguably the best robovac deal you can grab for Black Friday\n\t\t\t\t\t\t\tHBO Max is offering one of the best Black Friday deals we’ve seen this year\n\t\t\t\t\t\t\tMy favorite e-reader is at its lowest price ever for Black Friday\n\t\t\t\t\t\t\tYou can grab two months of Paramount Plus with Showtime for $2.99 a month\n\t\t\t\t\t\t\tThe best gaming headset I tried this year is $30 off for Black Friday\n\t\t\t\t\t\t\tPhilips Hue’s Festavia string lights are nearly $60 off (and still available) for Black Friday\n\t\t\t\t\t\t\tOne of our favorite Switch 2 controllers is 20 percent off right now\n\t\t\t\t\t\t\tBattlefield 6 is already 24 percent off for Black Friday\n\t\t\t\t\t\t\tMicrosoft’s latest 13-inch Surface Laptop is down to $549.99, a new record low price\n\t\t\t\t\t\t\tApple TV is over half off for six months during Black Friday\n\t\t\t\t\t\t\tApple’s AirPods 4 are on sale starting at just $69 for Black Friday\n\t\t\t\t\t\t\tYou can grab a year of Disney Plus and Hulu for just $5 a month for Black Friday\n\t\t\t\t\t\t\tSony’s last-gen XM4 headphones are over 50 percent off for Black Friday\n\t\t\t\t\t\t\tApple’s cheapest iPad is already $70 off for Black Friday\n\t\t\t\t\t\t\tThe Oura Ring 4 has dropped to its lowest price yet for Black Friday\n\t\t\t\t\t\t\tSony&#8217;s PlayStation Portal just got a rare discount for Black Friday\n\t\t\t\t\t\t\tThe Asus Falcata Hall effect split gaming keyboard is $140 off right now\n\t\t\t\t\t\t\tAmazon’s latest entry-level Kindle has fallen to a new low for Black Friday\n\t\t\t\t\t\t\tSony’s DualSense Edge is $25 off ahead of Black Friday\n\t\t\t\t\t\t\tThe best AR glasses are cheaper than ever during Black Friday\n\t\t\t\t\t\t\tThe PlayStation 5 Slim and Pro are on sale for Black Friday\n\t\t\t\t\t\t\tSony’s entire DualSense lineup is $20 off, including the limited edition models\n\t\t\t\t\t\t\tThe Steam Deck LCD is 20 percent off for Black Friday\n\t\t\t\t\t\n\t\t\t\tNews and Tips\n\t\t\n\t\t\t\t\t\t\tHow to shop like a pro during Black Friday and Cyber Monday\n\t\t\t\t\t\t\tHere are the price-matching policies for Best Buy, GameStop, and others\n\t\t\t\t\t\t\tHow to sign up for Amazon Prime\n\t\t\t\t\t\t\tHere’s when the Black Friday sales start at Walmart, Target, and other retailers\n\t\t\t\t\t\t\tHere are the shipping and return policies for all the big-name retailers\n\t\t\t\t\t\t\tNintendo&#8217;s upcoming Black Friday sale includes up to $30 off Switch classics\n\t\t\t\t\t\t\tSony is taking $100 off its PS5 consoles for Black Friday\n\t\t\t\t\t\t\tI’ve covered Black Friday deals for ten years, ask me anything\n\t\t\t\t\t\t\tI’m out of reasons to recommend Apple’s M1 MacBook Air, even at $600\n\t\t\t\t\t\n\t\t\t\tCategory Deals\n\t\t\n\t\t\t\t\t\t\tThe Apple deals worth shopping before Black Friday (and the discounts to expect)\n\t\t\t\t\t\t\tThese laptops are still steeply discounted for Black Friday — many are over $400 off\n\t\t\t\t\t\t\tMy favorite Black Friday TV deals from Samsung, Sony, and others are up to 50% off\n\t\t\t\t\t\t\tMy favorite Nintendo Switch 2 accessories are heavily discounted for Black Friday\n\t\t\t\t\t\t\tThe best Black Friday deals you can still get on AirTags, iPad, and other Apple gear\n\t\t\t\t\t\t\tSome of our favorite Blu-rays are cheaper than ever during Black Friday\n\t\t\t\t\t\t\tThese 50 handpicked Black Friday deals are still available for $50 or less\n\t\t\t\t\t\t\tHere are 40+ deals that are at an all-time low for Black Friday\n\t\t\t\t\t\t\tWe found 40 surprisingly good Black Friday deals you can still grab for $30 or less\n\t\t\t\t\t\t\tBlack Friday deals that are most popular with Verge readers\n\t\t\t\t\t\t\tDisney Plus, Hulu, and HBO Max are all over 60 percent off for Black Friday\n\t\t\t\t\t\t\tBose, Sony, and Apple headphones are cheaper than ever for Black Friday\n\t\t\t\t\t\t\tThe best Black Friday deals I’ve seen on some of my favorite smart home gear\n\t\t\t\t\t\t\tBlack Friday deals on chargers and power banks we love from Anker and more\n\t\t\t\t\t\t\tYou can save 50 percent on robovacs from Roborock and Eufy for Black Friday\n\t\t\t\t\t\t\tWe found Black Friday deals on our favorite tech, and most are under $50\n\t\t\t\t\t\t\tBose and Sony headphones are up to $200 off in the run-up to Black Friday\n\t\t\t\t\t\t\tThese Lego kits for kids and adults are up to 50% off for Black Friday\n\t\t\t\t\t\t\tSome of the best Nintendo Switch games are up to $30 off for Black Friday\n\t\t\t\t\t",
      "content_length": 8192,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "The week Europe realised it stands alone against Russian expansionism",
      "link": "https://www.theguardian.com/world/2025/nov/29/the-week-europe-realised-it-stands-alone-against-russian-expansionism",
      "published": "2025-11-29T05:00:28",
      "content": "Washington’s Putin-appeasing plan for peace in Ukraine has failed, but many heard death knell sounded for European reliance on US protectionKaja Kallas, the European Union foreign policy chief, asked her officials this week to dig up the number of times Russia had – in its various guises – invaded other states in the 20th and 21st centuries. The answer that came back was 19 states, on 33 occasions. Kallas, the former Estonian prime minister, was not just indulging in some form of historical mathematics. She was seeking to make a point that lies at the heart of the dispute between the US and Europe over Ukraine’s future, a dispute that has again revealed the chasm across the Atlantic about the true nature of the Russian regime.Kallas reads history books as a leisure activity and – drawing on her own country’s history of Soviet occupation – has long maintained that the Soviet Union fell, but its imperialism never did. “Russia has never truly had to come to terms with its brutal past or bear the consequences of its actions,” she has said, arguing that the nature of the Russian regime means “rewarding aggression will bring more war, not less”: Putin will come back for more. Continue reading...",
      "content_length": 1208,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "AfD-Jugend - Neubeginn mit rechtsextremer Begleitung?",
      "link": "https://www.tagesschau.de/investigativ/ndr-wdr/afd-jugend-generation-deutschland-gruendung-100.html",
      "published": "2025-11-29T05:00:21",
      "content": "   Kurz vor der Gründungsveranstaltung der \"Generation Deutschland\" gibt sich das Rechtsaußenlager der neuen AfD-Jugendorganisation selbstbewusst. Zur Versammlung in Gießen wollen laut WDR und NDR auch Symbolfiguren der rechtsextremen Szene kommen.[mehr]",
      "content_length": 254,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Wird die Gelbe Linie im Gazastreifen zur Dauerlösung?",
      "link": "https://www.tagesschau.de/ausland/asien/zukunft-gazastreifen-100.html",
      "published": "2025-11-29T04:47:22",
      "content": "   Es scheint nahezu Stillstand zu herrschen bei der Umsetzung des US-Friedensplans für Gaza. Damit wächst die Sorge, dass aus einer Zwischenlösung ein Dauerzustand wird, der den Küstenstreifen auf lange Sicht in zwei Hälften teilt. Von Ivo Marusczyk.[mehr]",
      "content_length": 257,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "The M4 MacBook Air is one of the best Apple deals you can get for Black Friday",
      "link": "https://www.theverge.com/gadgets/832969/black-friday-macbook-air-m4-13-15-inch-deal-sale-2025",
      "published": "2025-11-29T04:35:39",
      "content": "\n\n\n\t\n\t\t\n\nBlack Friday is packed with plenty of great Apple deals, but one of the most notable is the current discount on the latest MacBook Air. Right now, you can buy the 13-inch MacBook Air M4 with 256GB of storage at Amazon, Best Buy, and Costco starting around $749 ($250 off), which remains the laptop’s lowest price to date. If you prefer a larger display, the base 15-inch Air&nbsp;is also down to an all-time low of $949 ($250 off) at&nbsp;Amazon and Best Buy with 256GB of storage.\n13-inch MacBook Air (M4, 16GB RAM, 256GB SSD)\n\nWhere to Buy: $999 $749 at Amazon $999 $749 at Best Buy $999 $749.99 at Costco15-inch MacBook Air (M4, 16GB RAM, 256GB SSD)\nApple’s 15-inch MacBook Air with the M4 chip is nearly identical to its 13-inch sibling. However, it includes a six-speaker sound system, not four, and your choice of a free 35W Dual USB‑C Port Compact Power Adapter or 70W USB‑C Power Adapter.\n\nWhere to Buy: $1199 $949 at Amazon $1199 $949 at Best Buy\nIf you’re shopping for a laptop for everyday use, Apple’s latest entry-level MacBook Air remains our top pick. It offers everything most people need, including all-day battery life and snappy performance courtesy of Apple’s last-gen M4 processor. It also comes with twice as much base RAM as its predecessor (16GB), helping it power through productivity tasks — and even light video editing or casual gaming — with ease.\n\nAdditionally, unlike previous models, you can connect the M4 Air to two external displays with the lid open for better multitasking, whereas before the lid had to be closed. Apple also added a 12-megapixel Center Stage webcam previously reserved for the pricier MacBook Pros, which is sharper, offers a wider field of view, and keeps you centered in the frame during video calls. Overall, it’s a lightweight, dependable machine that delivers sufficient power without sacrificing portability, making it a great choice for students or anyone with less demanding needs.\n\nRead our M4-powered MacBook Air review.",
      "content_length": 1994,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "These 50 handpicked Black Friday deals are still available for $50 or less",
      "link": "https://www.theverge.com/gadgets/829553/black-friday-best-cheap-tech-deals-under-50-2025",
      "published": "2025-11-29T04:18:20",
      "content": "\n\n\n\t\n\tIf you’re traveling for the holidays, Twelve South’s AirFly Pro 2 adapter is a great buy for just $41.99. | Image: Twelve South\t\n\nBlack Friday is a great time to save on big-ticket items like 4K TVs, laptops, and headphones. But if you’re on a tight budget this holiday season, there are plenty of worthwhile deals on practical upgrades for $50 or less — think power banks, smart speakers, location trackers, and entry-level earbuds that punch above their weight. And, yeah, you can save on video games, too, even first-party Nintendo Switch titles.\n\nIf you have an extensive wish list to get through, this guide can help you check off a lot of boxes without draining your wallet. Microsoft’s Xbox Wireless Controller, for instance, is a great gift for multiplatform gaming. If you’re looking for a way to spend cozy nights, you can also save on a 4K version of Peter Jackson’s masterful Lord of the Rings trilogy. Then there’s UE’s Miniroll speaker and the noise-canceling CMF Buds Pro 2, which will let you take your holiday playlist on the go. There are a lot of great choices on sale below… if you act fast.\n\n\n\nXbox Wireless Controller\nWhile the Xbox Wireless Controller lacks more advanced features like customizable buttons and sensitivity adjustments, it continues to set the standard for how a controller should look, feel, and work. To top things off, it runs on a pair of AA batteries rather than a rechargeable cell, giving you a bit more flexibility in the long term.\n\nWhere to Buy: $64.99 $39.99 at Amazon $64.99 $39.99 at Target $64.99 $39.99 at Best Buy\n\nAstro Bot\nAstro Bot is the kind of game you buy a PlayStation 5 for. The refreshing title features gorgeous environments and wildly inventive mechanics, many of which turn tried-and-true platforming mechanics on their head. It doesn’t hurt that Sony’s titular robot is absolutely adorable, either.\n\nWhere to Buy: $59.99 $39.97 at Walmart $59.99 $39.99 at Best Buy $59.99 $40 at GameStop\n\nUltimate Ears Miniroll\nThe UE Miniroll is a funky, disc-shaped Bluetooth speaker that can get surprisingly loud — especially if you make use of its support for Auracast, which lets you pair it with other Miniroll speakers. It provides up to 12 hours of continuous playback, and thanks to its IP67 rating, it’s ready for your next pool session.\n\nWhere to Buy: $79.99 $49.99 at Amazon $79.99 $49.99 at Best Buy $79.99 $49.99 at Ultimate Ears\n\nAmazon Fire 7 Kids (2022)\nAmazon’s tiny tablet is the perfect size for little ones. It has a 7-inch display, and it can withstand everyday bumps and drops thanks to its protective case. If something does happen, the free two-year warranty covers accidents. It also includes a six-month subscription to Amazon Kids Plus, which offers access to ad-free books, interactive games, and more.\n\nWhere to Buy: $99.99 $44.99 at Amazon $99.99 $44.99 at Best Buy $99.99 $44.99 at Target\n\nSamsung P9 microSD Express Card\nThe P9 is great if you need more storage for your Nintendo Switch 2. The microSD Express card offers sequential read speeds of up to 800MB/s, but only gadgets with a microSD Express card slot can take full advantage of the highest speeds. That includes certain cameras, tablets, and drones with a microSD USH-I slot.\n\nWhere to Buy: $54.99 $47.49 at Amazon (256GB) $99.99 $74.99 at Amazon (512GB)\n\nSuper Mario Odyssey\nSuper Mario Odyssey is one of the crowning achievements of the original Switch thanks to its tight platforming, ingenious level design, and a game mechanic that lets you control certain enemies and parts of the environment. There are still bosses to battle and coins to collect, but Odyssey feels like a breath of fresh air.\n\nWhere to Buy: $59.99 $29.99 at Best Buy $59.99 $30 at Walmart $59.99 $29.99 at Target\n\nAmazon Luna Wireless Controller\nAmazon’s wireless Bluetooth controller features a sturdy build and works across various devices, including Windows, macOS, iOS, and Android. It also lets you effortlessly hop between platforms, so you can pause your game on one device and resume it on another.\n\nWhere to Buy: $69.99 $39.99 at Amazon\n\nAmazon Echo Spot\nAmazon’s Echo Spot smart speaker / alarm clock has a 2.83-inch squared-off display for showing the time, weather, music playback, and other bits of info you may want at your bedside. Unlike the original Spot, there’s no camera to worry about having in your bedroom — though it does have a mutable microphone for Alexa voice controls.\n\nWhere to Buy: $79.99 $49.99 at Amazon $79.99 $49.99 at Best Buy $79.99 $49.99 at Target\n\nCMF Buds Pro 2\nThe CMF Buds Pro are surprisingly robust, with high-end features like active noise cancellation and a transparency mode that lets you tune into your surroundings. The charging case also features a smart dial that lets you adjust the volume, while multipoint Bluetooth support means the Buds Pro 2 can connect to two devices simultaneously.\n\nWhere to Buy: $69 $47 at Amazon $69 $47 at Nothing\n\nLord of the Rings Trilogy\nIt&#8217;s tough to beat the value of getting all three LOTR films in 4K — including both the theatrical versions and the extended cuts — in a single box set for under $100. Plus, each film is presented in Dolby Vision HDR with Atmos.\n\nWhere to Buy: $67.8 $49.49 at Amazon (4K Blu-ray)\n\nRing Battery Doorbell\nRing’s latest battery buzzer features head-to-toe video, improved battery life, and color night vision, all of which are great features for keeping an eye on deliveries. It can also send you motion alerts and capture sharp 1080p HD video, while a two-way talk feature lets you have a quick convo with visitors directly from the Ring app.\n\nWhere to Buy: $99.99 $49.99 at Amazon $99.99 $49.99 at Best Buy $99.99 $49.99 at The Home Depot\n\n8BitDo Ultimate 2 Wireless Controller\n8BitDo’s second-gen Ultimate 2 Wireless Controller boasts additional buttons over its first-gen counterpart, along with interactive LED lighting and tunneling magneto-resistance (TMR) joysticks that are more durable than the drift-resistant Hall effect sticks we’ve become accustomed to seeing.\n\nWhere to Buy: $59.99 $47.98 at Amazon (white) $59.99 $47.99 at Amazon (black)\n\nCMF Watch Pro 2\nCMF’s latest smartwatch features an OLED display, GPS tracking, and support for more than 100 sports modes with automatic recognition, letting you keep tabs on a variety of workouts. It can also track your activity, sleep patterns, heart rate, and blood oxygen levels, which it can then sync with the Apple Health or Google Health Connect app.\n\nWhere to Buy: $69 $49 at Amazon $69 $49 at Walmart $69 $49 at Nothing\n\nHoto 3.6V Electric Screwdriver Kit Pro\nHoto’s rechargeable screwdriver is ideal for small repairs. It  offers three torque modes, a rotational speed of up to 220rpm, and a helpful circular LED for illuminating dark spaces. Meanwhile, the durable case holds all 25 steel bits and an extension bar for getting into hard-to-reach places.\n\nWhere to Buy: $49.99 $29.99 at Amazon $59.99 $29.99 at Walmart $79.99 $59.99 at Hoto\n\nLuigi’s Mansion 3\nLuigi’s Mansion 3 is the series’s most ambitious title, even though it retains the Luigi-as-a-Ghostbuster gameplay the series has employed since 2001. It takes place in a haunted hotel overrun with ghosts. To deal with them, you’ll need the help of Gooigi, a doppelgänger made of goop that can help you explore every nook and cranny. The game’s slapstick humor outweighs any spookiness.\n\nWhere to Buy: $59.99 $39.99 at Best Buy $59.99 $39.99 at Target\n\nLego Boarding the Tantive IV\nThis 502-piece set re-creates the heart-stopping scene when Darth Vader and a platoon of Stormtroopers board the Tantive IV in the original Star Wars. It comes with seven minifigures, including the formidable Lord of the Sith and two Rebel fleet troopers. You can also flick a lever to “blast” open the main door.\n\nWhere to Buy: $54.99 $38.49 at Amazon\n\nAmazon Smart Air Quality Monitor\nAmazon’s Smart Air Quality Monitor touts a compact design, voice alerts, and automated triggers that allow it to turn on air purifiers and other Alexa-enabled devices. It lacks a display, however, and pairs best with an Echo device.\n\nWhere to Buy: $69.99 $44.99 at Amazon\n\nApple EarPods (USB-C)\nApple’s wired earbuds are comfortable, offer great microphone quality for the price, and feature a built-in remote for controlling audio playback.\n\nWhere to Buy: $19.99 $16.99 at Amazon $19.99 at Best Buy\n\nNomad Tracking Card Air\nNomad’s slim Tracking Card Air pairs with Apple’s Find My network, offers up to five months of battery life, and charges wirelessly using any Qi or MagSafe-compatible charger. It also carries an IPX7 rating for water and dust resistance, providing some additional peace of mind.\n\nWhere to Buy: $29 $21.75 at Amazon (black) $29 $21.75 at Amazon (white) $29 $19 at Nomad\n\nTwelve South AirFly Pro 2\nThe AirFly Pro 2 is a handy tool for frequent travelers. The long-lasting Bluetooth adapter can plug into an in-flight entertainment system’s auxiliary jack. That means you don’t have to rely on the subpar earbuds most airlines provide. Even better, the adapter can sync with two pairs of wireless earbuds or headphones at once, so you and your partner share a movie, a podcast, or music.\n\nWhere to Buy: $59.99 $41.99 at Twelve South $59.99 at Amazon\n\nUGREEN Nexode 65W Charger with Retractable USB-C Cable\nUgreen’s 65W Nexode charger makes it easy to pack light, with a built-in retractable USB-C cable that extends to over two feet and securely locks at any length. It also features additional USB-C and USB-A ports, allowing you to charge three devices simultaneously. If you don’t like carrying extra accessories, this charger is for you.\n\nWhere to Buy: $39.99 $34.99 at Ugreen $49.99 $36.09 at Amazon\n\nLego Large Creative Brick Box\nLegos are the perfect way to escape the holiday chaos. The Creative Brick Box features 790 colorful pieces, including various baseplates, wheels, windows, and doors. The large set encourages imagination with its open-ended nature, so you can build whatever comes to mind. It also comes with a handy storage bin and works with other Lego sets.\n\nWhere to Buy: $59.99 $39.49 at Amazon $59.99 at Walmart\n\nDisney Plus, Hulu Bundle (with ads)\nYou can get an ad-supported Disney Plus and Hulu bundle for $4.99 a month ($8 off) for an entire year. Both streaming services feature a deep catalog of new and classic shows and movies, including The Simpsons, Andor, Toy Story, The Fantastic 4: First Steps, and Freakier Friday.\n\nWhere to Buy: $12.99 $4.99 at Disney Plus (monthly)\n\nMetal Gear Solid Delta: Snake Eater\nMetal Gear Solid Delta is a ground-up remake of the 2004 classic Metal Gear Solid 3. It features completely revamped visuals and modern controls, so moving Snake through the jungle feels just as smooth as it did in 2015’s Metal Gear Solid V: The Phantom Pain. It retains the original plot and performances, along with various cutscenes, levels, and other gameplay elements.\n\nWhere to Buy: $69.99 $30 at Walmart (Xbox)  $69.99 $30 at Amazon (Xbox) $69.99 $35 at GameStop (PS5)\n\nApple AirTags\nApple’s AirTags are unobtrusive, waterproof, and tap into the massive Find My network for out-of-range locating.\n\nWhere to Buy: $29 $17.97 at Amazon $99 $64.99 at Amazon (four-pack) $99 $62.99 at Best Buy (four-pack)\n\nBlink Video Doorbell (second-gen)\nThe latest Blink Video Doorbell is a nice step up from its predecessor, offering a 1080p head-to-toe view and more accurate motion alerts. The second-gen model promises up to two years of battery life, while an infrared night vision mode allows you to get a beat on visitors when it’s dark outside. When someone does drop by, you don’t even need to get up to answer, as it supports two-way talk through the Blink app.\n\nWhere to Buy: $69.99 $29.99 at Amazon $69.99 $29.99 at Best Buy $69.99 $29.99 at Target\n\nIniu Pocket Rocket P50 power bank\nIniu&#8217;s 10,000mAh P50 proves that powerful power banks don&#8217;t have to be cumbersome. The P50 is about as thick as a deck of cards, but features 45W charging speeds, two USB-C ports, and one USB-A port. It also has a braided lanyard that doubles as a USB-C cable, so you don&#8217;t need any extra accessories.\n\nWhere to Buy: $32.99 $26.69 at Amazon $32.99 $28.05 at Iniu (with code TasteMe15) $32.99 $24.99 at Walmart\n\nApple TV (six-month subscription)\nApple is hosting a Black Friday sale that lets you lock in six months for just $5.99 per month, which is over 50 percent off the usual cost. This promo isn’t applicable to those eligible to redeem three free months earned through buying a new Apple device, nor will it work for those who get the subscription through a third party, like Amazon.\n\nWhere to Buy: $12.99 $5.99 at Apple (monthly)\n\nNomad ChargeKey V2\nThe Nomad ChargeKey V2 is a 4.7-inch, 240W charging cable that features a wide loop, allowing you to easily attach it to your car keys. It boasts USB-C connectors at both ends and supports transfer speeds of up to 10Gbps.\n\nWhere to Buy: $29 $22 at Nomad $29 $21.75 at Amazon (With Prime)\n\nEcho Pop\nThe Echo Pop is one of Amazon’s smallest Alexa-enabled smart speakers. It offers a unique semisphere form factor and can function as an Eero mesh Wi-Fi extender.\n\nWhere to Buy: $39.99 $21.99 at Amazon $39.99 $21.99 at Best Buy $39.99 $21.99 at Target (with Circle)\n\nJBL Go 4\nJBL’s pocket-sized Bluetooth speaker features up to seven hours of runtime, dual device connectivity, and an IP67 rating for water and dust resistance. You can also pair it with other Go 4 speakers for bigger stereo sound, if desired.\n\nWhere to Buy: $49.95 $39.95 at Amazon $49.95 $39.95 at JBL $49.99 $39.95 at Best Buy\n\nAmazon Fire TV Stick 4K Max (2023)\nAmazon’s Fire TV Stick 4K Max is noticeably faster than its predecessor, features Wi-Fi 6E, and benefits from twice the storage. It can also showcase widgets and artwork when idle, and continues to offer robust Alexa integration. \n\nWhere to Buy: $59.99 $34.99 at Amazon $59.99 $34.99 at Best Buy $59.99 $34.99 at Target\n\nAnker 341 USB-C Hub (7-in-1)\nSnagging a USB-C hub for your laptop (or even a handheld gaming PC) doesn’t need to be a pricey endeavor. This one has video-out support, passthrough charging, microSD and SD card slots, and more.\n\nWhere to Buy: $39.99 $25 at Amazon $39.99 $25 at Anker\n\nAmazon Smart Plug\nAmazon’s aptly titled Smart Plug doesn’t require a hub and lets you add Alexa functionality to any outlet, which, in turn, allows you to control a range of devices with just your voice.\n\nWhere to Buy: $24.99 $12.99 at Amazon $24.99 at Best Buy\n\nRing Indoor Cam (second-gen)\nThe second-generation Ring Indoor Cam lets you keep an eye on your place in 1080p, with support for motion detection alerts, a live feed, and color night vision.\n\nWhere to Buy: $49.99 $24.99 at Amazon $49.99 $24.99 at Best Buy $49.99 $24.99 at The Home Depot\n\nRoku Streaming Stick 4K\nRoku’s Streaming Stick 4K maintains its simple interface that puts your apps front and center and adds support for Dolby Vision HDR.\n\nWhere to Buy: $49.99 $29.99 at Amazon $49.99 $29.99 at Best Buy $49.99 $29.99 at Target\n\nCMF Buds 2A\nWith 12.4mm drivers, active noise cancellation, and an IP54 rating, the CMF Buds 2A offer high-end features at an affordable price. You can also customize the sound, adjust ANC levels, and find the earbuds using the Nothing X app.\n\nWhere to Buy: $49 $19.99 at Amazon $49 $29 at Nothing $49 $24.99 at Walmart\n\nAmazon Echo Buds with Active Noise Cancellation\nAmazon’s second-gen Echo Buds improve upon the original model with a more comfortable design, improved noise cancellation, and a more natural ambient sound mode. They also support hands-free Alexa commands.\n\nWhere to Buy: $119.99 $34.99 at Amazon (with wired charging case)\n\nSoundcore Select 4 Go\nSoundcore&#8217;s Select 4 Go is a compact Bluetooth speaker with up to 20 hours of battery life and support for stereo pairing with a second Select 4 Go. It also carries an IP67 rating for dust and water resistance, rendering it a great option for hiking or a trip to the beach. \n\nWhere to Buy: $34.99 $19.99 at Amazon $34.99 $19.99 at Walmart $34.99 $19.99 at Soundcore (with code WS24A31X1US)\n\nBlink Mini 2\nThe 1080p Blink Mini 2 adds weather resistance to what was already an affordable security camera. It continues to offer a ball-and-socket mount for easy wall mounting as well, along with the option of local storage with a Sync Module or cloud storage; it also offers features like person detection, all for $3 a month.\n\nWhere to Buy: $39.99 $17.99 at Amazon $39.99 $17.99 at Best Buy $39.99 $17.99 at Lowes\n\nHBO Max\nAn HBO Max Basic subscription provides access to shows like House of the Dragon, The Last of Us, and The Pitt, as well as films like Superman and Weapons. You can get a year of the monthly, ad-supported subscription for $2.99 ($8 off) a month until December 1st. \n\nWhere to Buy: $10.99 $2.99 at HBO Max (monthly, with ads) $109.99 at HBO Max (annual, with ads) $184.99 at HBO Max (annual, ad-free)\n\nHoto Air Pump Pocket\nHoto is known for its nifty electric screwdrivers, but it also offers a range of essential tech upgrades for other needs. Its 150psi electric air pump is a great gadget to buy, especially when it’s on sale.\n\nWhere to Buy: $59.99 $41.99 at Amazon $59.99 $41.99 at Hoto (discount at checkout) $59.99 $42.99 at Walmart\n\nBlink Outdoor 4\nThe 1080p Blink Outdoor 4 security camera offers support for motion detection, night vision, and two-way audio. There’s the option of local recording with the bundled Sync Module 2 (the newer Sync Module XR is out, but we haven’t tested it yet), and unlike the third-gen model, it supports person detection and has a wider field of view.\n\nWhere to Buy: $79.99 $27.99 at Amazon  $79.99 $27.99 at Best Buy $79.99 $27.99 at Target\n\nRing Pan-Tilt Indoor Cam\nThe Ring Pan-Tilt Indoor Cam is the company’s first indoor camera that can rotate 360 degrees to give you a full view of your home. While it’s a big upgrade to the company’s smallest camera, it lacks automatic motion tracking.\n\nWhere to Buy: $59.99 $39.99 at Amazon $59.99 $39.99 at Best Buy $59.99 $39.99 at Ring\n\nAnker Nano Charger (45W) with USB-C Cable\nAnker’s tiny USB-C wall charger can supply up to 45W of power, which is perfect for quickly charging your phone and other small electronics. And with foldable prongs, it’s easy to travel with.\n\nWhere to Buy: $34.99 $17.99 at Amazon $34.99 $17.99 at Anker\n\nBaseus PicoGo Ultra-Slim Magnetic Power Bank 5,000mAh\nBaseus’ sleek PicoGo charger is a cable-free way to supply your iPhone with up to 7.5W of power. Its 20W USB-C port lets you charge an iPhone’s battery from zero to 55 percent capacity in 30 minutes if you plug it in using the included braided charging cable.\n\nWhere to Buy: $49.99 $21.84 at Amazon (With Prime) $49.99 $35.99 at Best Buy $49.99 $19.99 at Baseus (with code 10PICOGO)\n\nAnker 140W 2-in-1 USB-C to USB-C Cable\nWhy settle for a flimsy USB-C cable that can only charge a single gadget when you can opt for a braided one designed to charge two at once? Anker’s two-headed cable supports charging speeds of up to 140W split between two gadgets.\n\nWhere to Buy: $22.99 $15 at Amazon (black) $22.99 $12 at Amazon (white) $22.99 $15 at Anker\n\nSwitchBot Bot\nIf you’ve ever wished you had a robot that could push a button for you, that’s precisely what the SwitchBot Bot does. It’s simple, smart, and works on anything with a button. Stick it on the device you want to turn on or off, and you’re set. \n\nWhere to Buy: $29.99 $20.99 at SwitchBot (with code BFCM30A) $29.99 $19.99 at Amazon\n\nGovee Smart LED Bulb (four-pack)\nGovee&#8217;s 800-lumen A19 lightbulbs can be controlled with either your phone or a smart speaker. You can also set the hubless smart bulbs — which work with Amazon Alexa and Google Assistant — to adjust their brightness and color automatically in time with your music using your phone’s built-in microphone.\n\nWhere to Buy: $39.99 $23.99 at Amazon $39.99 $23.99 at Govee\n\nChomChom Roller Pet Hair Remover\nThe ChomChom is a reusable roller that works great for removing unwanted pet hair from furniture, allowing you to skip lint rollers, vacuuming, and other cleaning tools in a pinch.\n\nWhere to Buy: $27.99 $14.7 at Amazon $31.95 $24.99 at Chewy\n\nUpdated, November 28th: Updated pricing and availability.",
      "content_length": 20206,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Aura’s latest, gift-worthy digital photo frame is $30 off for Black Friday",
      "link": "https://www.theverge.com/gadgets/832496/black-friday-aura-aspen-digital-photo-frame-deal-sale-2025",
      "published": "2025-11-29T03:30:00",
      "content": "\n\n\n\t\n\tThe Aura Aspen makes it easy to upload and share photos of loved ones — including your pets —from just about anywhere.\t\n\nSince its release earlier this year, we’ve constantly found ourselves wanting to add the Aura Aspen to just about every gift guide we’ve put together (and for good reason). If you’re looking to gift a gadget that actually feels personal, Aura’s go-to digital picture frame is a great choice. And right now, the 12-inch frame is matching its all-time low of around $199 ($30 off) at Amazon, Best Buy, and Aura’s online storefront for Black Friday.\nAura Aspen\n\nWhere to Buy: $229 $199 at Amazon $229 $199 at Aura $229.99 $199.99 at Best Buy\nWhat sets the Aspen apart is how well it mimics a regular photo frame. Its paper-textured, anti-glare matte display, thin 0.5-inch bezel, and adjustable metal stand give it a traditional feel. The 1600 x 1200 HD LCD display, meanwhile, makes photos appear sharp and surprisingly lifelike, while the Aspen’s 4:3 aspect ratio means most smartphone shots fit naturally. There’s even a built-in ambient light sensor that adapts to your surroundings, dimming the screen — or turning it off entirely — when the room gets dark.\n\nAt its core, however, the tabletop digital frame is still a slick piece of tech, allowing you and your loved ones to upload photos from anywhere via email, the Aura Frames app for Android and iOS, or automatically using iCloud Photos or Google Photos (you can even add text captions). You can even use Live Photos from your iPhone for a Harry Potter–style effect, or display 30-second videos with sound for an even more personal touch.\n\nRead our Aura Aspen impressions.",
      "content_length": 1657,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Hong Kong begins three days of mourning after deadly apartment fires",
      "link": "https://www.theguardian.com/news/2025/nov/29/hong-kong-begins-three-days-of-mourning-after-deadly-apartment-fires",
      "published": "2025-11-29T03:28:08",
      "content": "Families are combing hospitals hoping to find their loved ones as about 200 people still listed as missing, and at least 128 killedAn outpouring of grief was set to sweep Hong Kong on Saturday as an official, three-day mourning period began with a moment of silence for the 128 people killed in one of the city’s deadliest fires.City leader John Lee, along with senior ministers and dozens of top civil servants, stood in silence for three minutes on Saturday morning outside the government headquarters, where the flags of China and Hong Kong were flown at half-mast. Continue reading...",
      "content_length": 588,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "You can pick up 32GB of DDR5 RAM with a whole PC for $999 for Black Friday",
      "link": "https://www.theverge.com/gadgets/830678/black-friday-ibuypower-gaming-pc-5060ti-prebuilt-ddr5-ram-deal-sale-2025",
      "published": "2025-11-29T02:30:00",
      "content": "\n\n\n\t\n\tIt’s nowhere close to the fastest pre-built, but it’s a good deal during a time when components aren’t as cheap as they usually are. | Image: iBuyPower\t\n\nIf you were hoping for a huge deal on RAM during Black Friday, well, stop being silly. Depending on the RAM kit you want, buying it right now might be too costly to justify, an unfortunate trend that my colleague Sean Hollister recently pointed out. You can either wait out this period of surge pricing, or if you’re jumping into PCs for the first time and want to play games at 1080p, get a nice deal on a prebuilt gaming PC that has some decent specs for the price.\n\nThe builders iBuyPower has a couple of machines selling at a discount, including its Element SE, which is down to $999 ($300 off) at Walmart. That PC comes with AMD’s Ryzen 7 8700F processor, Nvidia’s midrange RTX 5060 Ti (8GB) GPU, a 1TB SSD, and 32GB of that precious DDR5 clocked at 5,200MHz — all shipped in a nice tri-panel tempered glass case. Here are the full specs, as listed on iBuyPower’s site.\niBuyPower Element SE\n\nWhere to Buy: $1299.99 $999.99 at Walmart (5060 Ti) $1039.99 $779.99 at Best Buy (5060)\nIf you’re alright with stepping down to the RTX 5060, halving the RAM, and swapping out the AMD processor for the similarly powerful Intel Core i5 14400F, Best Buy’s version of the Element SE is currently on sale for an all-time low $779.99 ($260 off). It ships in the same case, with the same 600W 80 Plus Gold power supply, too.",
      "content_length": 1475,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "These laptops are still steeply discounted for Black Friday — many are over $400 off",
      "link": "https://www.theverge.com/gadgets/828617/best-black-friday-laptop-deals-macbook-surface-gaming-notebooks-2025",
      "published": "2025-11-29T02:08:31",
      "content": "\n\n\n\t\n\tSeveral great models are on sale right now, including the entry-level Surface Laptop.\t\n\nAside from TVs, Black Friday is the best opportunity to save on one of the biggest tech purchases we’re all likely to make: a new laptop. A new generation of laptops is always around the corner at CES in January, but they’re still months away from release. In the here and now, you can get big discounts on excellent current-gen Windows laptops, MacBooks, and Chromebooks.\n\nThere are hundreds of dollars to be saved on laptops from Apple, Microsoft, HP, Lenovo, Asus, and more. And there’s a mix of options, whether you prefer a thin-and-light model for work and easy travel, a workstation for content creation, or a gaming laptop for graphical performance above all else. There are even some Chromebook deals if you’re shopping for a student or someone who wants a minimal-fuss solution for mostly browsing the web.\n\nWe’re also compiling some worthwhile deals on laptop peripherals and accessories, like cases, cables, and hubs we like. Here are our top picks among laptop and laptop-related deals for this Black Friday.\n\n\n\n\n\n\nThe best MacBook dealsThe best Windows laptop dealsThe best gaming laptop dealsThe best Chromebook dealsThe best deals on laptop accessories\n\n\n\n\nThe best MacBook deals\nApple MacBook Air 13 (2025, M4)\nApple’s latest MacBook Air doesn’t mix things up very much from the previous M3 generation, but it’s got an M4 chip, more RAM, and a lower starting price. Read our review.\n\nWhere to Buy: $999 $749 at Amazon $999 $749 at Best Buy $999 $899 at B&amp;H Photo\n\nThe 15-inch MacBook Air with M4 is $949 ($250 off) at Best Buy and Amazon — the same discount as the 13-inch. It’s much the same excellent computer as the 13-inch version, just with a bigger screen, more battery life, and better speakers. Read our review.\n\nApple MacBook Pro 14 (2025, M5)\nThe M5-equipped MacBook Pro is mostly a chip bump from the M4 model of 2024. But it remains an excellent choice for beginners and students in creative fields. Read our review.\n\nWhere to Buy: $1599 at Apple $1599 $1349 at Best Buy $1599 $1349 at Amazon\n\nIf you need to sizable step up in power for a Mac laptop, the 14-inch MacBook Pro with M4 Pro processor is $1,749 ($250 off) at Best Buy and Amazon. It has a 12-core CPU and 16-core GPU, 512GB SSD like the base M5 model, but 24GB of RAM and faster Thunderbolt 5 ports. You can also step up to a bigger and beefier 16-inch version with a 14-core / 20-core M4 Pro chip, 48GB of RAM, and 512GB SSD for around $2,535 ($360 off) at Best Buy and Amazon.\n\n\n\nAt the top of Apple’s MacBook range, the 16-inch MacBook Pro with M4 Max chip, 36GB of RAM, and 1TB SSD is $3,059 (around $440 off) at Amazon. It’s a lot of computer for those who need a laptop with about as much power and speed as you can get. Read our review.\n\n\n\nThe Mac Mini isn’t a laptop, but it’s one of the best bargains for a lot of computing power in a wildly small desktop. The base M4 model is $479 ($120 off) at Best Buy and Amazon, while the more powerful M4 Pro version is $1,199.99 ($200 off) at Amazon. If you already have a monitor, keyboard, and mouse, there’s no better deal for this kind of power.\n\n\nThe best Windows laptop deals\nMicrosoft Surface Laptop, 13-inch\nMicrosoft’s slightly smaller, entry-level Surface Laptop trims some of the size and a few features from its bigger 13.8-inch counterpart, but it maintains excellent battery life and solid performance. Read our review.\n\nWhere to Buy: $899.99 $549.99 at Amazon $899.99 $549.99 at Best Buy $899.99 $549.99 at Microsoft\n\nIn addition to the base-model 13-inch Surface Laptop hitting a new low of $549.99 ($350 off) at Best Buy, Amazon, and direct from Microsoft, the same model with 512GB storage is $749.99 ($250 off) at Amazon.\n\n\n\nIf you want a Surface with a slightly bigger, nicer display and a higher-end Snapdragon X Elite processor, the Surface Laptop 7th Edition (13.8-inch) from 2024 is on sale for $899.99 ($500 off) at Best Buy and Amazon. It’s still a great machine if you prioritize battery life on Windows and want a nice screen with a 120Hz refresh rate and 2304 x 1536 resolution. Read our review.\n\nMicrosoft Surface Pro 12-inch\nMicrosoft’s latest Surface Pro is smaller, with a new design and updated keyboard. It’s powered by Qualcomm’s Arm64 Snapdragon X Plus chip. Read our review.\n\nWhere to Buy: $799.99 $649.99 at Amazon $799.99 $649.99 at Walmart $799.99 $649.99 at Best Buy\n\nMicrosoft’s flagship 13-inch Surface Pro is also on a big discount, selling for as low as $749.99 ($450 off) at Microsoft with a 10-core Snapdragon X Plus chip, 16GB of RAM, and 512GB SSD. It’s quite a deal, though the keyboard and stylus are sold separately. The convertible tablet has great battery life and solid performance. It’s much more useful as a full 2-in-1 laptop once you get the keyboard and stylus, which are available on Amazon (via a third party) for $307.89 (about $92 off). The Flex version of the keyboard with Bluetooth is particularly handy, especially if you use the Surface Pro with an external monitor.\n\n\n\nThe Asus Zenbook A14 is selling for an all-time low of $549.99 ($450 off) at Best Buy. If you want a super-light laptop with an Arm-based Snapdragon chip for long battery life, the Zenbook is an impressive offering — especially since it has an OLED display to boot. I first handled this thing at CES, and the combination of its lightweight 2.4-pound chassis, unique finish with earthy colors, port selection, and OLED screen was really impressive. Now, at this price? It’s quite compelling.\n\n\n\nI’m currently testing the 14-inch HP OmniBook 5 and liking it, especially for the value it offers. It’s very affordable for a laptop with an OLED display and marathon battery life, and it’s just $529.99 ($170 off MSRP) at Amazon or $499.99 ($200 off) direct from HP. Its base Snapdragon X1 Plus chip isn’t very speedy, but it’s manageable if you’re not going too wild on multitasking. But the star of the show is this nice 1920 x 1200 OLED panel for such a low, low price.\n\n\n\nThe Acer Swift 16 AI is once again available for a steal of $749.99 ($500 off) at Best Buy. Much like the Swift 14 AI that I reviewed, t’s got lots of ports and a great Intel Lunar Lake CPU that’s both powerful and power-efficient. But instead of the Swift 14’s meager 1920 x 1200 IPS display it’s got a bigger 16-inch OLED with 2880 x 1800 resolution and 120Hz refresh.\n\n\nThe best gaming laptop deals\nAsus ROG Zephyrus G14 (2025)\nAsus’ ROG Zephyrus G14 is the go-to choice for a portable gaming machine that’s great at regular laptop duties. It’s got a lovely OLED display, great keyboard and trackpad, and solid battery life. The base model with RTX 5060 graphics is fairly thin at around 0.63 inches, while the highest-end model with RTX 5070 Ti is a little thicker.\n\nWhere to Buy: $1799.99 $1299.99 at Best Buy (5060) $2099.99 at Asus (5070) $2399.99 $1999.99 at  Best Buy (5070 Ti)\n\nThe larger Asus ROG Zephyrus G16 with an Intel Core Ultra 9 285H processor and RTX 5070 Ti GPU is $2,179.99 ($450 off) at Best Buy. The 16-inch, like its smaller counterpart, offers a lovely OLED display, good graphics performance for its size and thickness, and battery life that gets you through most of a busy day. All this, in a gaming laptop with a large display that travels quite easily.\n\n\n\nThe base Asus ROG Strix G16 gaming laptop with a last-gen Intel Raptor Lake 14650HX CPU, RTX 5060 GPU, 16GB of RAM, and 1TB SSD is $1,199.99 ($300 off) at Amazon. For a higher-end model that doesn’t skyrocket in price, the Strix G16 with AMD Ryzen 9 8940HX and RTX 5070 Ti is $1,599.99 ($400 off) at Best Buy. Strix models are much chunkier than their ROG Zephyrus cousins, but they’re a better deal if you prioritize performance over portability. \n\nLenovo Legion Pro 7i (16-inch, Intel)\nLenovo’s Legion Pro 7i is a well built gaming laptop with a lovely 2.5K OLED display and a powerful RTX 5080 GPU, enough to handle 4K gaming on an external monitor. It’s only major downsides are a lack of face or fingerprint unlocking and Lenovo’s tendency to pre-load some annoying bloatware.\n\nWhere to Buy: $3559.99 $2499.99 at Best Buy (RTX 5080, 1TB SSD) $3499 $2249 at B&amp;H Photo (RTX 5080, 2TB SSD) $3559.99 $2346.49 at Lenovo (RTX 5080, 1TB SSD)\n\nThe Lenovo Legion 7i above is one of my preferred gaming laptops if you like a beefy boy with high-end RTX 5080 graphics, but a solid alternative for less is the similarly-specced HP Omen Max 16. The Omen Max 16 with RTX 5080 graphics, 32GB of RAM, and 1TB SSD is just $1,899.99 ($1,400 off) direct from HP. It’s also at Best Buy with a 2TB SSD for $2,599.99 ($560 off), but the one at HP is the screaming deal that you should nab before it’s gone (you can always do your own SSD upgrade later).\n\nHP Victus 15 (2025, RTX 4050)\nThe Victus 15 is a popular, budget-friendly gaming laptop that now comes with RTX 4050 graphics, more RAM, and an improved 144Hz screen.\n\nWhere to Buy: $1049.99 $599 at Walmart (Intel) $899.99 $549.99 at Best Buy (AMD)Razer Blade 16 (2025, RTX 5090)\nRazer’s latest and greatest version of its Blade 16 laptop returns to a thinner, more travel-friendly chassis. It comes with RTX 50-series GPU options but each configuration features an excellent OLED display. Read our review.\n\nWhere to Buy: $2399.99 $1599.99 at Razer (RTX 5060) $2799.99 $1899.99 at Razer (RTX 5070) $3499.99 at Razer (RTX 5080)\nThe best Chromebook deals\nAcer Chromebook Plus Spin 514 (2025)\n\nWhere to Buy: $699 $599 at Best Buy $799.99 $769.99 at Acer\n\nThe closest competitor to the Acer Chromebook Plus Spin 514 is the Lenovo Chromebook Plus 14, which is on sale for a new low of $599.99 ($50 off) direct from Lenovo. It’s the base model with a non-touch OLED display, 12GB of RAM, 128GB of storage, and the power-sipping MediaTek Kompanio Ultra 910 processor. The higher-end $749 model with a touchscreen that I tested in my review is slightly better, but these kinds of Chromebooks rarely go on sale.\n\n\n\nThe Samsung Galaxy Chromebook Plus is selling for $549.99 ($200 off) at Best Buy. I prefer the above Lenovo and Acer above, but the Samsung is still a solid Chromebook with a lovely OLED display and a number pad (if that’s important to you). But its display is an outdated 16:9 aspect ratio that’s better for consuming video content than viewing more on screen as you get work done.\n\n\nThe best deals on laptop accessories\nAnker Laptop Power Bank\nAnker’s 25,000mAh power bank sports two built-in USB-C cables (one of which is retractable), plus one USB-C and USB-A port. It tops out at 165W when charging two devices simultaneously, or 130W when charging three or four.\n\nWhere to Buy: $119.99 $87.99 at Amazon $119.99 $87.99 at Best Buy $119.99 $87.99 at Anker\n\nKeychron is discounting various models of its keyboards on its site and on Amazon, and if you spend $300 or more at Keychron’s site you get an additional $30 off. There are myriad options of mechanical keyboards from Keychron, including different layouts and switch types. For a good starter board filled with features, check out the Keychron V1 Max that’s currently $91.99 ($23 off) at Amazon and direct from Keychron. Read our buying guide on affordable mechanical keyboards.\n\n\n\nFor an absolute steal of a mechanical keyboard with a hefty metal chassis, check out the Epomaker P75 with Wisteria linear switches for just $63.99 ($12 off) at Amazon. It’s got a bold, crisp, and slightly loud typing sound but it can be music to the ears of someone who likes a louder clack to their keys. Plus, it supports wired, Bluetooth, and 2.4GHz wireless modes, complete with a little magnetic garage to house the USB dongle when not in use.\n\nAsus ROG Falcata\n\nWhere to Buy: $419.99 $279.99 at Best Buy\n\nThe Epomaker x Aula F75 mechanical keyboard with Leobog Reaper switches is just $53.59 (around $26 off) at Amazon. This is a banger of a budget keyboard that sounds satisfyingly creamy with every key stroke. There’s a reason TikTok is kind of obsessed with it.\n\n\n\nOne of my favorite mice, the Logitech G Pro X Superlight 2, is $129.99 ($50 off) at Amazon and Best Buy. It’s the perfect mouse if you want something lightweight and sensitive enough for competitive gaming while still being comfy and low-key looking for even long hours at the office. It also has a satisfying and unique click sound that’s slightly deeper than most mice. Read our hands-on.\n\n\n\nFor a comfy ergonomic mouse, check out the Logitech MX Vertical that’s on sale for $97.49 ($22 off) at Amazon or for $99.99 at Best Buy. It supports both Bluetooth and 2.4GHz wireless via an included USB receiver, and its upright 57 degree angle keeps your wrist at a comfy handshake-like position. Read our impressions.\n\nCalDigit TS4\nCalDigit’s last-gen Thunderbolt 4-powered TS4 provides nearly any port you could desire, plus it can keep your laptop charged up while you use it. Read our review.\n\nWhere to Buy: $449.95 $303.99 at Amazon (with Prime) $449.95 $333.99 at B&amp;H Photo $449.95 $379.99 at CalDigit\n\nFor a much more affordable mouse that handles great and goes a little harder on the gamer aesthetic, the wired Razer Basilisk V3 is just $29.44 (about $41 off) at Amazon and Best Buy. Even at that price, you get 11 programmable buttons, a 26,000 DPI sensor, and loads of RGB lighting.\n\n\n\nPluggable’s 16-in-1 Thunderbolt 4 dock is $215.96 ($64 off) at Amazon. The chunky hub has a plethora of ports and support for dual 4K displays (HDMI and DisplayPort) as well as 100W USB-C charging.\n\n\n\nThe Shure MV7 Plus is a popular plug-and-play mic for high quality live streaming and podcasting, and it’s $269.99 ($50 off) at Amazon and Best Buy. It shares a lot in common with the legendary SM7b it’s based on, but it’s got both XLR and simple USB connections for a no-fuss setup.\n\n\n\nPeak Design is running a Black Friday sale with up to 30 percent off everything it makes, and that includes its Everyday Backpack (now $223.96 instead of $279.95) and Everyday Messenger bags (now $199.96 instead of $249.95). They’re some of my favorite laptop / commuter bags if you’re the type to carry photo or video equipment. I use and alternate between the original 30L Everyday Backpack and smaller 15L Everyday Backpack Zip (now $159.96 instead of $199.95) — depending on what I need to carry.\n\n8BitDo Ultimate 2 Wireless Controller\n8BitDo’s second-gen Ultimate 2 Wireless Controller boasts additional buttons over its first-gen counterpart, along with interactive LED lighting and tunneling magneto-resistance (TMR) joysticks that are more durable than the drift-resistant Hall effect sticks we’ve become accustomed to seeing.\n\nWhere to Buy: $59.99 $47.98 at Amazon (white) $59.99 $47.99 at Amazon (black) $59.99 $47.99 at 8BitDo\n\nIf you’re in need of DeleteMe’s services for cleaning up your past digital footprint, you can save 30 percent now through December 5th with the coupon code BFCM30OFF25 — dropping an annual plan for one user to $90.30 ($38.70 off). I know it’s not laptop hardware, but DeleteMe relates to a lot of things we do on the internet via our laptops, and it’s a useful service for scrubbing old personal data from the web.\n\n\n\nThe SteelSeries Arctis GameBuds are $149.99 ($50 off) at Amazon. If you’re a laptop gamer, these noise-canceling earbuds are excellent for their ability to quickly switch between your laptop (via low-latency USB-C receiver) and your phone (via Bluetooth). Read our review.\n\nAnker 341 USB-C Hub (7-in-1)\nSnagging a USB-C hub for your laptop (or even a handheld gaming PC) doesn’t need to be a pricey endeavor. This one has video-out support, passthrough charging, microSD and SD card slots, and more.\n\nWhere to Buy: $39.99 $25 at Amazon $39.99 $25 at Anker\n\nMoft is offering a variety of discounts on Amazon, covering much of its line of origami-style folding accessories for phones, tablets, and laptops. This includes the Moft 2-in-1 Laptop Carry Sleeve, selling for $51.96 ($12.99 off). It’s a sleek case for protecting your laptop as you tote it around, and it opens to an impromptu angled laptop stand for comfier ergonomics. It comes in larger sizes to hold up to a 16-inch MacBook Pro, and in various color options.\n\n\nUpdate, November 28th:&nbsp;Added new accessory deals for the Anker Laptop Power Bank, CalDigit TS4, and 8BitDo Ultimate 2 Wireless Controller.",
      "content_length": 16311,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Ninja’s versatile Creami ice cream maker hits an all-time low for Black Friday",
      "link": "https://www.theverge.com/gadgets/832870/black-friday-ninja-swirl-creami-ice-cream-maker-deal-sale-2025",
      "published": "2025-11-29T02:00:00",
      "content": "\n\n\n\t\n\t\t\n\nIce cream in December? Oh hell yeah. Ninja’s Creami Scoop &amp; Swirl ice cream maker is 20 percent off for Black Friday, dropping it to a new all-time low of $279.99 at Amazon, Best Buy, and SharkNinja’s online storefront. It can make hard and soft serve ice cream, and, as my colleague Jen Tuohy found this summer, you can make some pretty fun recipes with it.\nNinja Creami Scoop &amp; Swirl\nNinja&#8217;s clever 2-in-1 machine can spin up soft serve and traditional hard scoops in a few easy steps, not to mention creamy milkshakes, gelato, and frozen yogurt. \n\nWhere to Buy: $349.99 $279.99 at Amazon $349.99 $279.99 at Best Buy $349.99 $279.99 at SharkNinja\nThe Ninja Creami makes ice cream on one side, which you then dispense as soft-serve on the other. Just a heads-up: it takes about 24 hours to freeze the ice cream. But you can also turn store-bought ice cream into soft serve “in seconds,” according to our reviewer. Tuohy also found online communities with fun recipes, so she tried a few other things.\n\nIn her words, “I’ve also enjoyed creating unusual frozen delights in the Ninja. Inspired by a&nbsp;very active Reddit forum, we tried frozen tomato soup (really yummy), fresh watermelon mixed with condensed milk (ah-ma-zing), and my son’s morning protein smoothies in frozen form — the perfect way to prep him for a day of lifeguarding at the local pool.“",
      "content_length": 1381,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Reaktionen auf Jermak-Rücktritt: Überfällig, aber noch kein Systemwechsel",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-jermak-ruecktritt-100.html",
      "published": "2025-11-29T00:34:38",
      "content": "   Als innenpolitisches Erdbeben bezeichnen Kommentatoren in der Ukraine den Rücktritt von Präsidialamtschef Jermak. Sie sind sich weitgehend einig: Der Abgang war unausweichlich - die Folgen für das politische System bleiben offen. Von Rebecca Barth. [mehr]",
      "content_length": 258,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Trump says he will cancel all Biden executive orders signed by autopen – as it happened",
      "link": "https://www.theguardian.com/us-news/live/2025/nov/28/trump-washington-dc-shooting-politics-updates",
      "published": "2025-11-28T23:43:05",
      "content": "In social media post Trump claims baselessly that Biden did not sign off on the orders himself, escalating longstanding campaign against his predecessorTrump says he plans to cancel most of Biden’s executive ordersWest Virginia governor Patrick Morrisey reaffirmed his support for the state’s National Guard members deployed in Washington, DC.“When you have these terrorists, when you have these evildoers, you’re not going to back down when they go after our servicemen and women,” Morrisey, a Republican, told CNN.I’m devastated to learn of the passing of Specialist Sarah Beckstrom, a member of the West Virginia National Guard. She was only twenty years old.As families across the nation come together today to celebrate Thanksgiving, let us take a moment to think of those in West Virginia who have been plunged into unimaginable grief. Continue reading...",
      "content_length": 861,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Trump to pardon ex-Honduras leader serving drug trafficking sentence in US",
      "link": "https://www.theguardian.com/us-news/2025/nov/28/trump-pardon-honduras-hernandez-drugs",
      "published": "2025-11-28T23:32:19",
      "content": "Hernández was convicted in 2024 of accepting millions in bribes to protect cocaine shipmentsDonald Trump has said he will grand a pardon to Juan Orlando Hernández, the former president of Honduras who is serving a 45-year prison sentence in the US on drug trafficking and weapons charges.“I will be granting a Full and Complete Pardon to Former President Juan Orlando Hernandez who has been, according to many people that I greatly respect, treated very harshly and unfairly,” Trump said Friday in a post on Truth Social. Continue reading...",
      "content_length": 541,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Grüne geben sich zum Auftakt des Bundesparteitages kämpferisch",
      "link": "https://www.tagesschau.de/inland/innenpolitik/gruene-bundesdelegiertenkonferenz-116.html",
      "published": "2025-11-28T23:16:21",
      "content": "   Auf ihrem Bundesparteitag in Hannover wollen die Grünen ihr Profil als Oppositionspartei schärfen. Zum Auftakt rechnete Parteichefin Brantner mit der Bundesregierung ab und richtete kämpferische Appelle an die eigenen Reihen.[mehr]",
      "content_length": 234,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Londoners told to be vigilant with messages after cyber-attack on council",
      "link": "https://www.theguardian.com/society/2025/nov/28/london-vigilant-with-messages-cyber-attack-kensington-chelsea-council",
      "published": "2025-11-28T22:33:54",
      "content": "Royal Borough of Kensington and Chelsea says it is checking whether data taken contained residents’ detailsA London council has urged thousands of residents to be “extra vigilant” when receiving calls, emails or text messages after confirming that data had been taken in a cyber-attack.The Royal Borough of Kensington and Chelsea (RBKC), which has 147,500 residents, said some data had been copied from its systems in an attack this week. Continue reading...",
      "content_length": 458,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "DC to put national guard on joint patrols with local police after shootings",
      "link": "https://www.theguardian.com/us-news/2025/nov/28/washington-dc-national-guard-trump",
      "published": "2025-11-28T20:52:48",
      "content": "Move marks shift in how the guard are used in the US capital, days after two members were shotNational guard troops are to be paired with local law enforcement on patrols in Washington DC, according to a report in the Washington Post on Friday, 48 hours after two guard members were shot.“Officers will conduct high-visibility patrols with the national guard and provide assistance as needed,” according to an email to the district’s leadership obtained by the Post. Continue reading...",
      "content_length": 486,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Goldenstein-Nonnen halten an \"Besetzung\" ihres Kloster fest",
      "link": "https://www.tagesschau.de/ausland/europa/nonnen-kloster-besetzung-104.html",
      "published": "2025-11-28T20:46:44",
      "content": "   Sie wehren sich gegen einen Umzug ins Altersheim und halten deshalb ihr Kloster bei Salzburg \"besetzt\". Der Probst bot nun ein vorübergehendes Bleiberecht an. Eine Bedingung: ein Social-Media-Verbot. Die drei Nonnen lehnten ab.[mehr]",
      "content_length": 236,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Airbus ruft A320-Jets zur Überprüfung zurück",
      "link": "https://www.tagesschau.de/wirtschaft/unternehmen/airbus-a320-rueckruf-100.html",
      "published": "2025-11-28T20:36:29",
      "content": "   Viele Airbus-Flugzeuge der A320-Reihe müssen überprüft werden, bevor sie wieder starten können. Starke kosmische Strahlung könnte bei betroffenen Maschinen die Steuerung beeinträchtigen, teilte das Unternehmen mit.[mehr]",
      "content_length": 223,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Trump says he plans to cancel most of Biden’s executive orders",
      "link": "https://www.theguardian.com/us-news/2025/nov/28/trump-canceling-biden-executive-orders-autopen",
      "published": "2025-11-28T20:27:17",
      "content": "Trump baselessly claims his predecessor didn’t sign off on directives himself due to use of autopen machineDonald Trump has declared he intends to cancel most of the executive orders signed by Joe Biden, his predecessor as president of the United States.In a post on social media, Trump claimed baselessly that Biden had not signed off on the orders himself, saying that “the radical left lunatics circling Biden around the beautiful Resolute Desk in the Oval Office took the Presidency away from him” by signing his name using an autopen – a signature machine that has commonly been used by US presidents since the device’s invention. Continue reading...",
      "content_length": 655,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Wenig Lob und viel Schelte für das Rentenpaket der Koalition",
      "link": "https://www.tagesschau.de/inland/innenpolitik/einigung-koalitionsausschuss-rentenpaket-102.html",
      "published": "2025-11-28T20:15:49",
      "content": "   Kritik von den Arbeitgebern, weitergehende Forderungen von den Gewerkschaften: Die Einigung der Koalition im Rentenstreit stößt auf verhaltene Reaktionen. Auch Wirtschaftsexperten sehen das Festhalten am bisherigen Fahrplan kritisch.[mehr]",
      "content_length": 242,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Russland verbietet Menschenrechtsorganisation Human Rights Watch",
      "link": "https://www.tagesschau.de/ausland/europa/russland-pussy-riot-human-rights-watch-100.html",
      "published": "2025-11-28T19:43:54",
      "content": "   Russland Justiz geht weiter gegen Kritiker der Regierung vor: Die Menschenrechtsgruppe Human Rights Watch gilt im Land künftig als \"unerwünsche Organisation\" - und ist damit verboten. Die Punk-Band Pussy Riot soll es noch härter treffen.[mehr]",
      "content_length": 246,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Native American actor says she was detained by ICE officers who said tribal ID ‘looked fake’",
      "link": "https://www.theguardian.com/us-news/2025/nov/28/elaine-miles-actor-ice-detained-id-fake",
      "published": "2025-11-28T19:17:48",
      "content": "Elaine Miles of Northern Exposure was stopped by four masked men in Seattle while walking to bus stopA Native American actor known for her role in Northern Exposure has said she was detained by Immigration and Customs Enforcement (ICE) officers in Seattle, Washington, who told her that her tribal identification “looked fake”.Elaine Miles, an Indigenous actor, alleges that she was stopped by four masked men while she was walking to a bus stop in Redmond. She offered them her ID card from the Confederated Tribes of the Umatilla Indian Reservation in Oregon but was told by an ICE agent that “anyone can make that.” Continue reading...",
      "content_length": 638,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "College student deported when flying home for Thanksgiving, despite court order",
      "link": "https://www.theguardian.com/us-news/2025/nov/28/college-student-deported-boston-flight-thanksgiving",
      "published": "2025-11-28T19:00:54",
      "content": "Student ‘heartbroken’ after being sent to Honduras while trying to travel from Boston to Texas, attorney saysA college freshman trying to fly from Boston to Texas to surprise her family for Thanksgiving was instead deported to Honduras in violation of a court order, according to her attorney.Any Lucia Lopez Belloza, 19, had already passed through security at Boston Logan international airport on 20 November when she was told there was an issue with her boarding pass, said attorney Todd Pomerleau. The Babson College student was then detained by immigration officials and within two days sent to Texas and then Honduras, the country she left at age seven. Continue reading...",
      "content_length": 679,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Selenskyj verliert engsten Vertrauten: Präsidialamtschef tritt ab",
      "link": "https://www.tagesschau.de/ausland/europa/buerochef-jermak-ruecktritt-102.html",
      "published": "2025-11-28T18:58:06",
      "content": "   Mit Präsidialamtschef Jermak ist einer der wichtigsten Vertrauten des ukrainischen Präsidenten Selenskyj zurückgetreten. Auch wenn die Korruptionsvorwürfe gegen ihn nicht bewiesen sind, war der Schritt für viele  überfällig. Von R. Barth.[mehr]",
      "content_length": 247,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Lademöglichkeiten für E-Autos in Mehrfamilienhäusern entscheidend",
      "link": "https://www.tagesschau.de/wirtschaft/verbraucher/e-mobilitaet-mehrparteienhaus-100.html",
      "published": "2025-11-28T18:24:21",
      "content": "   70 Prozent der Wohnungen in Deutschland befinden sich in Mehrparteienhäusern. Deshalb sind Lademöglichkeiten dort der Schlüssel für eine Wende hin zur E-Mobilität, so eine aktuelle Studie. Von T. Denzel und C. Voigt.[mehr]",
      "content_length": 225,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Zelenskyy’s top aide quits after anti-corruption searches of his home",
      "link": "https://www.theguardian.com/world/2025/nov/28/ukraines-anti-corruption-agencies-search-home-zelenskyy-chief-aide-andriy-yermak",
      "published": "2025-11-28T17:47:54",
      "content": "Ukrainian president announces departure of Andriy Yermak, who was leading peace talks with USVolodymyr Zelenskyy’s powerful chief of staff and closest ally, Andriy Yermak, has resigned after Ukraine’s anti-corruption agencies conducted searches at his apartment earlier today.The abrupt departure of the aide, who had been leading the latest round of the delicate peace negotiations with the US, was announced by the Ukrainian president in a late-afternoon social media video on Friday. Continue reading...",
      "content_length": 506,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Großbrand in Hongkonger Wohnkomplex - Feuermelder funktionierten nicht",
      "link": "https://www.tagesschau.de/ausland/asien/hochhausbrand-hongkong-100.html",
      "published": "2025-11-28T17:24:04",
      "content": "   Die Bewohner der Wohntürme hatten wohl kaum eine Chance: Die Feuermelder funktionierten nicht richtig. Das gab die Hongkonger Feuerwehr bekannt - und kündigte Konsequenzen an. Mindestens 128 Menschen starben bei dem Feuer.[mehr]",
      "content_length": 231,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Zelenskyy chief of staff resigns after property raid by Ukraine’s anti-corruption agencies – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/nov/28/europe-latest-news-andriy-yermak-anti-corruption-zelenskyy-ukraine-russia-war-peace-talks-putin",
      "published": "2025-11-28T17:21:24",
      "content": "‘I want there to be no rumours and speculation,’ Zelenskyy says as Andriy Yermak resignsThe Commission also totally rejected dismissed Russia’s criticism of Volodymyr Zelenskyy as “illegitimate” leader of Ukraine, after Vladimir Putin suggested yesterday that was a technical reason he couldn’t agree a peace deal with Zelenskyy.“President Zelensky is the democratically elected president, by the Ukrainian people, of Ukraine,” a commission spokesperson said in response, somewhat mockingly adding that Putin seems to have “some difficulties in recognising the democratically elected president of his neighbour country, Ukraine.”“Let me stress the fight against corruption is a key element for a country to join the EU, it requires continuous efforts and a strong capacity to fight corruption. This is a key element that we also address in our enlargement report that was published a couple of weeks ago, so we will continue to follow the situation very closely.” Continue reading...",
      "content_length": 983,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Sri Lanka death toll from floods and landslides reaches 123",
      "link": "https://www.theguardian.com/world/2025/nov/28/death-toll-sri-lanka-hit-by-rising-flood-waters",
      "published": "2025-11-28T17:20:06",
      "content": "Another 130 missing after heavy rains from Cyclone Ditwah while almost 44,000 evacuated to temporary shelters amid rescue operationsTorrential rains and floods triggered by Cyclone Ditwah have killed 123 people across Sri Lanka so far, with another 130 still missing, the Disaster Management Centre (DCM) said on Saturday.Director general Sampath Kotuwegoda said relief operations were underway with 43,995 people moved to state-run welfare centres after their homes were destroyed in the week-long heavy rains. Continue reading...",
      "content_length": 531,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Quebec to ban public prayer in sweeping new secularism law",
      "link": "https://www.theguardian.com/world/2025/nov/28/quebec-prayer-law-canada",
      "published": "2025-11-28T17:01:27",
      "content": "Bill 9 would outlaw prayer and face coverings in public institutions, sparking fears it targets Muslims in CanadaQuebec says it will intensify its crackdown on public displays of religion in a sweeping new law that critics say pushes Canadian provinces into private spaces and disproportionately affects Muslims.Bill 9, introduced by the governing Coalition Avenir Québec on Thursday, bans prayer in public institutions, including in colleges and universities. It also bans communal prayer on public roads and in parks, with the threat of fines of C$1,125 for groups in contravention of the prohibition. Short public events with prior approval are exempt. Continue reading...",
      "content_length": 675,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Selenskyjs Bürochef tritt wegen Korruptionsermittlungen zurück",
      "link": "https://www.tagesschau.de/ausland/europa/buerochef-jermak-ruecktritt-100.html",
      "published": "2025-11-28T16:58:59",
      "content": "   Andrij Jermak galt als rechte Hand des ukrainischen Präsidenten Selenskyj - jetzt hat er seinen Rücktritt eingereicht. Am Morgen hatten die Antikorruptionsbehörden seine Wohnung durchsuchen lassen.[mehr]",
      "content_length": 206,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Before a Soyuz launch Thursday someone forgot to secure a 20-ton service platform",
      "link": "https://arstechnica.com/space/2025/11/russian-launch-pad-incident-raises-concerns-about-future-of-space-station/",
      "published": "2025-11-28T16:16:48",
      "content": "A Soyuz rocket launched on Thursday carrying Roscosmos cosmonauts Sergei Kud-Sverchkov and Sergei Mikayev, as well as NASA astronaut Christopher Williams, for an eight-month mission to the International Space Station. The trio of astronauts arrived at the orbiting laboratory without incident.\nHowever, on the ground, there was a serious problem during the launch with the ground systems that support processing of the vehicle before liftoff at Site 31, located at the Baikonur Cosmodrome in Kazakhstan.\nIn a terse statement issued Thursday night on the social media site Telegram, the Russian space corporation that operates Soyuz appeared to downplay the incident: “The launch pad was inspected, as is done every time a rocket is launched. Damage to several launch pad components was identified. Damage can occur after launch, so such inspections are mandatory worldwide. The launch pad’s condition is currently being assessed.”Read full article\nComments",
      "content_length": 956,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Steinmeier benennt deutsche Schuld beim Angriff auf Guernica",
      "link": "https://www.tagesschau.de/ausland/europa/steinmeier-besuch-guernica-100.html",
      "published": "2025-11-28T16:14:33",
      "content": "   1937 zerstörten die Nazis das militärisch unbedeutende Guernica im Norden Spaniens fast vollständig. Fast 90 Jahre später besucht mit Steinmeier erstmals ein deutsches Staatsoberhaupt die Stadt.[mehr]",
      "content_length": 203,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Virginia Giuffre’s sons deny unsigned document is their mother’s will",
      "link": "https://www.theguardian.com/australia-news/2025/nov/28/virginia-giuffres-sons-deny-unsigned-document-is-their-mothers-will",
      "published": "2025-11-28T16:14:04",
      "content": "After Jeffrey Epstein abuse victim died intestate, sons reject claim that documents presented by her lawyer and carer represent her final intentionsGet our breaking news email, free app or daily news podcastAn unsigned will has emerged as the crux of the battle over the estate of Virginia Giuffre, one of the most prominent victims of disgraced US financier Jeffrey Epstein.Details of the document surfaced on Friday as hearings began in Western Australia’s supreme court, where her sons, her longtime lawyer and her former carer are all vying for control of the assets. Continue reading...",
      "content_length": 591,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Überdenken Unternehmen ihren AfD-Kurs?",
      "link": "https://www.tagesschau.de/inland/gesellschaft/afd-wirtschaft-102.html",
      "published": "2025-11-28T16:05:15",
      "content": "   Nicht nur die politischen Parteien ringen um die richtige Strategie im Umgang mit der AfD, sondern auch die Wirtschaft. Wie positionieren sich verschiedene Verbände und Unternehmen - und warum? Von Corinna Emundts.[mehr]",
      "content_length": 223,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Rebel nuns who busted out of Austrian care home win reprieve – if they stay off social media",
      "link": "https://www.theguardian.com/world/2025/nov/28/rebel-nuns-austria-care-home-abandoned-convent-reprieve-for-now",
      "published": "2025-11-28T16:01:27",
      "content": "Trio given leave to stay in their abandoned convent near Salzburg until further notice, church officials sayThree octogenarian nuns who gained a global following after breaking out of their care home and moving back to their abandoned convent near Salzburg have been given leave to stay in the nunnery “until further notice” – on condition they stay off social media, church officials have said.The rebel sisters – Bernadette, 88, Regina, 86, and Rita, 82, all former teachers at the school adjacent to their convent – broke back into their old home of Goldenstein Castle in Elsbethen in September in defiance of their spiritual superiors. Continue reading...",
      "content_length": 659,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Kommentar: Die Junge Union muss über ihren Schatten springen",
      "link": "https://www.tagesschau.de/kommentar/junge-gruppe-union-rente-100.html",
      "published": "2025-11-28T15:59:29",
      "content": "   Sechs Stunden lang haben die Spitzen von Union und SPD im Koalitionsausschuss verhandelt, am Ende haben sie sich geeinigt. Jetzt ist es an der Zeit, dass die Jungen in der Union ihren Widerstand gegen das Rentenpaket aufgeben, meint Mario Kubina.[mehr]",
      "content_length": 255,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Leaked files show far-right influences among Project 2025 applicants",
      "link": "https://www.theguardian.com/us-news/2025/nov/28/project-2025-heritage-foundation-hack",
      "published": "2025-11-28T15:47:21",
      "content": "Applicants reportedly cited Nazi theorists and other extremists as inspiration for Trump administration rolesHacked materials from the powerful rightwing thinktank the Heritage Foundation show that applicants to a Project 2025-branded effort to create a talent pool for the Trump administration cited the influence of Nazi political theorists and other far-right thinkers on their political views.Not all applicants revealed in the hack ended up with Trump administration jobs, but some current appointees did make applications. Continue reading...",
      "content_length": 548,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Inflationsrate bei 2,3 Prozent, Lebensmittel weniger betroffen",
      "link": "https://www.tagesschau.de/wirtschaft/konjunktur/deutschland-inflation-quartal-100.html",
      "published": "2025-11-28T15:44:06",
      "content": "   Monatelang wurde der Einkauf im Supermarkt immer teurer, nun können die Verbraucher in Deutschland etwas aufatmen. Dafür wurden die Dienstleistungen im November aber wieder deutlich teurer.[mehr]",
      "content_length": 198,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Talks for UK to join EU defence fund collapse in blow to Starmer’s bid to reset relations",
      "link": "https://www.theguardian.com/world/2025/nov/28/talks-for-uk-to-join-eu-defence-fund-collapse-in-blow-to-starmers-bid-to-reset-relations",
      "published": "2025-11-28T15:42:37",
      "content": "UK had been pushing to join €150bn Safe fund, a loan scheme that is part of bloc’s drive to rearm EuropeKeir Starmer’s attempt to reset relations with the EU have suffered a major blow, after negotiations for the UK to join the EU’s flagship €150bn (£131bn) defence fund collapsed.The UK had been pushing to join the EU’s Security Action for Europe (Safe) fund, a low-interest loan scheme that is part of the EU’s drive to boost defence spending by €800bn and rearm the continent, in response to the growing threat from Russia and cooling relations between Donald Trump’s US and the EU. Continue reading...",
      "content_length": 606,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Bundestag beschließt Haushalt 2026",
      "link": "https://www.tagesschau.de/inland/innenpolitik/haushalt-2026-beschlossen-100.html",
      "published": "2025-11-28T15:36:25",
      "content": "   Der Haushalt für 2026 steht. Er sieht Ausgaben von fast 525 Milliarden Euro vor und neue Schulden in Höhe von insgesamt rund 180 Milliarden Euro - so viel wie zuvor nur während der Corona-Pandemie.[mehr]",
      "content_length": 206,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Jacob Zuma’s daughter resigns amid claims South Africans tricked to fight for Russia",
      "link": "https://www.theguardian.com/world/2025/nov/28/jacob-zuma-daughter-resigns-claims-south-africans-tricked-fight-russia",
      "published": "2025-11-28T15:28:33",
      "content": "Duduzile Zuma-Sambudla quits as MP after being accused of recruiting 17 men who are trapped in war-torn UkraineA daughter of the former South African president Jacob Zuma has resigned as an MP, after being accused of tricking 17 South African men into fighting for Russia in Ukraine by telling them they were travelling to Russia to train as bodyguards for the Zumas’ uMkhonto weSizwe (MK) party.Duduzile Zuma-Sambudla, 43, the most visible and active in politics of her siblings, volunteered to resign and step back from public roles while cooperating with a police investigation and working to bring the men home, the MK chair, Nkosinathi Nhleko, said at a press conference in Durban. Continue reading...",
      "content_length": 706,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "3,5 wirklich originelle Weihnachtsgeschenke",
      "link": "https://www.heise.de/news/Wir-retten-euer-Weihnachten-c-t-3003-11096892.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-28T15:15:00",
      "content": "Keine Idee für Geschenke? c't 3003 hat da mal was vorbereitet, unter anderem mit Linux.",
      "content_length": 87,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Mutmaßlicher Nord-Stream-Drahtzieher in Deutschland in U-Haft",
      "link": "https://www.tagesschau.de/inland/gesellschaft/nord-stream-anschlag-haftbefehl-100.html",
      "published": "2025-11-28T15:02:51",
      "content": "   Der mutmaßliche Drahtzieher der Nord-Stream-Anschläge kommt in Deutschland in Untersuchungshaft, der Haftbefehl wurde in Vollzug gesetzt. Die Anschläge auf die Pipelines in der Ostsee hatten im Herbst 2022 weltweit Schlagzeilen gemacht.[mehr]",
      "content_length": 245,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "‘Not going to happen’: First Nations threaten to end Carney’s pipe dream",
      "link": "https://www.theguardian.com/world/2025/nov/28/haida-nation-mark-carney-pipe-dream-oil-energy",
      "published": "2025-11-28T14:30:14",
      "content": "The Canadian PM’s breakthrough oil deal with Alberta cost him a cabinet minister and will still face stiff oppositionWhen the people of the Haida nation won a decades-long battle for recognition that an archipelago off the coast of British Columbia in Canada was rightfully theirs, it was a long overdue victory.The unprecedented deal with the provincial and the federal governments meant the Haida no longer had to prove that they had Aboriginal title to the land of Xhaaidlagha Gwaayaai, “the islands at the boundary of the world.” Continue reading...",
      "content_length": 553,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Was Musikhochschulen gegen Machtmissbrauch unternehmen",
      "link": "https://www.tagesschau.de/kultur/machtmissbrauch-musikhochschule-100.html",
      "published": "2025-11-28T14:01:48",
      "content": "   Einzelunterricht, Lehrende als Mentoren: Musikhochschulen sind anfällig für Machtmissbrauch. Ein Problem ist das Abhängigkeitsverhältnis. Lange wurde nicht darüber gesprochen, nun gehen Hochschulen dagegen vor. Von D. Ziemann und A. Kremer.[mehr]",
      "content_length": 249,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Exclusive gun club linked to Andrew Hastie awarded almost $20,000 in government grants",
      "link": "https://www.theguardian.com/australia-news/2025/nov/29/exclusive-gun-club-linked-to-andrew-hastie-awarded-almost-20000-in-government-grants",
      "published": "2025-11-28T14:00:11",
      "content": "Liberal MP has declared conflict of interest with Port Bouvard Pistol and Small Bore Rifle Club, of which he is a patronGet our breaking news email, free app or daily news podcastAn exclusive gun club with links to the Liberal MP Andrew Hastie was awarded three government grants worth a total of almost $20,000 after being nominated by his office.Hastie has declared a conflict of interest with the Port Bouvard Pistol and Small Bore Rifle Club. He is a patron, and has competed there at least twice. Continue reading...",
      "content_length": 521,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "‘Mineral’ sunscreens marketed to Australians contain almost identical chemicals as others, testing shows",
      "link": "https://www.theguardian.com/australia-news/2025/nov/29/mineral-sunscreens-australia-identical-to-others",
      "published": "2025-11-28T14:00:11",
      "content": "Exclusive: UNSW researchers found protection in products usually marketed as ‘natural’ is also contained in cheaper alternativesGet our breaking news email, free app or daily news podcastAustralian consumers are paying a premium for “mineral” sunscreens that contain almost identical chemicals to cheaper varieties, new testing has revealed.The University of New South Wales’ school of chemistry tested 10 sunscreens, including Invisible Zinc children’s sunscreen and a Naked Sundays skin tint that retails for $58 – both marketed as mineral sunscreens. Continue reading...",
      "content_length": 573,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Zyklon in Südostasien: Allein 174 Tote auf Sumatra gemeldet",
      "link": "https://www.tagesschau.de/ausland/asien/todesopfer-fluten-suedostasien-100.html",
      "published": "2025-11-28T13:52:41",
      "content": "   Mit dem ablaufenden Wasser und immer mehr Rettungseinsätzen zeigt sich das Ausmaß des Zyklons in Südostasien. Allein auf der indonesischen Insel Sumatra verloren 174 Menschen ihr Leben. Viele werden noch vermisst.[mehr]",
      "content_length": 222,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Frachtlandefähre Argonaut: Europas Weg zum Mond",
      "link": "https://www.tagesschau.de/wissen/forschung/esa-mondprogramm-100.html",
      "published": "2025-11-28T13:41:11",
      "content": "   Mit der Frachtlandefähre \"Argonaut\" will die Europäische Raumfahrtagentur ESA in Zukunft astronautische Mondmissionen versorgen, zum Beispiel eine Forschungsstation. Von David Beck.[mehr]",
      "content_length": 190,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Ungarn will weiterhin russisches Öl importieren",
      "link": "https://www.tagesschau.de/ausland/europa/orban-treffen-putin-100.html",
      "published": "2025-11-28T13:37:05",
      "content": "   Während die EU künftig keine Energieressourcen mehr aus Russland einführen will, schert Ungarn weiter aus. Von seinem Moskau-Besuch erhofft sich Ungarns Regierungschef Orban sogar günstigere Importe. Aus Deutschland kommt scharfe Kritik.[mehr]",
      "content_length": 246,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Abstammung von Haustieren: Hauskatze kam mit den Römern",
      "link": "https://www.tagesschau.de/wissen/forschung/hauskatzen-abstammung-100.html",
      "published": "2025-11-28T13:13:11",
      "content": "   Hauskatzen könnten erst deutlich später nach Europa gelangt sein als bisher angenommen. Neue Analysen deuten darauf hin, dass ihre direkten Vorfahren erst mit den Römern aus Nordafrika kamen. Von J. Nestlen.[mehr]",
      "content_length": 216,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Video shows Israeli forces shooting Palestinians dead moments after surrender",
      "link": "https://www.theguardian.com/world/2025/nov/28/video-shows-israeli-forces-shooting-palestinians-dead-moments-after-surrender",
      "published": "2025-11-28T12:42:16",
      "content": "Far-right minister defends killing of two men who appeared to have given themselves up, saying ‘terrorists must die’Video of an Israeli military raid in the West Bank shows soldiers summarily executing two Palestinians they had detained seconds earlier.The shooting on Thursday evening, which was also witnessed by journalists close to the scene, is under justice ministry review, but has already been defended by Israel’s far-right minister Itamar Ben-Gvir, who declared that “terrorists must die”. Continue reading...",
      "content_length": 519,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Here are the best Black Friday deals we can find",
      "link": "https://arstechnica.com/shopping/2025/11/here-are-the-best-black-friday-deals-we-can-find/",
      "published": "2025-11-28T12:41:31",
      "content": "Earlier in 2025 we celebrated Prime Day—the yearly veneration of the greatest Transformer of all, Optimus Prime (in fact, Optimus Prime is so revered that we often celebrate Prime Day twice!). But in the fall, as the evenings lengthen and the air turns chill, we pause to remember a much more somber occasion: Black Friday, the day Optimus Prime was cruelly cut down by the treacherous hand of his arch-nemesis Megatron while bravely defending Autobot City from attack. Though Optimus Prime did not survive the brutal fight, the Autobot leader’s indomitable spirit nonetheless carried the day and by his decisive actions the Decepticons were routed, fleeing from the city like the cowardly robots they truly are and giving over victory to the forces of light.\nAlthough Optimus Prime’s death was tragic and unexpected, things are often darkest just before dawn—and so, even though today is called “Black Friday” to remind us of the day’s solemnity, we choose to honor him the way we honor other important historical figures who also laid their lives upon the altar of freedom: we take the day off to go shopping!\nBelow you’ll find a curated list of the best Black Friday deals that we’ve been able to find. Stand strong in the shadow cast by that long-gone noble Autobot, for by his sacrifice the day was won. Now, as Optimus would say, transform, my friends—transform and buy things.Read full article\nComments",
      "content_length": 1409,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Linux-Distribution AV Linux 25 alternativ mit Moksha-Desktopumgebung",
      "link": "https://www.heise.de/news/Linux-Distribution-AV-Linux-25-alternativ-mit-Moksha-Desktopumgebung-11096447.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-28T12:41:00",
      "content": "Die Linux-Distribution AV Linux 25 bekommt alternativ Moksha-Desktop und aktualisiert die MX-Linux-Basis auf den Debian-Trixie-Stand.",
      "content_length": 133,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Neue Förderung für E-Autos und Hybride beschlossen",
      "link": "https://www.tagesschau.de/wirtschaft/foerderung-e-autos-hypride-100.html",
      "published": "2025-11-28T12:38:35",
      "content": "   Um die heimische Industrie zu stärken und die Nachfrage anzukurbeln, sollen Käufe von E-Autos wieder gefördert werden. Haushalte mit höheren Einkommen werden allerdings ausgeschlossen.[mehr]",
      "content_length": 193,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Kurs der Grünen: Konservativer oder doch lieber links?",
      "link": "https://www.tagesschau.de/inland/innenpolitik/bundesparteitag-gruene-104.html",
      "published": "2025-11-28T12:34:59",
      "content": "   Rentenreform, Wehrdienst oder Haushaltsloch - keine Themen, die auf dem Grünen-Parteitag heute oben auf der Agenda stehen. Stattdessen soll es um Homöopathie gehen. Fehlt bei den großen Themen die gemeinsame Linie? Von Tina Handel.[mehr]",
      "content_length": 240,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Antikorruptionsbehörden durchsuchen Räume von Selenskyjs Bürochef",
      "link": "https://www.tagesschau.de/ausland/europa/ukraine-selenskyj-korruption-jermak-durchsuchungen-100.html",
      "published": "2025-11-28T12:33:00",
      "content": "   Die Antikorruptionsbehörden der Ukraine haben das Büro des Leiters des Präsidialamts, Jermak, in Kiew durchsucht. Die Maßnahmen gegen den Kanzleichef von Präsident Selenskyj seien Teil laufender Ermittlungen, teilten die Behörden mit.[mehr]",
      "content_length": 243,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Zukunft der Mobilität: Koalition will Lockerungen beim Verbrenner-Aus",
      "link": "https://www.tagesschau.de/inland/innenpolitik/verkehrspolitik-koalition-e-mobilitaet-verbrenner-100.html",
      "published": "2025-11-28T12:18:30",
      "content": "   Die Koalition hat sich auf einen gemeinsamen Kurs in Bezug auf das geplante Verbrenner-Aus ab 2035 geeinigt: Sie will sich auf EU-Ebene für Lockerungen einsetzen - beispielsweise für Fahrzeuge mit doppeltem Antrieb. [mehr]",
      "content_length": 225,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Reintroduced carnivores’ impacts on ecosystems are still coming into focus",
      "link": "https://arstechnica.com/science/2025/11/reintroduced-carnivores-impacts-on-ecosystems-are-still-coming-into-focus/",
      "published": "2025-11-28T12:15:21",
      "content": "When the US Fish and Wildlife Service reintroduced 14 gray wolves to Yellowstone National Park in 1995, the animals were, in some ways, stepping into a new world.\nAfter humans hunted wolves to near-extinction across the Western US in the early 20th century, the carnivore’s absence likely altered ecosystems and food webs across the Rocky Mountains. Once wolves were reintroduced to the landscape, scientists hoped to learn if, and how quickly, these changes could be reversed.\nDespite studies claiming to show early evidence of a tantalizing relationship between wolves and regenerating riparian ecosystems since the canines returned to Yellowstone, scientists are still debating how large carnivores impact vegetation and other animals, according to a new paper published this month.Read full article\nComments",
      "content_length": 811,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Hong Kong community groups deliver aid to survivors of Wang Fuk Court fire",
      "link": "https://www.theguardian.com/news/2025/nov/28/hong-kong-community-groups-deliver-aid-to-survivors-of-wang-fuk-court-fire",
      "published": "2025-11-28T12:13:02",
      "content": "Volunteers that emerged during the pro-democracy protests regroup to help those affected by the blazeHong Kong’s grassroots community groups have sprung into action to help coordinate and deliver aid to the survivors of the Wang Fuk Court fire, a catastrophic blaze that is confirmed to have killed at least 128 people, with hundreds still missing.Restaurants, churches and gyms in the Tai Po area, where the Wang Fuk Court housing estate is located, have been turned into temporary shelters for people in need of clothes, food and information as a result of the tragedy. Continue reading...",
      "content_length": 591,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "We put the new pocket-size vinyl format to the test—with mixed results",
      "link": "https://arstechnica.com/gadgets/2025/11/we-put-the-new-pocket-sized-vinyl-format-to-the-test-with-mixed-results/",
      "published": "2025-11-28T12:00:04",
      "content": "We recently looked at Tiny vinyl, a new miniature vinyl single format developed through a collaboration between a toy industry veteran and the world’s largest vinyl record manufacturer. The 4-inch singles are pressed in a process nearly identical to standard 12-inch LPs or 7-inch singles, except everything is smaller. They have a standard-size spindle hole and play at 33⅓ RPM, and they hold up to four minutes of music per side.\nSeveral smaller bands, like The Band Loula and Rainbow Kitten Surprise, and some industry veterans like Blake Shelton and Melissa Etheridge, have already experimented with the format. But Tiny Vinyl partnered with US retail giant Target for its big coming-out party this fall, with 44 exclusive titles launching throughout the end of this year.\nTiny Vinyl supplied a few promotional copies of releases from former America’s Got Talent finalist Grace VanderWaal, The Band Loula, country pop stars Florida Georgia Line, and jazz legends the Vince Guaraldi Trio so I could get a first-hand look at how the records actually play. I tested these titles as well as several others I picked up at retail, playing them on an Audio Technica LP-120 direct drive manual turntable connected to a Yamaha S-301 integrated amplifier and playing through a pair of vintage Klipsch kg4 speakers.Read full article\nComments",
      "content_length": 1334,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Schauspielerin und TV-Star Ingrid van Bergen ist tot",
      "link": "https://www.tagesschau.de/kultur/ingrid-van-bergen-tot-102.html",
      "published": "2025-11-28T11:54:08",
      "content": "   Ingrid van Bergen zählte in den 1950er- und 1960er-Jahren zu den bekanntesten Filmstars des Landes. Einer jüngeren Generation wurde sie als \"Dschungelkönigin\" bekannt. Nun ist sie im Alter von 94 Jahren gestorben.[mehr]",
      "content_length": 222,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Medien in Israel stehen unter massivem politischen Druck",
      "link": "https://www.tagesschau.de/ausland/asien/israel-journalismus-pressefreiheit-100.html",
      "published": "2025-11-28T11:35:39",
      "content": "   Pressefreiheit - davon könne in Israel keine Rede mehr sein. Das berichten mehrere Journalisten, die in dem Land arbeiten. Eine Arbeit, begleitet von Hetzkampagnen, Hass bis hin zu Morddrohungen. Von Ivo Marusczyk.[mehr]",
      "content_length": 223,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Japans Kabinett beschließt 117-Milliarden-Euro-Konjunkturpaket",
      "link": "https://www.tagesschau.de/wirtschaft/weltwirtschaft/japan-konjunkturpaket-106.html",
      "published": "2025-11-28T11:34:16",
      "content": "   Japans neue Premierministerin Takaichi legt ein riesiges Konjunkturpaket auf, um die schwächelnde heimische Wirtschaft anzukurbeln. Nachhaltig ist das nicht, warnen Ökonomen. Von Thorsten Iffland.[mehr]",
      "content_length": 205,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Weather tracker: Snowfall cuts power in Poland and flooding devastates Sri Lanka",
      "link": "https://www.theguardian.com/environment/2025/nov/28/weather-tracker-snowfall-cuts-power-poland-flooding-devastates-sri-lanka",
      "published": "2025-11-28T10:37:59",
      "content": "Temperatures dip to -8.5C in Poland and 250mm of rain falls in 24-hour period across Sri Lanka Temperatures plummeted this week across the eastern half of Europe, with the Alps dipping as low as -20C and to -8.5°C in the Polish town of Zakopane in the Tatras Mountains.Heavy snow also affected other parts of Poland with 15-20cm (about 6-8in) of snow falling in much of the central swathe of the country and more than 40cm in the south towards the mountains. Continue reading...",
      "content_length": 478,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Zahl der Arbeitslosen im November leicht gesunken",
      "link": "https://www.tagesschau.de/inland/innenpolitik/arbeitslosenzahlen-november-106.html",
      "published": "2025-11-28T10:37:53",
      "content": "   Im Herbst zeigt sich am Arbeitsmarkt normalerweise eine leichte Belebung. Laut der Bundesagentur für Arbeit fällt diese jedoch aktuell eher verhalten aus. Die Arbeitslosenquote sank nur minimal um 0,1 Prozentpunkte auf 6,1 Prozent.[mehr]",
      "content_length": 240,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Asahi-Brauerei: Daten von fast 2 Millionen Personen abgeflossen",
      "link": "https://www.heise.de/news/Asahi-Brauerei-Daten-von-fast-2-Millionen-Personen-abgeflossen-11096297.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-28T10:20:00",
      "content": "Anfang Oktober wurde ein IT-Angriff auf die japanische Asahi-Brauerei bekannt. Daten von rund 2 Millionen Menschen sind abgeflossen.",
      "content_length": 132,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Zahl der Toten steigt, Lage bleibt angespannt",
      "link": "https://www.tagesschau.de/ausland/asien/ueberschwemmungen-suedostasien-opfer-100.html",
      "published": "2025-11-28T10:08:35",
      "content": "   Große Teile Indonesiens, Malaysias und Thailands kämpfen seit einer Woche mit sintflutartigen Regenfällen. Ein Zyklon hat zudem Sri Lanka getroffen. Die Zahl der Todesopfer steigt weiter an.[mehr]",
      "content_length": 199,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Koalitionsspitzen einigen sich im Rentenstreit",
      "link": "https://www.tagesschau.de/inland/innenpolitik/einigung-koalitionsausschuss-rentenpaket-100.html",
      "published": "2025-11-28T10:03:39",
      "content": "   Die Spitzen der schwarz-roten Koalition haben sich im Rentenstreit geeinigt. Der Gesetzentwurf soll bleiben, wie er ist - mit einem Begleittext will die Regierung aber auf die Junge Union zugehen, die sich gegen die Rentenpläne stellt.[mehr]",
      "content_length": 244,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Wirtschaftsmathematik: Kann man faire Löhne mathematisch berechnen?",
      "link": "https://www.tagesschau.de/wissen/forschung/loehne-mathematik-100.html",
      "published": "2025-11-28T10:00:27",
      "content": "   Dass Wirtschaft mit Zahlen und letztendlich auch mit Mathematik zusammenhängt, ist klar. Doch kann die Mathematik auch helfen herauszufinden, wie Lohngerechtigkeit geht? Ein Chemnitzer Wissenschaftler hat darüber nachgedacht. Von R. Rönsch. [mehr]",
      "content_length": 250,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Africa’s forests transformed from carbon sink to carbon source, study finds",
      "link": "https://www.theguardian.com/environment/2025/nov/28/africa-forests-transformed-carbon-sink-carbon-source-study",
      "published": "2025-11-28T10:00:03",
      "content": "Alarming shift since 2010 means planet’s three main rainforest regions now contribute to climate breakdownAfrica’s forests have turned from a carbon sink into a carbon source, according to research that underscores the need for urgent action to save the world’s great natural climate stabilisers.The alarming shift, which has happened since 2010, means all of the planet’s three main rainforest regions – the South American Amazon, south-east Asia and Africa – have gone from being allies in the fight against climate breakdown to being part of the problem. Continue reading...",
      "content_length": 577,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Handel erwartet maues Weihnachtsgeschäft",
      "link": "https://www.tagesschau.de/wirtschaft/verbraucher/weihnachtsgeschaeft-einzelhandel-konsum-100.html",
      "published": "2025-11-28T09:12:12",
      "content": "   Vor dem so wichtigen Weihnachtsgeschäft hat der Einzelhandel mit einem überraschenden Umsatzschwund zu kämpfen. Angesichts der schwachen Konjunktur halten die Bürger ihr Geld lieber zusammen. [mehr]",
      "content_length": 201,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "ICE nimmt Ehepartner von US-Bürgern bei Greencard-Interviews fest",
      "link": "https://www.tagesschau.de/ausland/amerika/usa-greencard-festgenommen-100.html",
      "published": "2025-11-28T07:23:46",
      "content": "   Mehrere ausländische Ehepartner von US-Bürgern wurden offenbar bei ihren Greencard-Interviews festgenommen - von der Immigrationsbehörde ICE. Darunter ist auch ein Deutscher. Offiziell geht es wohl um abgelaufene Visa. Von A. Sieb[mehr]",
      "content_length": 239,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Windows: Weitere Lösungen für unerwartete Benutzerkontensteuerungs-Prompts",
      "link": "https://www.heise.de/news/Windows-Weitere-Loesungen-fuer-unerwartete-Benutzerkontensteuerungs-Prompts-11096041.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-28T07:22:00",
      "content": "Nach den August-Updates erscheinen öfter unerwartet Benutzerkontensteuerungs-Prompts in Windows. Microsoft bessert ein wenig nach.",
      "content_length": 130,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Podcast 15 Minuten: Demo gegen AfD-Jugend, Plastiktüten, Trainersuche",
      "link": "https://www.tagesschau.de/multimedia/podcast/15-minuten-afd-jugend-plastiktueten-trainersuche-100.html",
      "published": "2025-11-28T07:17:09",
      "content": "   Gießen erwartet 50.000 Demonstranten zu AfD-Jugendtreffen. Fünf Jahre ohne große Plastiktüten beim Einkauf. Trainer gesucht: Wie Sportvereine die Jugendarbeit retten. Das sind die Themen im Podcast 15 Minuten.[mehr]",
      "content_length": 218,
      "source": "Tagesschau",
      "category": "German News"
    }
  ]
}