{
  "metadata": {
    "timestamp": "2025-11-17T07:14:37.620268",
    "deduplicated_at": "2025-11-17 07:14:37",
    "lookback_days": 7,
    "total_input": 1044,
    "duplicates_removed": 928,
    "new_articles": 116,
    "deduplication_rate": "88.9%",
    "historical_files_checked": 5
  },
  "articles": [
    {
      "title": "Monday briefing: How Trump and his allies flipped and flipped again on the Epstein files",
      "link": "https://www.theguardian.com/world/2025/nov/17/monday-briefing-how-trump-and-his-allies-flipped-and-flipped-again-on-the-epstein-files",
      "published": "2025-11-17T07:03:47",
      "content": "In today’s newsletter: Having once demanded full disclosure, senior Maga figures have attempted to block efforts to publish the recordsGood morning. Leading Republicans were once full-throated in their calls for the release of every single scrap of information the US government might hold on the sex trafficker Jeffrey Epstein and his ties to the establishment.Years of Maga supporters entertaining the QAnon-fuelled frenzy of pizzagate conspiracies seemed to have pushed senior GOP figures in a direction where they believed publication of more information on the Epstein case would expose the Democratic party elite and the “wokerati” of Hollywood as vile sex fiends.Immigration | Refugees who have established lives with homes and families in the UK – including Ukrainians – will face having to return if their home countries become safe, Shabana Mahmood, the home secretary, has said.BBC | The BBC should not pay any money to Donald Trump, the former BBC director general Tony Hall has said. The US president has said he plans to sue the BBC for up to $5bn (£3.8bn) despite receiving the apology he demanded over a misleading Panorama edit of his 6 January speech.Roman Abramovich | The former Chelsea owner is making a claim of “conspiracy” against the government of Jersey after the crown dependency launched a criminal investigation into allegations of corruption and money laundering in connection with the original source of the oligarch’s wealth.Cop30 | Brazil’s environment minister, Marina Silva, has urged all countries to have the courage to address the need for a fossil fuel phase-out, calling the drawing up of a roadmap for it an “ethical” response to the climate crisis.Labour | Allies of Angela Rayner say the former deputy prime minister would be likely to run in any future leadership contest and will seek to renew her public profile in the coming months. Continue reading...",
      "content_length": 1899,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "At least 98 Palestinians have died in custody since October 2023, Israeli data shows",
      "link": "https://www.theguardian.com/world/2025/nov/17/at-least-98-palestinians-have-died-in-custody-since-october-2023-israeli-data-shows",
      "published": "2025-11-17T07:00:04",
      "content": "Exclusive: Real toll likely substantially higher as hundreds of detainees from Gaza are missing, says human rights groupIsraeli data shows at least 98 Palestinians have died in custody since October 2023, and the real toll is likely substantially higher because hundreds of people detained in Gaza are missing, an Israel-based human rights group has said.Physicians for Human Rights (PHR) tracked deaths from causes including physical violence, medical neglect and malnutrition for a new report, using freedom of information requests, forensic reports and interviews with lawyers, activists, relatives and witnesses. Continue reading...",
      "content_length": 636,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Europe banned new gas cars after 2035 — now it’s reconsidering",
      "link": "https://www.theverge.com/transportation/820398/eu-gas-car-ban-2035-weaken-climate",
      "published": "2025-11-17T07:00:00",
      "content": "\n\n\n\t\n\t\t\n\nMercedes-Benz CEO Ola K&auml;llenius is the eternal optimist, and for good reason. He has long pushed the European Union to roll back its lofty goal of phasing out new internal combustion engine cars, arguing that weakening the rules was a return to pragmatism and not capitulation to opponents of Europe's green agenda.\nHis push is working. The rigid deadlines for phasing out combustion engines after 2035 are \"no longer feasible,\" K&auml;llenius told The Verge in a recent interview, given infrastructure bottlenecks and the sluggish adoption of EVs by consumers. More flexibility was needed to protect jobs and competitiveness, give consumers greater cho …\nRead the full story at The Verge.",
      "content_length": 703,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Westjordanland: Netanjahu kritisiert erstmals Siedlergewalt",
      "link": "https://www.tagesschau.de/ausland/asien/westjordanland-siedler-gewalt-100.html",
      "published": "2025-11-17T06:49:38",
      "content": "   Angriffe radikaler Siedler auf Palästinenser nehmen zu - nun will Israels Premier Netanjahu nach eigenen Angaben dagegen vorgehen. Bisher hatte er dazu geschwiegen. Kurz nach seiner Ankündigung gab es erste Festnahmen.[mehr]",
      "content_length": 227,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "South African man’s visa cancelled after neo-Nazi rally outside NSW parliament",
      "link": "https://www.theguardian.com/society/2025/nov/17/south-african-mans-visa-cancelled-after-neo-nazi-rally-outside-nsw-parliament",
      "published": "2025-11-17T06:35:42",
      "content": "Home affairs minister says ‘if you are on a visa you are a guest’ as Matthew Gruter has visa cancelledGet our breaking news email, free app or daily news podcastA South African man who took part in a neo-Nazi group’s anti-Jewish lobby protest outside the New South Wales state parliament has had his visa cancelled and will be forced to leave Australia.The home affairs minister, Tony Burke, cancelled the visa of South African national Matthew Gruter on Monday, more than a week after the demonstration. Continue reading...",
      "content_length": 524,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Rentenpaket - Ministerin Prien will Abstimmung im Bundestag verschieben",
      "link": "https://www.deutschlandfunk.de/ministerin-prien-will-abstimmung-im-bundestag-verschieben-102.html",
      "published": "2025-11-17T06:35:07",
      "content": "Im Streit über das geplante Rentenpaket der Regierung plädiert auch Bundesfamilienministerin Prien dafür, die Abstimmung im Parlament zu verschieben. Bundeskanzler Merz bietet unterdessen einen Kompromissvorschlag an. Doch ob dieser die Gemüter beruhigen dürfte, ist fraglich.",
      "content_length": 276,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "China-Reise - Bundesfinanzminister Klingbeil pocht auf fairen Wettbewerb",
      "link": "https://www.deutschlandfunk.de/bundesfinanzminister-klingbeil-pocht-auf-fairen-wettbewerb-100.html",
      "published": "2025-11-17T06:35:07",
      "content": "Zum Auftakt seiner China-Reise hat Bundesfinanzminister Klingbeil einen fairen Wettbewerb sowie einen besseren Marktzugang für deutsche Unternehmen gefordert. Klingbeil reist als erster Minister der schwarz-roten Bundesregierung in die Volksrepublik.",
      "content_length": 250,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Westbalkan-Reise - Wadephul in Sarajevo: Außenminister ruft Bosnien-Herzegowina auf, Weg Richtung EU weiterzugehen",
      "link": "https://www.deutschlandfunk.de/wadephul-in-sarajevo-aussenminister-ruft-bosnien-herzegowina-auf-weg-richtung-eu-weiterzugehen-106.html",
      "published": "2025-11-17T06:35:07",
      "content": "Zum Auftakt seiner Westbalkan-Reise hat Bundesaußenminister Wadephul Bosnien-Herzegowina dazu aufgerufen, den Weg in Richtung EU weiterzugehen.",
      "content_length": 143,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Ecuador - Bevölkerung lehnt in Referendum US-Militärbasen ab",
      "link": "https://www.deutschlandfunk.de/bevoelkerung-lehnt-in-referendum-us-militaerbasen-ab-100.html",
      "published": "2025-11-17T06:35:07",
      "content": "In Ecuador wird es in absehbarer Zeit keine US-Militärbasen geben.",
      "content_length": 66,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Präsidentschaftswahl in Chile - Jara und Kast ziehen in Stichwahl ein",
      "link": "https://www.deutschlandfunk.de/jara-und-kast-ziehen-in-stichwahl-ein-104.html",
      "published": "2025-11-17T06:35:07",
      "content": "In Chile wird eine Stichwahl darüber entscheiden, wer die Präsidentschaft des Landes übernimmt.",
      "content_length": 95,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Epstein-Akten - US-Präsident Trump spricht sich doch für Abstimmung über Freigabe aus",
      "link": "https://www.deutschlandfunk.de/us-praesident-trump-spricht-sich-doch-fuer-abstimmung-ueber-freigabe-aus-100.html",
      "published": "2025-11-17T06:35:07",
      "content": "US-Präsident Trump hat sich nun doch für eine Abstimmung des Repräsentantenhauses über eine Freigabe von Akten zum Sexualstraftäter Epstein ausgesprochen. Die Republikaner sollten mit \"Ja\" stimmen, denn man habe nichts zu verbergen, schrieb Trump auf seiner Onlineplattform Truth Social.",
      "content_length": 287,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Kampf gegen Drogenschmuggel - USA wollen venezolanisches Kartell auf Terrorliste setzen; Präsident Trump: Gespräche mit Maduro möglich",
      "link": "https://www.deutschlandfunk.de/usa-wollen-venezolanisches-kartell-auf-terrorliste-setzen-praesident-trump-gespraeche-mit-maduro-moe-100.html",
      "published": "2025-11-17T06:35:07",
      "content": "Die USA wollen inmitten der wachsenden Spannungen mit Venezuela das Drogenkartell \"Cartel de los Soles\" als ausländische Terrororganisation einstufen.",
      "content_length": 150,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Russischer Angriffskrieg - Ukrainischer Außenminister bittet um Geld für Drohnen",
      "link": "https://www.deutschlandfunk.de/ukrainischer-aussenminister-bittet-um-geld-fuer-drohnen-108.html",
      "published": "2025-11-17T06:35:07",
      "content": "Der ukrainische Außenminister Sybiha hat die Unterstützer seines Landes um Geld für die Drohnenproduktion gebeten. Kremlchef Putin werde den Krieg nur beenden, wenn zwei Faktoren einträten, schrieb er auf Social Media. Zum einen müsse Putin \"die Illusion verlieren\", dass er noch auf dem Schlachtfeld gewinnen könne.",
      "content_length": 316,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Genf - WHO-Konferenz berät über Umgang mit Tabak und Nikotin",
      "link": "https://www.deutschlandfunk.de/who-konferenz-beraet-ueber-umgang-mit-tabak-und-nikotin-102.html",
      "published": "2025-11-17T06:35:07",
      "content": "Bei einer WHO-Konferenz in Genf beraten ab heute Vertreter der mehr als 180 Vertragsstaaten der Anti-Tabak-Konvention.",
      "content_length": 118,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Nach Kritik - Auktionshaus sagt Judenstern-Versteigerung ab",
      "link": "https://www.deutschlandfunk.de/auktionshaus-sagt-judenstern-versteigerung-ab-110.html",
      "published": "2025-11-17T06:35:07",
      "content": "Die vom Internationalen Auschwitz Komitee kritisierte Versteigerung von Dokumenten aus der NS-Zeit in Neuss ist abgesagt worden.",
      "content_length": 128,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Israel - Netanjahu: Gehen gegen Siedlergewalt vor, verantwortlich ist kleine Minderheit",
      "link": "https://www.deutschlandfunk.de/netanjahu-gehen-gegen-siedlergewalt-vor-verantwortlich-ist-kleine-minderheit-108.html",
      "published": "2025-11-17T06:35:07",
      "content": "Der israelische Ministerpräsident Netanjahu will hart gegen die Gewalt jüdischer Siedler im Westjordanland vorgehen.",
      "content_length": 116,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Libanon - Israelische Soldaten eröffnen Feuer auf UNO-Blauhelme - keine Verletzten",
      "link": "https://www.deutschlandfunk.de/israelische-soldaten-eroeffnen-feuer-auf-uno-blauhelme-keine-verletzten-102.html",
      "published": "2025-11-17T06:35:07",
      "content": "Israelische Soldaten haben im Südlibanon das Feuer auf UNO-Blauhelmsoldaten eröffnet.",
      "content_length": 85,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Westafrika - Viele Tote bei Minen-Vorfall im Kongo",
      "link": "https://www.deutschlandfunk.de/viele-tote-bei-minen-vorfall-im-kongo-106.html",
      "published": "2025-11-17T06:35:07",
      "content": "Bei einem Vorfall in einer Mine in der Demokratischen Republik Kongo sind zahlreiche Menschen ums Leben gekommen.",
      "content_length": 113,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Philippinen - Hunderttausende bei Anti-Korruptionsprotest in Manila",
      "link": "https://www.deutschlandfunk.de/hunderttausende-bei-anti-korruptionsprotest-in-manila-108.html",
      "published": "2025-11-17T06:35:07",
      "content": "Auf den Philippinen haben hunderttausende Menschen gegen Korruption protestiert.",
      "content_length": 80,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Schleswig-Holstein - SPD stellt künftig nicht mehr Oberbürgermeister in Kiel - Stichwahl am 7. Dezember",
      "link": "https://www.deutschlandfunk.de/spd-stellt-kuenftig-nicht-mehr-oberbuergermeister-in-kiel-stichwahl-am-7-dezember-104.html",
      "published": "2025-11-17T06:35:07",
      "content": "Die SPD stellt künftig nicht mehr den Oberbürgermeister in Schleswig-Holsteins Landeshauptstadt Kiel.",
      "content_length": 101,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Deutschlandtag der Jungen Union - Söder: AfD-Politiker sind \"Hofnarren Putins\"",
      "link": "https://www.deutschlandfunk.de/soeder-afd-politiker-sind-hofnarren-putins-102.html",
      "published": "2025-11-17T06:35:07",
      "content": "Auf dem Deutschlandtag der Jungen Union hat der CSU-Vorsitzende Söder die AfD scharf kritisiert. Der bayerische Ministerpräsident sprach in einer Rede vor den Delegierten im südbadischen Rust von \"Hofnarren Putins\". \"Diese Truppe, das sind Bücklinge, das sind Kremlknechte\", sagte Söder.",
      "content_length": 287,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Klimakonferenz - Spanien und Frankreich für Abgabe auf Luxus-Flugreisen",
      "link": "https://www.deutschlandfunk.de/spanien-und-frankreich-fuer-abgabe-auf-luxus-flugreisen-102.html",
      "published": "2025-11-17T06:35:07",
      "content": "Frankreich und Spanien werben auf der Weltklimakonferenz in Brasilien zusammen mit sieben weiteren Staaten für eine extra Abgabe auf Businessclass-Flugtickets und Reisen mit Privatjets. \"Wer mehr verschmutzt, sollte auch mehr beitragen\", sagte die spanische Botschafterin in Brasilien.",
      "content_length": 285,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Migrations-Politik - Großbritannien plant deutliche Asylrechts-Verschärfung nach dänischem Vorbild",
      "link": "https://www.deutschlandfunk.de/grossbritannien-plant-deutliche-asylrechts-verschaerfung-nach-daenischem-vorbild-122.html",
      "published": "2025-11-17T06:35:07",
      "content": "Die britische Labour-Regierung will ihre Asylpolitik deutlich verschärfen.",
      "content_length": 74,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Iran - \"Cloud Seeding\" soll Regen erzeugen - Kampf gegen Dürre",
      "link": "https://www.deutschlandfunk.de/cloud-seeding-soll-regen-erzeugen-kampf-gegen-duerre-106.html",
      "published": "2025-11-17T06:35:07",
      "content": "Angesichts der anhaltenden Dürre im Iran weitet das dortige Regime seine Bemühungen aus, die Wasserversorgung in dem Land zu verbessern. Nun soll das sogenannte \"Cloud Seeding\" helfen.",
      "content_length": 184,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Kurz nach Eröffnung - Ägypten-Museum beschränkt Besuchszeit",
      "link": "https://www.deutschlandfunk.de/aegypten-museum-beschraenkt-besuchszeit-106.html",
      "published": "2025-11-17T06:35:07",
      "content": "Rund zwei Wochen nach der feierlichen Eröffnung des neuen Großen Ägyptischen Museums in Kairo ist die Besuchszeit eingeschränkt worden. Seit dem Wochenende können Eintrittskarten nur noch für bestimmte Zeitfenster gebucht werden. Ab Anfang Dezember werde der Ticketverkauf bis auf Weiteres nur noch online möglich sein, hieß es in einer Mitteilung der Museumsverwaltung.",
      "content_length": 370,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Religion - Höchste Marienstatue der Welt steht jetzt in Brasilien",
      "link": "https://www.deutschlandfunk.de/hoechste-marienstatue-der-welt-steht-jetzt-in-brasilien-110.html",
      "published": "2025-11-17T06:35:07",
      "content": "In Brasilien ist die höchste Marienstatue der Welt eingeweiht worden.",
      "content_length": 69,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Qualifikation - Haaland schießt Norwegen zur WM - und Italien in die Playoffs",
      "link": "https://www.deutschlandfunk.de/haaland-schiesst-norwegen-zur-wm-und-italien-in-die-playoffs-106.html",
      "published": "2025-11-17T06:35:07",
      "content": "Die norwegische Fußballnationalmannschaft hat sich mit einem Sieg über Italien für die Fußball-Weltmeisterschaft 2026 in den USA, Kanada und Mexiko qualifiziert. Das Team um Superstar Erling Haaland gewann im Mailänder San-Siro-Stadion 4:1 und ist damit erstmals seit 1998 wieder bei einer WM dabei.",
      "content_length": 299,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Leipzig - Tausende Fußballfans demonstrieren gegen geplante Sicherheitsmaßnahmen",
      "link": "https://www.deutschlandfunk.de/tausende-fussballfans-demonstrieren-gegen-geplante-sicherheitsmassnahmen-112.html",
      "published": "2025-11-17T06:35:07",
      "content": "Mehrere tausend Fußballfans aus dem gesamten Bundesgebiet haben in Leipzig gegen schärfere Sicherheitsmaßnahmen in den Stadien demonstriert. Sie versammelten sich vor dem Hauptbahnhof und zogen von dort durch die Stadt. Laut Polizeiangaben nahmen etwa 8.000 Anhänger von 38 Clubs teil.",
      "content_length": 285,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Wetter - Weitere Niederschläge, im Tagesverlauf nachlassend, 4 bis 9 Grad",
      "link": "https://www.deutschlandfunk.de/weitere-niederschlaege-im-tagesverlauf-nachlassend-4-bis-9-grad-100.html",
      "published": "2025-11-17T06:35:07",
      "content": "Das Wetter: Am Tag wechselnd wolkig mit Schauern, vereinzelt auch kurze Graupelgewitter. Im Nordwesten und Norden am Nachmittag zunehmende Aufheiterungen und länger trocken. Im Süden und Südosten überwiegend bedeckt mit Regen. 4 bis 9 Grad. Morgen im Norden und Westen stark bewölkt mit Regen. Im Süden weitgehend trocken und länger sonnig. 3 bis 9 Grad.",
      "content_length": 354,
      "source": "Deutschlandfunk",
      "category": "German News"
    },
    {
      "title": "Turnbull says Coalition consumed by ‘fact-free, reality-free’ climate culture war – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/nov/17/australia-news-live-schools-act-asbestos-education-sand-coalition-climate-energy-net-zero-sussan-ley-leadership-challenge-andrew-hastie-liberals-nationals-ntwnfb",
      "published": "2025-11-17T06:32:52",
      "content": "This blog is now closedSouth African man’s visa cancelled after neo-Nazi rally outside NSW parliamentGet our breaking news email, free app or daily news podcastFactchecking five Coalition claims about net zero, from power prices to the $9tn costAs Liberals join Nationals in abandoning a 2050 emissions target, we unpick some of the opposition’s talking points. Continue reading...",
      "content_length": 381,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Berlin: Polizei gibt nach Anschlagsdrohungen gegen Schulen Entwarnung",
      "link": "https://www.tagesschau.de/inland/regional/berlin/polizei-anschlagsdrohung-berlin-schulen-entwarnung-100.html",
      "published": "2025-11-17T06:19:29",
      "content": "   Anschlagsdrohungen gegen Berliner Schulen haben für Unruhe bei Schülern und Eltern gesorgt. Nun versucht die Polizei zu beruhigen: Hinweise auf Gefährdungen lägen nicht vor. Dennoch werden Beamte rund um Schulen postiert.[mehr]",
      "content_length": 230,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "2026 World Cup: France dominate Azerbaijan as they end qualifiers unbeaten",
      "link": "https://www.france24.com/en/tv-shows/sports/20251117-2026-world-cup-france-dominate-azerbaijan-as-they-end-qualifiers-unbeaten",
      "published": "2025-11-17T06:18:41",
      "content": "France defeated Azerbaijan (3-1). France had already qualified.",
      "content_length": 63,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Patentstreit: US-Jury verhängt 634 Millionen US-Dollar Strafe gegen Apple",
      "link": "https://www.heise.de/news/Patentstreit-US-Jury-verhaengt-634-Millionen-US-Dollar-Strafe-gegen-Apple-11080515.html?wt_mc=rss.red.ho.top-news.atom.beitrag.beitrag",
      "published": "2025-11-17T06:04:00",
      "content": "Eine Jury in den USA hat einem Medizingerätehersteller recht gegeben und Patentverstöße in der Apple Watch erkannt. Apple soll 634 Millionen US-Dollar zahlen.",
      "content_length": 158,
      "source": "Heise Top",
      "category": "Tech News"
    },
    {
      "title": "Geheimabsprachen über Signal-Chats",
      "link": "https://www.tagesschau.de/investigativ/swr/signal-chats-eu-aussen-politik-geheimabsprachen-100.html",
      "published": "2025-11-17T05:00:55",
      "content": "   Die EU-Außenminister tauschen sich über eine Signal-Chat-Gruppe aus - laut SWR und Follow the Money finden sich darin auch Inhalte, die der Geheimhaltung unterliegen und deren Offenlegung EU-Staaten schaden könnten. Die EU wiegelt ab.[mehr]",
      "content_length": 243,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Kryptoanlagen - Magneten für schmutziges Geld",
      "link": "https://www.tagesschau.de/investigativ/ndr-wdr/krypto-waehrungen-geldwaesche-100.html",
      "published": "2025-11-17T05:00:23",
      "content": "   Betrug mit sogenannten Krypto-Währungen nimmt weltweit zu. Allein in den vergangenen zwei Jahren sollen mindestens 25 Milliarden Euro an illegalen Geldern in Krypto-Börsen gewaschen worden sein - das zeigt eine internationale Recherche.[mehr]",
      "content_length": 245,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Rape victims in Scotland will be protected when giving evidence, says lord advocate",
      "link": "https://www.theguardian.com/uk-news/2025/nov/17/rape-victims-in-scotland-will-be-protected-when-giving-evidence-says-lord-advocate",
      "published": "2025-11-17T05:00:05",
      "content": "Supreme court ruled ‘rape shield’ laws to limit intrusive cross-examination may breach men’s right to fair trialScotland’s most senior law officer has moved to reassure victims of sexual abuse that they will be protected after a supreme court ruling warned that Scottish laws designed to limit intrusive cross-examination could be breaching men’s right to a fair trial.In a strongly worded statement, the lord advocate, Dorothy Bain KC, said: “I would like to make clear that I understand sexual abuse inflicted upon women and children to be the single greatest challenge our justice system faces. Continue reading...",
      "content_length": 617,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "With neonicotinoid pesticide ban, France’s birds make a tentative recovery - study",
      "link": "https://www.theguardian.com/environment/2025/nov/17/france-wildlife-insect-bird-numbers-rise-neonicotinoid-pesticide-ban-aoe",
      "published": "2025-11-17T05:00:03",
      "content": "Analysis shows small hike in populations of insect-eating species after 2018 ruling, but full recovery may take decadesInsect-eating bird populations in France appear to be making a tentative recovery after a ban on bee-harming pesticides, according to the first study to examine how wildlife is returning in Europe.Neonicotinoids are the world’s most common class of insecticides, widely used in agriculture and for flea control in pets. By 2022, four years after the European Union banned neonicotinoid use in fields, researchers observed that France’s population of insect-eating birds had increased by 2%-3%. These included blackbirds, blackcaps and chaffinches, which feed on insects as adults and as chicks. Continue reading...",
      "content_length": 733,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Trump will doch Freigabe der Epstein-Akten",
      "link": "https://www.tagesschau.de/ausland/amerika/trump-epstein-110.html",
      "published": "2025-11-17T04:30:28",
      "content": "   Es ist eine Kehrtwende: US-Präsident Trump hat sich nun doch für die Veröffentlichung der Epstein-Akten ausgesprochen. Man habe nichts zu verbergen, teilte Trump mit - und empfahl seinen Republikanern, für die Freigabe zu stimmen.[mehr]",
      "content_length": 239,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Moderates rally around Sussan Ley as Liberal leader says she has been underestimated for much of her life",
      "link": "https://www.theguardian.com/australia-news/2025/nov/17/moderates-rally-around-sussan-ley-as-liberal-leader-says-she-has-been-underestimated-for-much-of-her-life",
      "published": "2025-11-17T04:25:46",
      "content": "Factional powerbrokers issue statement contradicting media reports that moderates could swing behind conservative Andrew HastieGet our breaking news email, free app or daily news podcastSenior Liberal moderates are rallying around Sussan Ley after speculation that members of the faction could withdraw support for her struggling leadership in the fallout to the decision to dump a net zero emissions target.Factional powerbrokers Anne Ruston and Maria Kovacic issued a statement on Monday disputing reports in The Australian that moderates could swing behind the West Australian conservative Andrew Hastie in a potential challenge against Ley. Continue reading...",
      "content_length": 664,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Finanzminister Klingbeil reist nach China - und erntet Kritik",
      "link": "https://www.tagesschau.de/inland/innenpolitik/klingbeil-chinareise-100.html",
      "published": "2025-11-17T04:06:46",
      "content": "   Der Besuch von Außenminister Wadephul nach China war zuletzt geplatzt. Finanzminister Klingbeil reist nun trotzdem in das Land - und muss sich Kritik anhören. Es brauche keine \"Peking-Connection\", sagen die Grünen. [mehr]",
      "content_length": 224,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Weltklimakonferenz in Belém: Die Woche der Entscheidung?",
      "link": "https://www.tagesschau.de/ausland/amerika/cop-brasilien-100.html",
      "published": "2025-11-17T03:34:00",
      "content": "   Im brasilianischen Belém startet die zweite Woche der Weltklimakonferenz. Jetzt stehen die Minister im Mittelpunkt - die heiße Phase der Verhandlungen beginnt. Von Janina Schreiber.[mehr]",
      "content_length": 190,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Trump reverses course to call on Republicans to release more Epstein files",
      "link": "https://www.france24.com/en/americas/20251117-trump-release-epstein-files",
      "published": "2025-11-17T03:33:20",
      "content": "US President Donald Trump on Sunday backed Republican lawmakers’ efforts to release more files on sex offender Jeffrey Epstein, despite previously opposing the move. Trump wrote on Truth Social that “we have nothing to hide”, while accusing Democrats of fuelling an “Epstein hoax” over newly surfaced emails.",
      "content_length": 308,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Wie sich die Persönlichkeit entwickelt",
      "link": "https://www.tagesschau.de/wissen/gesundheit/wie-sich-die-persoenlichkeit-entwickelt-100.html",
      "published": "2025-11-17T03:02:48",
      "content": "   Schüchtern, besorgt, aufbrausend - die eigene Persönlichkeit ist nicht in Stein gemeißelt. Eine Studie zeigt: Eine Krankheit, die Umwelt oder der eigene Wille können den Charakter formen - auch im hohen Alter. Von Katharina Bruns.[mehr]",
      "content_length": 239,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Why Labour is going Danish on immigration – podcast",
      "link": "https://www.theguardian.com/news/audio/2025/nov/17/why-labour-is-going-danish-on-immigration-podcast",
      "published": "2025-11-17T03:00:00",
      "content": "Danish journalist Nilas Heinskou and Syrian refugee Agob Yacoub discuss Denmark’s harsh immigration and asylum policies – reportedly the inspiration for changes to be announced by the UK government this weekThe home secretary, Shabana Mahmood, is expected to announce a radical overhaul of the UK’s asylum and immigration system, modelled in part on what Denmark has done over the past decade.Since 2019 Denmark’s centre-left government has been trying something new: its normal social democratic manifesto, alongside a series of harsh policies around immigration and asylum – even bulldozing estates deemed to contain too many residents of “non-western” origin. Continue reading...",
      "content_length": 682,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "US attacks another alleged drug boat in Pacific, killing three, as Trump signals possible talks with Maduro",
      "link": "https://www.theguardian.com/us-news/2025/nov/16/pentagon-military-drug-boat-strike",
      "published": "2025-11-17T02:59:02",
      "content": "Strike comes as navy’s most advanced aircraft carrier arrives in Caribbean Sea and president says US may open talks with Venezuelan leaderThe United States conducted another attack on an alleged drug trafficking boat in the eastern Pacific on Saturday, killing three people aboard, the Pentagon said on Sunday.“Intelligence confirmed that the vessel was involved in illicit narcotics smuggling, transiting along a known narco-trafficking route, and carrying narcotics,” the US Southern Command announced in a post on social media. Continue reading...",
      "content_length": 550,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Ecuador rejects return of US military bases in major setback for President Noboa",
      "link": "https://www.france24.com/en/americas/20251117-ecuador-us-military-bases",
      "published": "2025-11-17T02:41:00",
      "content": "Ecuadorans on Sunday rejected the return of US military bases, early referendum results showed, dealing a setback to Trump-aligned President Daniel Noboa. With more than half the ballots counted, about 60 percent of voters opposed lifting the country’s long-standing ban on hosting foreign military facilities.",
      "content_length": 310,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "UN Security Council to vote on US plan establishing international force for Gaza",
      "link": "https://www.france24.com/en/live-news/20251117-un-security-council-set-to-vote-on-international-force-for-gaza",
      "published": "2025-11-17T02:33:17",
      "content": "UN Security Council members are set on Monday to vote on a US proposal for a UN mandate establishing an International Stabilization Force (ISF) in the Gaza Strip tasked with securing border areas and demilitarising the war-torn Palestinian territory. The draft resolution also leaves the door open to future Palestinian statehood.",
      "content_length": 330,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Drogenschmuggel: USA attackieren Boot - Flugzeugträger im Einsatzgebiet",
      "link": "https://www.tagesschau.de/ausland/amerika/drogenschmuggel-kriegsschiff-usa-100.html",
      "published": "2025-11-17T02:07:41",
      "content": "   Die Spannungen zwischen den USA und Venezuela nehmen zu. Erneut haben die USA ein Boot angegriffen. Der Flugzeugträger \"Gerald R. Ford\" hat inzwischen sein Einsatzgebiet erreicht. Und ein Kartell soll als Terrorgruppe eingestuft werden.[mehr]",
      "content_length": 245,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Präsidentschaftswahl in Chile: Jara und Kast ziehen in die Stichwahl",
      "link": "https://www.tagesschau.de/ausland/amerika/chile-praesidentschaftswahl-100.html",
      "published": "2025-11-17T01:53:55",
      "content": "   Zwar hat die Kommunistin Jara die erste Runde der Präsidentschaftswahl in Chile gewonnen - doch sie muss in die Stichwahl. Und dort kann ihr Konkurrent Kast mit seinem harten Migrationskurs auf die Konservativen zählen.[mehr]",
      "content_length": 228,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Crime-weary Chile sends leftist Jara and far-right Kast to presidential run-off",
      "link": "https://www.france24.com/en/americas/20251117-leftist-far-right-chilean-presidential-run-off",
      "published": "2025-11-17T01:42:01",
      "content": "Chile’s former labor minister Jeannette Jara and far-right leader Jose Antonio Kast will face a presidential run-off after leading Sunday’s first-round vote, provisional results showed. With 82.97 percent of the vote counted, Jara had 26.71 percent and Kast 24.12 percent. The campaign has been dominated by rising violent crime blamed on foreign gangs.",
      "content_length": 353,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Dugald Saunders steps down as NSW Nationals leader with speculation the Liberals’ Mark Speakman could follow",
      "link": "https://www.theguardian.com/australia-news/2025/nov/17/dugald-saunders-steps-down-as-nsw-nationals-leader-with-speculation-the-liberals-mark-speakman-could-follow",
      "published": "2025-11-17T01:33:43",
      "content": "Saunders says ‘it is the right time for me to take a step back and focus on my family and myself’, week after state Nationals dump net zero commitmentFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastThe New South Wales Nationals leader, Dugald Saunders, has stepped down from the role ahead of a party room meeting, citing family reasons.It comes as the state Coalition faces similar turmoil to its federal counterpart over climate policy. The NSW Nationals voted last week to abandon a net zero emissions target by 2050. Continue reading...",
      "content_length": 605,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Reiches Reise an den Golf: Werben um Gaslieferungen und Investitionen",
      "link": "https://www.tagesschau.de/inland/reiche-golfstaaten-100.html",
      "published": "2025-11-17T01:31:45",
      "content": "   Nach dem von Katar angedrohten Gas-Lieferstopp sucht die Bundesregierung das direkte Gespräch. Bei ihrer Reise in die Golfregion will Wirtschaftsministerin Reiche aber nicht nur über Energielieferungen sprechen. Von Jannik Pentz.[mehr]",
      "content_length": 238,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Zelensky expected in Paris to seek new arms deals as Russian strikes intensify",
      "link": "https://www.france24.com/en/europe/20251117-zelensky-french-arms-ukraine-defense",
      "published": "2025-11-17T01:25:31",
      "content": "Ukrainian President Volodymyr Zelensky is expected to sign deals in Paris on Monday with France for air-defence systems, warplanes and missiles, aiming to strengthen Kyiv’s long-term war effort. He meets President Emmanuel Macron as Russian drone and missile strikes intensify and Moscow claims gains in the Zaporizhzhia region.",
      "content_length": 328,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Sky Sports killed off its female-focused Halo brand after just three days",
      "link": "https://www.theverge.com/news/821807/sky-sports-halo-women-tiktok",
      "published": "2025-11-17T01:14:40",
      "content": "\n\n\n\t\n\tGirls like pink and peach, right?\t\n\nThat Sky Sports felt the need to launch a TikTok channel specifically marketed towards women and billed as its “lil sis” was questionable enough. But once people got a taste of the content on Halo, it was clear the company had absolutely no idea what it was doing. \n\nHalo didn’t focus on women&#8217;s sports, nor did it seem to be doing a good job of elevating female voices in a male-dominated business. Instead, it slapped pink sparkly letters on videos, talked about “hot girl walks,” matcha, and posted shipping memes. Unsurprisingly, the backlash was swift and strong. \n\nThe Barbification of its sports coverage was called infantilizing, patronizing, sexist, and misogynistic. After just three days, Sky deleted all of Halo’s posts and announced it would be ceasing activity on the account.\n\nHead of audience development and social media at Sky Sports, Andy Gill, posted on LinkedIn that he, “couldn&#8217;t be prouder and more excited about this launch. Proud, because this has been driven by the women in our team…” However, it seems hard to believe, considering the outcry from female sports fans, that Halo’s development was actually driven by the women at the company.\nView Link",
      "content_length": 1231,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Schools close in New Zealand after play sand recalled over asbestos fears",
      "link": "https://www.theguardian.com/world/2025/nov/17/schools-close-in-new-zealand-after-play-sand-recalled-over-asbestos-fears",
      "published": "2025-11-17T01:11:33",
      "content": "Six coloured sand products recalled in New Zealand after testing in Australia found asbestos in similar itemsMultiple schools have temporarily closed in New Zealand and hundreds of education facilities are seeking advice from officials after asbestos was detected in several brands of widely used coloured play sand.Last week, the ministry for business, innovation and employment confirmed a voluntary recall was under way for two brands of coloured sand sold in New Zealand, after testing in Australia found asbestos in similar products. Continue reading...",
      "content_length": 558,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Far-right candidate José Antonio Kast favourite to become Chile’s next president after first round vote",
      "link": "https://www.theguardian.com/world/2025/nov/17/far-right-candidate-jose-antonio-kast-favourite-to-become-chiles-next-president-after-first-round-vote",
      "published": "2025-11-17T01:01:14",
      "content": "The ultraconservative lawyer is in pole position going into the second round election, after running a campaign with a distinctly Trumpian feel​The ultraconservative lawyer, José Antonio Kast, is in pole position to become Chile’s next leader after advancing to the second round of the South American country’s presidential election where he will face the Communist party candidate Jeannette Jara.With more than 70% of votes counted, Kast had secured about 24% of the vote in Sunday’s first round vote, having campaigned on hard-line promises to crack down on crime and immigration, while making a Donald Trump-style pledge to “put Chileans first”. Continue reading...",
      "content_length": 668,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "More than 70 ACT public schools closed over health fears from asbestos-contaminated children’s play sand",
      "link": "https://www.theguardian.com/australia-news/2025/nov/17/more-than-70-act-public-schools-closed-over-health-fears-from-asbestos-contaminated-childrens-play-sand",
      "published": "2025-11-17T00:38:36",
      "content": "Education directorate closed schools for assessment and cleaning despite assessing health risk as ‘low’Follow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastMore than 70 public schools in the ACT were closed on Monday as fears grew over children’s play sand products that may contain asbestos.The territory’s education directorate decided to shut their doors after it found “widespread” use of coloured play sand products sold at Kmart and Target, which were recalled on the weekend. Continue reading...",
      "content_length": 562,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Parents ‘vindicated’ after police admit unlawful arrest over WhatsApp row",
      "link": "https://www.theguardian.com/uk-news/2025/nov/16/hertfordshire-police-admit-unlawful-arrest-of-borehamwood-couple-in-school-whatsapp-row-report",
      "published": "2025-11-17T00:09:59",
      "content": "Hertfordshire police agree to pay £20,000 to Rosalind Levine and Maxie Allen, who were held for 11 hours after complaining about daughter’s schoolTwo parents who were arrested after they complained about their daughter’s primary school on WhatsApp have said they felt “vindicated” by the police admitting the arrest was unlawful.Rosalind Levine and her partner, Maxie Allen, said they were held at a police station for 11 hours over their complaints about the school. Continue reading...",
      "content_length": 487,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Two-thirds of nurses in UK work while unwell, says union",
      "link": "https://www.theguardian.com/society/2025/nov/17/more-than-66-percent-of-nurses-in-england-working-while-unwell-says-royal-college-of-nursing-union",
      "published": "2025-11-17T00:01:45",
      "content": "Understaffing driving workers to ill health and discouraging them for taking leave, says Royal College of Nursing CEONurses across the UK are working while unwell in understaffed hospitals, with stress as the leading cause of illness, according to research.A survey by the Royal College of Nursing (RCN) of more than 20,000 nursing staff found that 66% had worked when they should have been on sick leave, up from 49% in 2017. Continue reading...",
      "content_length": 446,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Asking prices fall as UK housing market hit by budget speculation, Rightmove says",
      "link": "https://www.theguardian.com/business/2025/nov/17/asking-prices-fall-as-uk-housing-market-hit-by-budget-speculation-rightmove-says",
      "published": "2025-11-17T00:01:45",
      "content": "November drop of 1.8% is biggest for this time of year since 2012, with chancellor’s plans loomingBudget speculation has depressed the UK property market, figures from a leading property website have suggested, with asking prices slipping in the run-up to Rachel Reeves’s much anticipated fiscal set piece on 26 November.The average new seller asking price fell by 1.8%, or £6,589, month on month in November, the figures collated by the property website Rightmove set out, taking the average price tag on a British home put up for sale to £364,833. Continue reading...",
      "content_length": 569,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Trump hints at possible talks with Maduro as US ramps up pressure on Venezuela",
      "link": "https://www.france24.com/en/americas/20251116-us-aircraft-carrier-caribbean-washington-venezuela",
      "published": "2025-11-16T23:00:30",
      "content": "President Donald Trump said on Sunday the United States “may be having some discussions” with Venezuelan President Nicolás Maduro, signalling a possible diplomatic opening as Washington expands its military presence near Venezuela. The USS Gerald R. Ford’s arrival, part of a counterdrug mission, has raised concerns it is aimed at pressuring Maduro.",
      "content_length": 350,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Kommentar zum Rentenstreit: Merz verliert Gefühl für seine Partei",
      "link": "https://www.tagesschau.de/kommentar/merz-cdu-kommentar-100.html",
      "published": "2025-11-16T22:44:49",
      "content": "   Im Rentenstreit hat der Kanzler Teile seiner Partei vor den Kopf gestoßen. Doch die Debatte steht nicht alleine da: Eine Serie von Ereignissen lässt vermuten, dass Merz das Gefühl für die Partei verloren habe, meint Hans-Joachim Vieweger.[mehr]",
      "content_length": 247,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "You need to listen to the searing noise pop album Forever in Your Heart",
      "link": "https://www.theverge.com/entertainment/821782/you-need-to-listen-to-the-searing-noise-pop-album-forever-in-your-heart",
      "published": "2025-11-16T22:31:27",
      "content": "\n\n\n\t\n\tThe cover goes as hard as the album does.\t\n\nThere's something irresistible about music that sounds as if it's coming apart at the seams. The Black Dresses are masters of barely contained chaos. All of their records feel as if they're in danger of collapsing into pure noise at any moment. But never have they so expertly woven the various threads of their sound - glitchy percussion, pummeling guitars, irresistible pop hooks - together as they do on Forever in Your Heart.\nThe Canadian duo of Ada Rook and Devi McCallion crafts something undeniably catchy from abrasive electronics, metallic percussion, death-metal screams, and off-key warbling. The opening track, \"PEACESIGN!!!!!!!!!!!!!!! …\nRead the full story at The Verge.",
      "content_length": 734,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Shabana Mahmood warns Labour MPs ‘dark forces are stirring up anger’ over migration",
      "link": "https://www.theguardian.com/world/2025/nov/16/shabana-mahmood-warns-labour-mps-dark-forces-are-stirring-up-anger-over-migration",
      "published": "2025-11-16T22:30:43",
      "content": "There is understood to be growing unease in party over home secretary’s sweeping overhaul of refugee rightsShabana Mahmood has warned Labour MPs that “dark forces are stirring up anger” over migration, amid growing alarm among senior party figures over the most sweeping overhaul of refugee rights in a generation.On Monday, Mahmood will announce controversial new laws to overhaul refugee status, which must be reassessed every two years, as well as curbing asylum appeals and toughening the approach to rights to family life.Restricting asylum seekers to one single appeal rather than different appeals on multiple grounds.Creating a new body for fast-tracking cases for dangerous criminals and those with little hope of success.Legislating to restrict last-minute modern slavery claimsJoining other countries in seeking reform of ECHR article 3 rights, to more narrowly define the risk of torture and degrading treatment.Changing the Home Office’s duty to provide support to asylum seekers to a discretionary power, enabling them to potentially be removed from accommodation. Continue reading...",
      "content_length": 1098,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Umweltminister Schneider verteidigt Deutschlands Rolle beim Klimaschutz",
      "link": "https://www.tagesschau.de/inland/innenpolitik/tt-interview-schneider-klimaschutz-100.html",
      "published": "2025-11-16T21:35:43",
      "content": "   Umweltschützer monieren, dass die Bundesregierung dem Klimaschutz nicht die Priorität einräume, die er bräuchte. Dieser Kritik hat Umweltminister Schneider in den tagesthemen widersprochen und Deutschlands Rolle verteidigt.[mehr]",
      "content_length": 232,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Trump’s investigation into Epstein ties to political foes might be ‘smokescreen’, Republican says",
      "link": "https://www.theguardian.com/us-news/2025/nov/16/trump-epstein-files-republican",
      "published": "2025-11-16T21:20:33",
      "content": "Thomas Massie says move could be Trump’s ‘last-ditch effort’ to keep Epstein files from becoming publicRepublican congressman Thomas Massie challenged Donald Trump on Sunday over whether the US president is making a “last-ditch effort” to keep the full files on the late sex offender Jeffrey Epstein from becoming public by ordering a fresh investigation.Massie and Democratic congressman Ro Khanna, the two US representatives leading the bipartisan push to make all the files held by the government public both raised fresh concerns about the latest actions by the White House. Continue reading...",
      "content_length": 598,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Zelensky vows to reform Ukraine’s energy sector amid corruption storm",
      "link": "https://www.france24.com/en/europe/20251116-zelensky-vows-to-reform-ukraine-s-energy-sector-amid-corruption-storm",
      "published": "2025-11-16T21:17:18",
      "content": "Ukrainian President Volodymyr Zelensky announced a sweeping shake-up of Ukraine’s state energy firms this weekend, including a complete reshuffle of management at Energoatom, the state nuclear power company at the centre of a $100m embezzlement scheme uncovered by investigators.",
      "content_length": 279,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Former associate of Zelensky accused of corruption",
      "link": "https://www.france24.com/en/video/20251116-former-associate-of-zelensky-accused-of-corruption",
      "published": "2025-11-16T21:15:57",
      "content": "Before the revelation of a multimillion dollar embezzlement and kickbacks scandal involving Ukraine's state nuclear energy company brought his name to the forefront, Tymur Mindich was a shadowy presence – navigating deals and moving behind the scenes with unseen influence, known to many, yet rarely spoken of.",
      "content_length": 310,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "UN-Blauhelme im Libanon werfen Israels Armee Beschuss vor",
      "link": "https://www.tagesschau.de/ausland/asien/israel-beschuss-un-blauhelme-100.html",
      "published": "2025-11-16T20:14:40",
      "content": "   Immer wieder geraten die Blauhelme im Libanon zwischen die Fronten. Nun wirft die UN-Mission der israelischen Armee erneut Beschuss der Soldaten vor. Israel will den Vorfall untersuchen und argumentiert mit schlechter Sicht.[mehr]",
      "content_length": 233,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Dozens reportedly arrested in Charlotte, North Carolina, amid immigration crackdown",
      "link": "https://www.theguardian.com/us-news/2025/nov/16/charlotte-north-carolina-immigration-crackdown",
      "published": "2025-11-16T20:13:17",
      "content": "Trump administration has made Democratic-led city its latest target despite fierce objections from local leadersA top border patrol commander touted dozens of arrests in North Carolina’s largest city on Sunday as Charlotte residents reported a surge of encounters with federal immigration agents near churches and apartment complexes.The Trump administration has made the Democratic-led city of about 950,000 people its latest target for an immigration enforcement crackdown it says will combat crime, despite fierce objections from local leaders and the fact that crime rates in the city are steadily declining. Continue reading...",
      "content_length": 632,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Nach Kritik: Auktion in NRW mit Holocaust-Dokumenten abgesagt",
      "link": "https://www.tagesschau.de/inland/regional/nordrheinwestfalen/auktion-neuss-holocaust-opfer-100.html",
      "published": "2025-11-16T19:55:00",
      "content": "   Ein Auktionshaus im nordrhein-westfälischen Neuss plante, Briefe von Holocaust-Opfern sowie Täter-Dokumente zu versteigern. Das Auschwitz-Komitee forderte die Absage des \"zynischen und schamlosen Unterfangens\". Dem kam das Auktionshaus nun nach.[mehr]",
      "content_length": 254,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Roman Abramovich makes claim of ‘conspiracy’ against Jersey government",
      "link": "https://www.theguardian.com/world/2025/nov/16/roman-abramovich-makes-claim-of-conspiracy-against-jersey-government",
      "published": "2025-11-16T19:30:39",
      "content": "Move threatens to throw open parts of secretive legal battle on Channel island about ex-Chelsea owner’s wealthThe former Chelsea owner Roman Abramovich is making a claim of “conspiracy” against the government of Jersey after the crown dependency launched a criminal investigation into allegations of corruption and money laundering in connection with the original source of the oligarch’s wealth.The latest move threatens to throw open parts of a secretive legal battle on the Channel island about the tycoon’s rise to become one of the world’s richest people, which emerged in September after a Switzerland federal criminal court ordered the release of a cache of Swiss banking records requested by the Jersey attorney general. Continue reading...",
      "content_length": 748,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Have courage to create fossil fuel phaseout roadmap at Cop30, Brazilian minister urges",
      "link": "https://www.theguardian.com/environment/2025/nov/16/have-courage-to-create-fossil-fuel-phaseout-roadmap-at-cop30-brazilian-minister-urges",
      "published": "2025-11-16T19:14:13",
      "content": "Marina Silva says contentious plan would be ‘ethical answer’ to climate crisis but does not commit Brazil to itBrazil’s environment minister, Marina Silva, has urged all countries to have the courage to address the need for a fossil fuel phaseout, calling the drawing up of a roadmap for it an “ethical” response to the climate crisis.She emphasised, however, that the process would be voluntary for those governments that wished to participate, and “self-determined”. Continue reading...",
      "content_length": 488,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Stereogum soldiers on in the era of streaming and AI",
      "link": "https://www.theverge.com/entertainment/821767/stereogum-scott-lapatine-independent-music-media-streaming-ai",
      "published": "2025-11-16T19:00:00",
      "content": "\n\n\n\t\n\t\t\n\nIf you're an indie rock fan of a certain age, the name Stereogum will probably conjure strong feelings. The site was launched \"January 1st, 2002, on a whim,\" founder Scott Lapatine told The Verge. Originally, this early staple of the music blog era was focused almost entirely on music discovery and posting MP3s. \"It was the early days of like Windows Media Player and Real Player,\" Scott remembers. Today, the site is focused on music journalism and has just relaunched to keep up with a media landscape being overrun by AI.\nLapatine has been with Stereogum from the beginning, and watched as both the music and media world rapidly changed around …\nRead the full story at The Verge.",
      "content_length": 693,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Netanyahu insists there can be no Palestinian state ahead of UN vote",
      "link": "https://www.france24.com/en/middle-east/20251116-netanyahu-insists-there-can-be-no-palestinian-state-ahead-of-un-vote",
      "published": "2025-11-16T18:28:48",
      "content": "Israeli Prime Minister Benjamin Netanyahu on Sunday vowed to oppose any attempt to establish a Palestinian state, a day before the UN Security Council will vote on a US-drafted resolution on Gaza that leaves the door open to Palestinian independence.",
      "content_length": 250,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "German auction house cancels sale of Holocaust artefacts after outcry",
      "link": "https://www.theguardian.com/world/2025/nov/16/german-auction-house-urged-to-cancel-sale-of-holocaust-artefacts",
      "published": "2025-11-16T18:22:44",
      "content": "Survivors group had called on firm Felzmann to ‘show some basic decency’ and halt ‘cynical and shameless’ eventPoland’s foreign minister said on Sunday that an “offensive” auction of Holocaust artefacts in Germany has been cancelled, relaying information from his German counterpart, after complaints from Holocaust survivors.Radosław Sikorski made the comments on X, saying he and German foreign minister Johann Wadephul “agreed that such a scandal must be prevented”. Continue reading...",
      "content_length": 489,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Merz zu Rentenstreit: \"Bin nicht nur einer Gruppe verantwortlich\"",
      "link": "https://www.tagesschau.de/inland/innenpolitik/merz-rentenpaket-streit-100.html",
      "published": "2025-11-16T17:50:15",
      "content": "   Kanzler Merz hat seine Position zum Rentenpaket gegen Kritik der Jungen Union verteidigt. Er trage für die ganze Regierung Verantwortung, sagte er im Bericht aus Berlin. Er unterstütze aber eine langfristige Reform des Rentensystems.[mehr]",
      "content_length": 242,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Mehr als 100 Tote nach Erdrutsch in Goldmine in Demokratischer Republik Kongo",
      "link": "https://www.tagesschau.de/ausland/afrika/kongo-erdrutsch-goldmine-100.html",
      "published": "2025-11-16T17:24:46",
      "content": "   Der Süden der Demokratischen Republik Kongo ist rohstoffreich und zieht viele Menschen an, die dort in unregulierten Minen ein Einkommen suchen. Bei einem Erdrutsch starben nun mehr als 100 Arbeiter einer solchen Goldmine.[mehr]",
      "content_length": 231,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "New York Jets player Kris Boyd in critical condition after being shot in abdomen",
      "link": "https://www.theguardian.com/sport/2025/nov/16/kris-boyd-new-york-jets-shot-nfl",
      "published": "2025-11-16T17:23:15",
      "content": "29-year-old was shot after incident in MidtownPolice say dispute outside restaurant turned violentNew York Jets player Kris Boyd is hospitalized in critical situation after being shot in the early hours of Sunday morning.The NYPD said the 29-year-old was shot in the abdomen around 2am on West 38th Street in Midtown. He was taken to Bellevue Hospital, where he is in critical but stable condition. Continue reading...",
      "content_length": 418,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "SPD weist Söders Forderung nach \"Mini-Meilern\" zurück",
      "link": "https://www.tagesschau.de/inland/innenpolitik/spd-soeder-mini-meiler-100.html",
      "published": "2025-11-16T17:09:59",
      "content": "   Die SPD hat den Vorstoß von CSU-Chef Söder nach kleineren Atomreaktoren zurückgewiesen: Diese seien teuer, unsicher und verursachten mehr Atommüll. Kritik gab es auch an falschen Aussagen zu \"Mini-Meilern\" in Kanada.[mehr]",
      "content_length": 225,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Will Italy manage to score nine goals in one game to qualify for the FIFA World Cup?",
      "link": "https://www.france24.com/en/video/20251116-will-italy-manage-to-score-nine-goals-in-one-game-to-qualify-for-the-fifa-world-cup",
      "published": "2025-11-16T17:06:05",
      "content": "Another FIFA World Cup nightmare is threatening to engulf Italy. The last time the team played in a World Cup was eleven years ago. If Italy fails to score nine goals against Norway on Thursday, they won’t be qualified to the 2026 World Cup either. Details with FRANCE 24 correspondent in Rome, Seema Gupta.",
      "content_length": 307,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "First major rains pummel Gaza and flood tents of displaced Palestinians",
      "link": "https://www.france24.com/en/video/20251116-first-major-rains-pummel-gaza-and-flood-tents-of-displaced-palestinians",
      "published": "2025-11-16T17:03:56",
      "content": "Winter's first heavy rainfall sent water cascading through Gaza's sprawling Muwasi tent camp on Saturday, as the territory struggles to cope with flooding and devastated infrastructure after two years of war. Story by Rachel Griffiths.",
      "content_length": 235,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Thousands march in indigenous-led protests outside COP30 summit",
      "link": "https://www.france24.com/en/video/20251116-thousands-march-in-indigenous-led-protests-outside-cop30-summit",
      "published": "2025-11-16T17:02:05",
      "content": "Thousands of climate protesters marched through the Brazilian city of Belem on Saturday in a noisy, diverse and peaceful display to demand more action to protect the fate of the planet and vent their anger at governments and fossil fuel industries. Analysis by FRANCE 24 International Affaires Editor, Rochelle Ferguson Bouyahi.",
      "content_length": 328,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Iran says it could rejoin US nuclear talks if treated with ‘dignity and respect’",
      "link": "https://www.theguardian.com/world/2025/nov/16/iran-could-rejoin-us-nuclear-talks",
      "published": "2025-11-16T17:00:36",
      "content": "Iran’s foreign minister says it has had requests to reopen negotiations, which collapsed after nuclear site bombingsTehran is willing to restart nuclear talks with Washington as long as it is treated with “dignity and respect”, Iran’s foreign minister has told the Guardian.Abbas Araghchi said only diplomacy worked, and disclosed fresh requests had come from intermediaries to reopen negotiations with the Trump administration. He said Iran did not have any undeclared nuclear sites, and Tehran could not yet allow the UN nuclear inspectorate to visit bombed nuclear sites for security reasons. Continue reading...",
      "content_length": 615,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Five people killed and three injured in car crash in County Louth, Ireland",
      "link": "https://www.theguardian.com/world/2025/nov/16/people-killed-injured-car-crash-county-louth-ireland",
      "published": "2025-11-16T16:58:45",
      "content": "Gardaí appeal for witnesses and Simon Harris pays tribute to first responders after two-vehicle collision on SaturdayIreland is in mourning after a road crash killed five people in their early 20s and left three other people injured.The two-vehicle collision happened at about 9pm on Saturday on a road near Dundalk in County Louth. Continue reading...",
      "content_length": 352,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Italiens Präsident beschwört am Volkstrauertag den Zusammenhalt Europas",
      "link": "https://www.tagesschau.de/inland/gesellschaft/volkstrauertag-mattarella-europa-100.html",
      "published": "2025-11-16T16:34:26",
      "content": "   Der Bundestag hat der Opfer von Krieg und Gewaltherrschaft am Volkstrauertag gedacht. Italiens Präsident Mattarella erinnerte im Parlament an die Bedeutung der Europäischen Union und warnte vor \"Nachahmern dunkler Zeiten\".[mehr]",
      "content_length": 231,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "The best gifts for dads that have everything (but deserve more)",
      "link": "https://www.theverge.com/gadgets/780847/best-dad-gift-ideas",
      "published": "2025-11-16T16:07:00",
      "content": "\n\n\n\t\n\t\t\n\nWhat do you get the man who says he has everything? It's a tough question - and one you have a limited amount of time to answer, given the holidays are nearly upon us. You could try dropping subtle hints or asking friends and family for suggestions, but they might save their best ideas for themselves. Fortunately, if you're struggling to come up with something, we have more than a few ideas. \nWith the help of Verge staffers, we've compiled suggestions for dads of every make and model. It doesn't matter if he's the type to get up early to prep the smart smoker or if his idea of a perfect Sunday is watching his favorite team absolutely crush  …\nRead the full story at The Verge.",
      "content_length": 693,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Iran reichert nach eigenen Angaben aktuell kein Uran an",
      "link": "https://www.tagesschau.de/ausland/asien/iran-urananreicherung-134.html",
      "published": "2025-11-16T16:05:35",
      "content": "   Die Angriffe Israels und der USA im Sommer haben laut dem iranischen Regime \"erhebliche Schäden\" an den Atomanlagen des Landes angerichtet. Erstmals wurde Außenminister Araghtschi nun konkreter: Aktuell finde keine Urananreicherung statt.[mehr]",
      "content_length": 247,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "The week in pictures: Paris remembers Nov 13 attacks, US shutdown ends and the northern lights",
      "link": "https://www.france24.com/en/culture/20251116-the-week-in-pictures-paris-remembers-nov-13-attacks-us-shutdown-ends-northern-lights",
      "published": "2025-11-16T15:52:04",
      "content": "Paris marked the 10th anniversary of the November 13 terror attacks, the government shutdown in the United States came to an end, and spectacular northern lights illuminated skies across Europe. FRANCE 24 takes a look back at the week's most striking images.",
      "content_length": 258,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "How LimeWire ended the Napster music revolution",
      "link": "https://www.theverge.com/podcast/820818/limewire-music-piracy-version-history",
      "published": "2025-11-16T15:46:28",
      "content": "\n\n\n\t\n\t\t\n\nQuick: tell me how old you are by telling me which app you used to download free music. Was it Napster? Kazaa? Usenet? Gnutella? WinMX? Morpheus? The Pirate Bay? Were you, I don't know, sending your friends songs on AIM or BBM? The possibilities are endless. For a decade or so, if you were online, you were probably stealing music.\nFor this episode of Version History, we're telling the story of one of the last big names in file sharing: LimeWire. If the era of mainstream access to free music (mostly on college campuses and other fast networks) starts with Napster, it almost certainly ends with LimeWire. \n\nLimeWire was, in many ways, design …\nRead the full story at The Verge.",
      "content_length": 691,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Weltklimakonferenz: Spanien und Frankreich fordern Abgabe auf Luxus-Flugreisen",
      "link": "https://www.tagesschau.de/ausland/amerika/brasilien-weltklimakonferenz-abgabe-luxusreisen-100.html",
      "published": "2025-11-16T15:44:01",
      "content": "   Auf der Weltklimakonferenz werben Spanien und Frankreich für eine zusätzliche Abgabe auf Business-Class-Tickets und Reisen mit Privatjets. Deutschland unterstützt das Vorhaben - trotz der gerade erst beschlossenen Steuersenkung für die Luftfahrt.[mehr]",
      "content_length": 255,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Ecuador votes on return of foreign military bases and how to tackle drug violence",
      "link": "https://www.france24.com/en/americas/20251116-ecuador-votes-return-foreign-military-bases-how-tackle-drug-violence",
      "published": "2025-11-16T15:40:47",
      "content": "Ecuadorans went to the polls Sunday to vote on whether to allow the return of foreign military bases to the country, how to tackle drug violence and the drafting of a new constitution that could give its Trump-friendly President Daniel Noboa more power.",
      "content_length": 253,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Whisky-Markt in Aufruhr: \"Zum Glück wird das Zeug nicht schlecht\"",
      "link": "https://www.tagesschau.de/wirtschaft/whisky-spirituose-branche-100.html",
      "published": "2025-11-16T15:28:59",
      "content": "   Whisky-Liebhaber treffen sich in Wiesbaden zur Messe \"InterWhisky\". Die Spirituose ist gerade in deutschen Clubs sehr beliebt. Doch viele Probleme setzen den traditionellen Herstellern massiv zu. Von Klaus-Rainer Jackisch.[mehr]",
      "content_length": 231,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Welche Folgen der Rentenstreit in der Union haben könnte",
      "link": "https://www.tagesschau.de/inland/union-rentenpaket-streit-faq-100.html",
      "published": "2025-11-16T15:16:42",
      "content": "   Bislang war die Junge Union für den Kanzler eine sichere Machtbasis. Doch der Streit über das Rentenpaket entzweit Merz und den Parteinachwuchs. Was das für den Gesetzentwurf bedeuten könnte - und für die Koalition.[mehr]",
      "content_length": 224,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "AI pioneer Yann Le Cun is quitting Meta over the future of intelligence",
      "link": "https://www.france24.com/en/tv-shows/tech-24/20251116-ai-pioneer-yann-le-cun-is-quitting-meta-over-the-future-of-intelligence",
      "published": "2025-11-16T15:16:10",
      "content": "Reports suggest Yann Le Cun, one of the \"godfathers of AI\", is leaving Meta after over a decade pioneering artificial intelligence research at Mark Zuckerberg's tech titan. Le Cun says he no longer believes that scaling up large language models of the kind that power ChatGPT will lead to superhuman intelligence. Instead, he's betting on \"world models\", AI that learns more like a baby than a bot.",
      "content_length": 398,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "The Asus Falcata is an ambitious split ergo gaming keyboard that falls short",
      "link": "https://www.theverge.com/tech/821355/asus-falcata-review-hall-effect-switches-split-ergo-gaming-keyboard",
      "published": "2025-11-16T15:00:00",
      "content": "\n\n\n\t\n\tEach half is compact, and they fit together for easy travel.\t\n\nHall effect gaming keyboards aren't uncommon. But Asus' ROG Falcata is the only one that's also a split ergonomic keyboard, aimed at alleviating wrist, hand, or arm pain. For the luxury of having it all, you'll pay $419.99, enough to buy a nice Hall effect keyboard and a split ergonomic one. \nIt'd be worth it if the Falcata truly represented the best of both worlds, but I'm split. As a Hall effect board, it succeeds, offering a wealth of customization options, including the ability to let you adjust each key's actuation point by as little as a hundredth of a millimeter at a time. But if you're buying it for ergonomics, like me, then maybe n …\nRead the full story at The Verge.",
      "content_length": 753,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Israeli soldiers shoot at UN peacekeepers in southern Lebanon",
      "link": "https://www.france24.com/en/middle-east/20251116-israeli-soldiers-shoot-un-peacekeepers-southern-lebanon",
      "published": "2025-11-16T14:29:21",
      "content": "The United Nations Interim Force in Lebanon (UNIFIL) said Sunday that Israeli soldiers had shot at its peacekeepers from a tank near an army position in the country's south. Israel responded that it had not intended to open fire on the peacekeepers, who it had mistaken for \"suspects\".",
      "content_length": 285,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Sam Altman: ChatGPT macht weniger Gedankenstriche",
      "link": "https://www.heise.de/news/Sam-Altman-ChatGPT-macht-weniger-Gedankenstriche-11080329.html",
      "published": "2025-11-16T14:16:00",
      "content": "In einem Post bei X erklärt der OpenAI-Chef, dass man ein leidiges Problem mit den überlangen Querstrichen in den Griff bekommen hat.",
      "content_length": 133,
      "source": "Heise Developer",
      "category": "Tech News"
    },
    {
      "title": "Ecuador captures drug gang kingpin 'Pipo' Chavarria who had fled to Europe",
      "link": "https://www.france24.com/en/americas/20251116-ecuador-captures-drug-gang-kingpin-pipo-chavarria-who-had-fled-to-europe",
      "published": "2025-11-16T14:01:15",
      "content": "'Pipo’ Chavarria, the leader of Ecuador’s biggest drug-trafficking gang, has been captured, Ecuador's President Daniel Noboa announced Sunday. Chavarria had \"faked his death, changed his identity and hid in Europe\", the president said, and was captured in Spain.",
      "content_length": 262,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "China races for space dominance: Its bold plans for the moon and beyond",
      "link": "https://www.france24.com/en/video/20251116-china-races-for-space-dominance-its-bold-plans-for-the-moon-and-beyond",
      "published": "2025-11-16T13:49:31",
      "content": "A trio of Chinese astronauts returned to Earth on Friday after getting stuck on China's space station, Tiangong, for more than a week due to their spacecraft sustaining debris damage, leaving China without an immediate way of bringing home the new crew in an emergency. Due to the risk of overheating, Russia's space agency decided to send Soyuz MS-23 to the ISS to bring back the crew of the slightly damaged vessel. In light of what has happened, how will China adapt its Space program? Answer and analysis by Ling Shin, science journalist at the South China Morning Post.",
      "content_length": 574,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "Donald Trump's Gaza plan arrives at the UN Security Council",
      "link": "https://www.france24.com/en/video/20251116-donald-trump-s-gaza-plan-arrives-at-the-un-security-council",
      "published": "2025-11-16T13:46:08",
      "content": "The UN Security Council will vote Monday on a resolution endorsing US President Donald Trump's Gaza peace plan, diplomats said. Last week the Americans officially launched negotiations within the 15-member Security Council on a text that would follow up on a ceasefire in the two-year war between Israel and Hamas and endorse Trump's plan. Story by France 2 and Caroline Baum.",
      "content_length": 376,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "UK government defends asylum crackdown, PM Starmer under pressure from far right",
      "link": "https://www.france24.com/en/video/20251116-uk-government-defends-asylum-crackdown-pm-starmer-under-pressure-from-far-right",
      "published": "2025-11-16T13:43:28",
      "content": "Britain's interior minister on Sunday defended plans to drastically reduce protections for refugees and end automatic benefits for asylum seekers, insisting that irregular migration was \"tearing our country apart\". The measures, modelled on Denmark's strict asylum system, aim to stop thousands of migrants from arriving in England from northern France on small boats -- crossings that are fuelling support for the anti-immigrant Reform UK party. But the proposals were criticised as \"harsh and unnecessary\" by the Refugee Council charity and are likely to be opposed by left-wing lawmakers within Prime Minister Keir Starmer's embattled Labour government. Story by Charlotte Lam and details by FRANCE 24 correspondent in London, Bénédicte Paviot.",
      "content_length": 747,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "'Not in our name': Afrikaners push back against Trump’s false white genocide claims in South Africa",
      "link": "https://www.france24.com/en/africa/20251116-not-in-our-name-afrikaners-push-back-trump-false-white-genocide-claims-south-africa-letter",
      "published": "2025-11-16T13:27:57",
      "content": "While the US has announced special treatment for white South Africans seeking asylum, local division between left and right leaning groups in South Africa deepens.",
      "content_length": 163,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "How soapy micro dramas became Hollywood&#8217;s next big bet",
      "link": "https://www.theverge.com/column/821345/micro-dramas-how-hollywood",
      "published": "2025-11-16T13:00:00",
      "content": "\n\n\n\t\n\t\t\n\nThis is The Stepback, a weekly newsletter breaking down one essential story from the tech world. For more on Hollywood trends and streaming culture, follow Charles Pulliam-Moore. The Stepback arrives in our subscribers' inboxes at 8AM ET. Opt in for The Stepback here.\nHow it started\nOnce upon a time (read: a few years ago), there were a pair of upstart streaming services called Quibi and Go90 that were supposed to appeal to phone-addicted millennials. These platforms were supposed to compete with Netflix and Amazon by offering up short-form videos designed to be watched on the go. Both services were touted as being the future of entertainm …\nRead the full story at The Verge.",
      "content_length": 692,
      "source": "The Verge",
      "category": "Tech News"
    },
    {
      "title": "Iran launches cloud seeding operations to induce rainfall as severe drought deepens",
      "link": "https://www.france24.com/en/middle-east/20251116-iran-launches-cloud-seeding-operations-rain-severe-drought-deepens",
      "published": "2025-11-16T12:40:36",
      "content": "Iran's government has begun cloud seeding operations over the nation's largest lake, which has largely dried out due to the Islamic republic's worst drought in decades. Iran announced last year that it had developed its own technology to help trigger rainfall.",
      "content_length": 260,
      "source": "France 24 English",
      "category": "International News"
    },
    {
      "title": "The evolution of rationality: How chimps process conflicting evidence",
      "link": "https://arstechnica.com/science/2025/11/the-evolution-of-rationality-how-chimps-process-conflicting-evidence/",
      "published": "2025-11-16T12:00:34",
      "content": "When Aristotle claimed that humans differ from other animals because they have the ability to be rational, he understood rational to mean that we could form our views and beliefs based on evidence, and that we could reconsider that evidence. “You know—ask ourselves if we should really believe that based on the evidence we’ve got,” says Jan M. Engelmann, an evolutionary anthropologist at the University of California, Berkeley.\nEngelmann says that from the beginning of the Western intellectual tradition, people thought that only humans are rational. So, he designed a study to see if rationality shows up in chimpanzees. It turned out that they’re almost as rational as we are.\nFood puzzles\n“There was quite a bit of research showing that chimpanzees can form their beliefs in response to evidence,” Engelmann says. The experiments usually involved chimpanzees deciding which of the two boxes contained a snack. When the researchers shook both boxes and there was a rattling sound coming from one of them, the chimps almost always chose the box where the rattling came from.Read full article\nComments",
      "content_length": 1104,
      "source": "Ars Technica",
      "category": "Tech News"
    },
    {
      "title": "Chile votes for next president in contest dominated by crime and migration fears",
      "link": "https://www.theguardian.com/world/2025/nov/16/chile-election-president-crime-migration-fears",
      "published": "2025-11-16T11:55:58",
      "content": "Voters face seemingly extreme choice between communist and rightwing frontrunners, who both promise to fight foreign gangsChileans began voting for a new president and parliament on Sunday, in a contest expected to favour the hard right as candidates play on popular fears over organised crime and immigration.It is the first of an expected two rounds of presidential elections, as polls show none of the candidates clearing the 50% threshold needed to avoid a runoff scheduled for 14 December. Continue reading...",
      "content_length": 514,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Spannungen mit Japan: China dringt in Gewässer um Senkaku-Inseln ein",
      "link": "https://www.tagesschau.de/ausland/asien/china-japan-spannungen-100.html",
      "published": "2025-11-16T11:16:28",
      "content": "   Die Senkaku-Inseln werden von Japan kontrolliert. Nun ist die chinesische Küstenwache in die Gewässer eingedrungen - und sorgt damit in den bereits angespannten Beziehungen mit Tokio für weiteren Zündstoff. [mehr]",
      "content_length": 216,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Ukraine will Gefangenenaustausch mit Russland wieder aufnehmen",
      "link": "https://www.tagesschau.de/ausland/gefangenenaustausch-ukraine-russland-108.html",
      "published": "2025-11-16T10:37:51",
      "content": "   Die Ukraine hofft auf eine Wiederaufnahme des Gefangenenaustauschs mit Russland. Es geht um die Freilassung von 1.200 ihrer Soldaten. Das bekräftigte Präsident Selenskyj, der von heute an durch mehrere europäische Länder reist.[mehr]",
      "content_length": 236,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Neuer Präsident: Chile wählt zwischen Extremen",
      "link": "https://www.tagesschau.de/ausland/amerika/chile-wahl-praesident-100.html",
      "published": "2025-11-16T10:25:05",
      "content": "   Ultrarechter oder Kommunistin - Chile hat die Wahl. Nach innenpolitisch turbulenten Jahren deutet sich vor der heutigen Präsidentenwahl ein Rechtsruck an. Sicherheit und Migration stehen für viele Wähler im Fokus. Von A. Herrberg.[mehr]",
      "content_length": 239,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Caribbean reparations leaders in ‘historic’ first UK visit to press for justice",
      "link": "https://www.theguardian.com/world/2025/nov/16/caribbean-reparations-crc-uk-visit-britain-colonial-legacy",
      "published": "2025-11-16T09:00:27",
      "content": "CRC mission will seek to deepen public understanding of Britain’s colonial legacy and its lasting impactA delegation from the body leading the Caribbean’s slavery reparations movement will be in the UK next week for a “historic” first official visit to advocate for former British colonies.The Caricom Reparations Commission (CRC) will be meeting with UK parliamentarians, Caribbean diplomats, academics and civil society groups from 17 to 20 November. Continue reading...",
      "content_length": 472,
      "source": "The Guardian World",
      "category": "International News"
    },
    {
      "title": "Luftverkehrssteuer: Union fordert günstigere Flugtickets",
      "link": "https://www.tagesschau.de/inland/luftfahrt-fluggesellschaften-union-sommerurlaub-ticketpreise-100.html",
      "published": "2025-11-16T08:34:23",
      "content": "   Die Luftverkehrssteuer soll im kommenden Jahr sinken, um die Flugbranche zu entlasten. Geht es nach dem Unions-Experten Stracke, sollen auch Reisende davon profitieren - am besten schon zum nächsten Sommerurlaub.[mehr]",
      "content_length": 221,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Forschende haben Hinweise auf einen geheimen Eingang entdeckt",
      "link": "https://www.tagesschau.de/wissen/forschung/pyramide-gizeh-mykerinos-eingang-100.html",
      "published": "2025-11-16T08:06:50",
      "content": "   Die Pyramide des Pharaos Mykerinos im ägyptischen Gizeh hat offenbar einen weiteren, bisher unbekannten Eingang. Das folgern Wissenschaftler aus Kairo und München aus Messdaten von der Außenfassade. Von Sebastian Kirschner.   [mehr]",
      "content_length": 235,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Klöckner ruft zur Verteidigung der Demokratie auf",
      "link": "https://www.tagesschau.de/inland/volkstrauertag-158.html",
      "published": "2025-11-16T07:49:45",
      "content": "   Zum Volkstrauertag fordert Bundestagspräsidentin Klöckner ein aktives Eintreten für Frieden und Demokratie. Bei der Gedenkveranstaltung im Bundestag wird der Opfer der Weltkriege und des Nationalsozialismus gedacht – ein Appell zum Handeln.[mehr]",
      "content_length": 249,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Milliardenmarkt: Das Geschäft mit Schönheit boomt",
      "link": "https://www.tagesschau.de/wirtschaft/botox-hyaluron-schoenheit-operationen-beauty-100.html",
      "published": "2025-11-16T07:34:21",
      "content": "   Ob Botox gegen Falten oder Hyaluron für volle Lippen - ästhetische Behandlungen sind gefragter denn je. Immer mehr Menschen investieren nicht nur Zeit, sondern auch viel Geld in ihr Äußeres. Was treibt den Trend an? Von Anne-Catherine Beck.[mehr]",
      "content_length": 249,
      "source": "Tagesschau",
      "category": "German News"
    },
    {
      "title": "Ficos langer Arm - bis in die Berge der Slowakei",
      "link": "https://www.tagesschau.de/ausland/europa/slowakei-fico-spaltung-100.html",
      "published": "2025-11-16T07:33:39",
      "content": "   Zwei Jahre nach dem Wahlsieg von Ministerpräsident Fico zeigt sich die Slowakei mehr denn je gespalten. Fico treibt den Umbau des Landes voran - und das wirkt sich bis in eine Berghütte der Hohen Tatra aus. Von D. Handrick.[mehr]",
      "content_length": 232,
      "source": "Tagesschau",
      "category": "German News"
    }
  ]
}